[{"album": "Album: Late Registration", "lyrics": "(feat. GLC, Paul Wall, T.I.)\n[Kanye West]\nMy homie Mali used to stay, 79th and May\nOne of my best friends from back in the day\nDown the street from Calumet, a school full of stones\nHe nicknamed me K-Rock so they'll leave me alone\nBulls jacket with his hat broke way off\nAnd walked around the mall with his radio face off\nPlus he had the spinner from his Daytons in his hand, keys in his hand\nReason again to let you know he's the man\nBack when we rocked Alieses, he had dreams of Caprices\nDrove by the teachers, even more by polices\nHow he get the cash the day his father passed away\nLeft him with a lil somethin, 16 he was stuntin'\n\"Al B. Sure\" nigga with the hair all wavy\nHit Lakeshore, girls go all crazy\nHit the freeway, go at least bout 80\nBoned so much that summer, even had him a baby\nSee back back then then if you had a car\nYou was the Chi-Town version of Baby\nAnd I was just a virgin, a baby\nOne of the reasons I looked up to him crazy\nI used to love play my demo tape when the system yanked\nFelt like I was almost signed when the shit got cranked\nWe'll take a Saturday and just circle the mall\nThey had they Lincoln's and Aurora's, we was hurtin 'em all\nWith the girls alot of flirtin' involved but dog..\nFuck all that flirtin', I'm tryin' to get in some drawers, so\nPut me on with these hoes homie\nHe told me, \"Don't rush to get grown, drive slow homie\"\n[Chorus: Kanye West]\nDrive slow, homie\n(Drive slow)\nYou never know, homie\nAbout these hoes homie\nYou need to pump your brakes and drive slow, homie\n[Verse 2: Paul Wall]\nWhat it do?\nI'm posted up in the parking lot, my trunk wavin\nThe candy gloss is immaculate, its simply amazing\nThem elbows pokin wide on that candy 'Lac\nTrunk open, screens on, neon's lit with 5th relaxed\nI'm on a mission for dime pieces and sexy ladies\nAllow me to introduce you to my CL Mercedes\nIt's a star-studded event when I valet park\nOpen up my mouth and sunlight illuminates the dark\nYou see them 4's crawlin, you see them screens fallin\nThe disco ball in my mouth insinuates I'm ballin'\nI'm leanin on the switch, sittin crooked in my slab\nBut I could still catches boppers if I drove a cab\nA young Houston hard-hitter all about the scrilla\nRidin' somethin' candy-coated crawlin' like a caterpillar\nI'm tippin' on them 4's, I'm jammin' on that Screw\nI'm lookin' for them hoes baby, what it do\n[Chorus: Kanye West (GLC)]\nDrive slow, homie\n(Turn your hazard lights on when you see them hoes)\nDrive slow, homie\n(If you ridin' around the city with nowhere to go)\nDrive slow, homie\n(Live today, cause tomorrow man, you never know)\nYou never know, homie\nMight meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\n[Kanye West]\nMy car's like the movie, my car's like the crib\nI got mo TV's in here than where I live\n[GLC]\nAnd that don't make no sense, but baby I'm the shit\nAnd everything I flip, you know it's somethin serious\nI got the custom grill, I got the Bravis rims\nI got the baller genetics baby this evidence\nYou see a player flickin', and how you ain't convinced\nThat you should go on and kiss it, just a lil bit (just a lil bit)\nI wearin my custom kicks, I got my Jesus chain\nMy canary's is gleamin', through my angel wings\nThey see me, hoes actin' like they seen a king\nWith that mean lean, smokin on that finest Cali green\nMy woodgrain oak, I'm ridin on Vogues\nMy cylinder quiet, like tip-toes\nI sold O's, and this I know\nWhen you see them hoes, lil homie drive slow [echoes]\n[Tony Williams harmony ad-libs]\n[T.I.]\nLookin' at the life through my rearview, all the problems I had\nCould be seen alot clearer after time had passed\nKnown for livin' so fast, they wonder how he don't crash\nWith 220 on the dash, he constantly mashin'\n(Why don't he slow down?) They be constantly askin'\nBut me in the fast lane is like metal and magnets\nNow I ain't tryna say that it's the way of the masses\nBut it, so hard to change, I love this shit with a passion\nSince me and Sigel cuttin' classes, showin' our ass\nShootin' out in broad day in the middle of traffic\nI remember sellin' crack faster than I could bag it\nA shame I ain't playin' with you shorty, I ain't braggin'\nMe and Cap got life, some other folk got blasted\nHad a partner OD'd and after this all happened\nIt's like the only thing that kept a pimp from cryin' and laughin'\nAnd the Lord smiled on me at the end of the madness\nI never thought that I'd make it this far rappin'\nFor introducin' the youth to what we now call trappin'\nConsidered now a classic, who'da imagined?\nMe in Milano, gettin' models in next year's fashions\nSo nowadays, they can call me old fashioned\nBut it's way too much cash to see blue lights flashin'\nSo I guess the moral of this here class is\nLife about who make it now not about who make it the fastest\nDrive slow homie\nDri, uh dri slowly\n", "title": "Drive Slow (T.i. Remix) lyrics"}, {"album": "Album: Late Registration", "lyrics": "But it's too late, it's too late\nHe, gone\n[Kanye West]\nYou sweat her, and I ain't talkin 'bout a Coogi\nYou a big L, and I ain't talkin 'bout Cool J\nSee me at the airport, at least 20 Louis\nTreat me like the Prince and this my sweet brother Numpsay\nBROTHER NUMPSAY! Groupies sound too choosy\nTake 'em to the show and talk all through the movies\nSays she want diamonds, I took her to Ruby Tuesdays\nIf we up in Friday's, I still have it my way\n[Chorus]\nToo late, we, gone - we strivin home\nGone - we ride on chrome\nIt's too late\n[Kanye West]\nY'all don't want no prob from me\nWhat you rappers could get is a job from me\nMaybe you could be my intern, and in turn\nI'll show you how I cook up summer, in the win-turr\nAaron love the raw dog, when will he learn\nCaught somethin on the Usher tour he had to \"Let it Burn\"\nPlus he already got three chil'run\nArguin over babysitters like, \"Bitch - it's yo' turn!\"\nDamn 'Ye, it'd be stupid to ditch you\nEven your superficial raps is super official\nR-R-R-Roc pastel with Gucci on\nWith TV's in the ride, throw a movie on\nSaid he couldn't rap now he at the top with doobie long\nCause the dookie's on any song that they threw me on, gone\n[Chorus]\nWe strivin home, gone\n[Cam] I ride on chrome...\nWe strivin home, gone\n[Cam] Killa, I ride on chrome\n[Cam'Ron]\nKnock knock, who's there? Killa Cam, Killa who?\nKilla Cam, hustler, grinder, gorilla true\nOh my chinchilla blue, blue you ever dealt with a dealer\nWell here's the deal ma we goin to the {?}\nNo concealin, no ceiling I don't need a roof\nAct up, get out, I don't need you poof\nPoof, be gone, damn tough luck dag\nDag, niggaz still doin puff puff pass\nPull the truck up fast and I tell 'em\nHey, back in a touched up Jag, shit\nY'all niggaz want Killa Cam, cerebellum\nAn old man just gon' tell 'em (too late, he, gone)\nThen I see how y'all gonna react when I'm (gone)\nMy last girl want me back then I'm on\nFine stay, you got the grind hey\nCame back, read what the sign say (too late, he, gone)\nYes I know you wanna see my demise\nYeah you church boy actin like a thief in disguise\nAin't leavin my side, see the greed in my eyes\nAsk Abby y'all hustle for a week to the Chi, shit\nAnd that ain't leavin alive, please believe me\nGave Weezy a piece of the pie, and\nYou can ask George or Regina\nThe whole Westside I explore with the Beemer now\n[Chorus]\nWe strivin home, I ride on chrome\nListen homeboy move on\nThat's your best bet, why's that?\nCause\n[Consequence]\nUhh, uhh, yo, yo\nI been pourin out some liquor for the fact that my pal's gone\nAnd tryin to help his momma with the fact that her child gone\nAnd since we used to bubble like a tub full of Calgon\nGuess it's only right that I should help her from now on\nBut since they got a foul on, what coulda gone wrong\nNow they askin Cons, how long has this gone on\nAnd maybe all this money mighta gone to my head\nCause they got me thinkin money mighta gone to the feds\nSo I ain't goin to the dread, but he'll go on up to bed\nAnd when I came the next mornin he was gone with my bread\nAnd with that bein said, I had gone on my instincts\nAnd gone to the spots where they go to get mixed drinks\nBut lookin back now shoulda gone to the crib\nAnd rented \"Gone With the Wind,\" cause I'da gone about 10\nBut I had gone with my friend, and we had gone to the bar\nAnd heard a nigga talkin shit so I had gone to the car\nAnd now the judge is tellin me that I had gone too far\nAnd now we gone for 20 years, doin time behind bars\nAnd since I gone to a cell for some cruddy crimes\nI guess I gone to the well one too many times, cause I'm gone\n[long instrumental pause]\n[Kanye West imitating \"The Show\" at first]\nUh-uh-uh\nUh-uh-uh uh uh onnn, uh uh-uh onnn\nUh-uh onnn, uh uh-uh I'mmmm\nAh-head of my time, sometimes years out\nSo the powers that be won't let me get my ideas out\nAnd that make me wanna get my advance out\nAnd move to Oklahoma and just live at my Aunt's house\nYeah, I romance the thought of leavin it all behind\nKanye step away from the lime-\n-light, like, when I was on the grind\nIn the \"One, Nine, Nine, Nine\"\nBefore, model chicks was bendin over or\nDealerships asked me Benz or Rover, man\nIf I could just get one beat on Hova\nWe could get up off this cheap-ass sofa\nWhat the summer of the Chi got to offer an 18-year-old\nSell drugs or get a job, you gotta play gyro\nMy dawg worked at Taco Bell, hooked us up plural-fied\nA week later the manager count the churros\nSometimes I can't believe it when I look up in the mirrow\nHow we out in Europe, spendin Euros\nThey claim you never know what you got 'til it's GONE\nI know I got it, I don't know what y'all on\nI'ma open up a store for aspiring MC's\nWon't sell 'em no dream, but the inspiration is free\nBut if they ever flip sides like Anakin\nYou'll sell everything includin the mannequin\nThey got a new bitch now you Jennifer Aniston\nHold on I'll handle it, don't start panickin, stay calm\nShorty's at the door cause they need more\nInspiration for they life, they souls, and they songs\nThey said sorry Mr. West is gone!\n", "title": "Gone(feat. Consequence, Cam'ron) lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Bernie Mac]\n[laughs]\nI knew I was gonna see ya, I knew I was gonna see you again!\nI was gonna see you again\nWhere your god damn book bag at?\nAlways carryin' that lil book bag\nNobody wanna see that\nGod damn fourth grader\nSit yo' ass down\n?? wanna play it again like he got somethin else to do\nYou ain't got nothin' else to do\nYou ain't doin nothin wit yo life\n[piano starts]\nNothing with your life\nWhat do you think this is?\nYou betta look at me when i'm talkin' to you!\nYou think this is easy don't you?\nYou think this is promised\nOh ain't nothin promised with you\nLook at my face, do I got a promise face?\nDoes it look like promise you anything?\nKanye!\nNi**a! Is you snorin' in my class?\nWake up Mr. West! Mr. West\n[echoes into next song]\n", "title": "Wake Up Mr. West(feat. Bernie Mac) lyrics"}, {"lyrics": "{*The song starts with Jay-Z - Izzo (H.O.V.A.)*}\nLadies and gentlemen let's put our hands together for the astonishing\nH to the izz-O, V to the izz-A\n[Jay-Z]\nWelcome ladies and gentlemen to the 8th wonder of the world\nThe flow of the century, oh it's timeless, HOV'!\nThanks for comin' out tonight\nYou could've been anywhere in the world, but you're here with me\nI appreciate that, uhh\n*The song changes to: The Jackson Five - I Want You back*\n*The song changes to: The Doors - Five to One*\n[Kanye West talking]\nYo this song right here, I remember I used to play\nThis sample for people before I hooked up\nAnd I used to tell people \"you know, this, this gon' be like The Truth\nBut it's gon' better than The Truth\", and to all my niggaz, my nigga ??? said:\n\"I mean ask these but it ain't no Truth, that ain't no Truth right there!\"\nAnd he was all like, the Takeover\n[Jim Morrison]\nFive to one, baby, one in five\nNo one here, gets, out alive, now\nYou'll get yours, baby, I'll get mine\nGonna make it, baby, if we try\nThe old get old, and the young get stronger\nMay take a week, and it may take longer\nThey got the guns, but we got the numbers\nGonna win, yeah we're, takin' over\nCome on!\n*The song changes to: Jay-Z - Takeover*\n[Jay-Z]\nR.O.C., we runnin' this rap shit\nMemphis Bleek, we runnin' this rap shit\nB. Mac, we runnin' this rap shit\nFreeway, we runnin' this rap shit\nO and Sparks, we runnin' this rap shit\nChris and Neef, we runnin' this rap shit\nThe takeover, the break's over nigga\nGod MC, me, Jay-Hova\nHey lil' soldier you ain't ready for war\nR.O.C.'s too strong for y'all\n[Kanye West]\nAcrite nigga!\n*The song changes to: Jay-Z - Heart of the City (Ain't no Love)*\n[Jay-Z]\nUh, uh, listen\nFirst the Fat Boys break up, now every day I wake up\nSomebody got a problem with Hov'\nWhat's up y'all niggaz all fed up cause I got a little cheddar\nand my records movin' out the store\n*The song changes to: Bobby \"Blue\" Bland - Ain't no Love in the Heart of the City*\n[Bobby \"Blue\" Bland]\nAin't no love, in the heart of the city\nAin't no love, in the heart of town\nAin't no love..\n*The song changes to: David Ruffin - Common Man*\n[David Ruffin]\nYeeehh\n*The song changes to: Jay-Z - Never Change*\n[Jay-Z (David Ruffin)]\n(Never, never, never, never change)\nI never change, this is Jay every day\n(I never change!)\nI never change, this is Jay every day\n(I never change!)\nI never change, this is Jay\n", "title": "I'm Good (Feat. Jay-z) lyrics"}, {"lyrics": "[Intro]\nYou just popped in the Kanye West\nGet right for the summer workout tape\nAnd ladies if you follow these instructions exactly\nyou might bear to pull you a rapper, a NBA player\nMan, at least a dude wit' a car\nSo first of all we gon' work on the stomach\nNobody wants a little tight ass!\n[Verse 1]\n1 and 2 and 3 and 4 and get them sit ups right and\nTuck your tummy tight and do your crunches like this\nGive head, stop breathe, get up, check your weave\nDon't drop the blunt and disrespect the weed\nPick up your son and don't disrespect your seed\nIt's a party tonight and ooh she's so excited\nTell me who's invited: you, your friends and my dick\nWhat's scary to me is Henny makes girls look like Halle Berry to me\nSo excuse me miss, I forgot your name\nThank you, God bless you, good night I came..\nI came...\nI came..\n[Chorus]\nIt's been a week without me\nand she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nthen maybe we can work it out\nWork it out (Come on) [4x]\nWork it out now\nMaybe we can work it out (Come on, come on)\n[Verse 2]\nOh girl your silhouette make me wanna light a cigarette\nMy name Kanye from the Jigga set Twista said get it wet\nOoh girl your breath is HARSH\nCover your mouth up like you got SARS\nOff them tracks yea I bought them cars\nStill killa a nigga on 16 bars\nWe ain't sweatin' to the oldies we jukin to a cold beat\nMaybe one day girl we can bone\nso you can brag to all your homies now\nBut I still mess with a big girl if you ain't fit girl I'll hit girl\n1 and you brought 2 friends OK 3 more now hop in the Benz\nFour door do you know the difference between a 5, 6, 7, 8\nAll the mocha lattes you gotta do Pilates\nYou gotta pop this tape in before you start back dating\nHustlers, gangstas, all us, ballas\n[Chorus]\nIt's been a week without me\nand she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nthen maybe we can work it out\nWork it out (Come on) [4x]\nWork it out now\nMaybe we can work it out (Come on, come on)\n[Interlude: Ladies speaking w/ Kanye in the background]\n[Jill] Hi may name is Jill, I just want to say thanks to\nKanye's workout plan. I was able to pull a NBA player\nand like now I shop every day on Rodeo drive\nI just want to say, thank you Kanye! woooo! woooo! woooo!\n[Asandra] My name is Asandra, and I just want to say\nthat ever since listenin' to Kanye's workout tape\nI was able to get my phone bill paid, I got sounds and 13's\nput up in my Cavalier and I was able to get a free trip to Cancun\nAnd what's most importantly is that I ain't gotta fuck Ray Ray's\nbroke ass no mo'\n(Work it mo' juge it mo' pump it mo, Chi-town mo' let's go mo')\n[Alamae] My name is Alamae from Mobille, Alabama\nand I just want to say since listenin' to Kanye's workout tape\nI been able to date outside the family, I got a double wide\nAnd I rode the plane, rode the plane, rode the plane\n[Girl] Thanks to Kanye's workout plan\nI'm the envy of all my friends\nSee I pulled me a baller man (yeah)\nAnd I don't gotta work at the mall again\n[Beat changes]\n(Lemme break ya wit' a piece of)\nMy favorite work out plan (oh! oh! oh!)\nI wanna see you work out (yeah yeah yeah yeah, yeah yeah yeah yeah)\n(It's that old Michael Jackson shit)\nThat's right put in work, move your ass, go wizzerk\nGet your salad, no dessert\nGet that man you deserve\nIt's Kanye's workout plan\nI said it's Kanye's workout plan (Ladies and gentlemen)\nIt's Kanye's workout plan (Allow myself to introduce myself)\nHis woooorrrrkkoouut plan (This time around I want y'all to clap like this)\nThat's right put in work\nMove your ass, go wizzerk\nEat your salad, no dessert\nGet that man you deserve (Stop!)\nIt's Kanye's workout plan (Ok bring)\nI said it's Kanye's workout plan (I know y'all ain't tired)\nIt's Kanye's workout plan (But I hope not, 'cuz on this one I need ya)\nHis woooorrrrkkoouut plan (to give me a soul clap ok? double time)\nThat's right put in work (Woo!)\nMove your ass, go wizzerk (Ow!\nEat your salad, no dessert (Ugh!)\nGet that man you deserve\nThat's right put in work (Put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (No dessert)\nGet that man you deserve (You hear, ugh)\nThat's right put in work (That's right put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (Eat your salad, no dessert)\nGet that man you deserve (Woo!)\n(Okay, okay, okay, that's, that'd be good) [Applause and cheering]\n(I appreciate your time)\nI want to see you work out for me\nWoah yeah\n", "title": "Work It Out lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Chorus]\n[Kanye (Female Voice)]\nWhy everything that's supposed to bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan I tried to stop man I tried the best I could\nBut (You make me smile)\nWhat's your addiction? Is it money? Is it girls? Is it weed?\nI've been afflicted by not one, not two, but all three\nShe's got the same thing, about me, but more, about us\nShe's coming over, so I guess, that means, I'm on drugs\nJust let me peek now, I mean damn, I'm so curious\nShe's got a lover, so the lies, and the lust, is a rush\nTime's of the essence, I need, you to be, spontaneous\nRoll up the doge, and he ain't cu-cut the quarter, then I'm co coming over\nCuz its ne-never over\n[Chorus]\n[Kanye (Female Voice)]\nWhy everything that's supposed to bad make me feel so good\nEverything they told me not to is exactly what I would\nMan I tried to stop man I tried the best I could\nBut (You make me smile)\nI see the emotion in your eyes, that you, try not to show\nWe get the closest when you high, or you drunk, or you blow\nSo I pour the potion, so we could both get high, as we could go\nThen I'll get the lotion, and do something to me, when your thighs is exposed\nThere's no turning back now, I mean I don't mean to impose\nNot now but right now, I need you to undress, and then pose\nI'm into that now, catch a vibe, when the doors, get closed\nRoll up the doge, and he ain't cu-cut the quarter, and I keep co coming over\nCuz its ne-never over\n[Chorus]\n[Female Voice (Female Voice)]\nWhy everything that's supposed to bad make me feel so good\nEverything they told me not to is exactly what I would\nMan I tried to stop man I tried the best I could\nBut... (You Make Me Smile)\n(You make me smile with my heart)\n[INSTRUMENTAL]\n[Chorus]\n[Kanye (Female Voice)]\nWhy everything that's supposed to bad make me feel so good\nEverything they told me not to is exactly what I would\nMan I tried to stop man I tried the best I could\nBut... (You make me smile, With my heart)\nI just wanted to ask you\nJust wanted to um\nLet how would I put this uhh\nLet's say all your friends\nRemember the one\nYou said if you ever she would be the one\nOk, Ok, Ok (You make me smile with my heart)\nI was thinking, hypothetically\nI mean don't take this seriously\nDon't take me: I mean just\nUhh not credibly\nI'm feeling incredibly\nI mean let's see\nJust maybe\nI mean you are in me (You make me smile with my heart)\nMaybe, Baby, Baby\nYou know I was just kidding\nUnless you gon' do it\n(You make me smile...)\n", "title": "Addiction lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Chorus - 4x]\nOh when it all, it all falls down\nI'm telling you ohh, it all falls down\n[Verse - Kanye West]\nMan I promise, she's so self conscious\nShe has no idea what she's doing in college\nThat major that she majored in don't make no money\nBut she won't drop out, her parents will look at her funny\nNow, tell me that ain't insecurrre\nThe concept of school seems so securrre\nSophmore three yearrrs aint picked a careerrr\nShe like fuck it, I'll just stay down herre and do hair\nCause that's enough money to buy her a few pairs of new Airs\nCause her baby daddy don't really care\nShe's so precious with the peer pressure\nCouldn't afford a car so she named her daughter Alexus (a Lexus)\nShe had hair so long that it looked like weave\nThen she cut it all off now she look like Eve\nAnd she be dealing with some issues that you can't believe\nSingle black female addicted to retail and well\n[Chorus - repeat 2x (w/ Kanye ad-libs)]\n[Verse - Kanye West]\nMan I promise, I'm so self conscious\nThat's why you always see me with at least one of my watches\nRollies and Pasha's done drove me crazy\nI can't even pronounce nothing, pass that versace!\nThen I spent 400 bucks on this\nJust to be like nigga you ain't up on this!\nAnd I can't even go to the grocery store\nWithout some ones thats clean and a shirt with a team\nIt seems we living the american dream\nBut the people highest up got the lowest self esteem\nThe prettiest people do the ugliest things\nFor the road to riches and diamond rings\nWe shine because they hate us, floss cause they degrade us\nWe trying to buy back our 40 acres\nAnd for that paper, look how low we a'stoop\nEven if you in a Benz, you still a nigga in a coop/coupe\n[Chorus - repeat 2x (w/ Kanye ad-libs)]\n[Verse - Kanye West]\nI say fuck the police, thats how I treat em\nWe buy our way out of jail, but we can't buy freedom\nWe'll buy a lot of clothes when we don't really need em\nThings we buy to cover up what's inside\nCause they make us hate ourself and love they wealth\nThat's why shortys hollering \"where the ballas' at?\"\nDrug dealer buy Jordans, crackhead buy crack\nAnd a white man get paid off of all of that\nBut I ain't even gon act holier than thou\nCause fuck it, I went to Jacob with 25 thou\nBefore I had a house and I'd do it again\nCause I wanna be on 106 and Park pushing a Benz\nI wanna act ballerific like it's all terrific\nI got a couple past due bills, I won't get specific\nI got a problem with spending before I get it\nWe all self conscious I'm just the first to admit it\n[Chorus - to fade (w/ Kanye ad-libs)]\n", "title": "All Falls Down lyrics"}, {"lyrics": "(background:\nThrough the fire, to the limit, to the wall\nFor just to be with you I'd gladly risk it all\nThrough the fire, through whatever come what may\nFor a chance at loving you, I'd take it all the way...\nRight down to the wire, even through the fire)\nYo G they can't stop me from rapping can they?\nCan that huh?\nI spit it through the wire man\nTo much stuff on my heart right now man\nI'll probably risk it all right now\nIt's a life or death situation man\nY'all don't really understand how I feel right now man\nIt's your boy Kayne to the....\nChi-Town what's going on man\n[Verse 1]\nI drink a boost for breakfast, an intro for dizzert\nSomebody ordered pancakes I just sip the sizzurp\nThat right there could drive a sane man bizzurp\nNot to worry the Mr. H says that the izzles back wizzerk\nHow can you console my mom or give her life support\nWhen you telling her your sons' on life support\nAnd just imagine how my girl feel\nOn the plane scared as hell that her guy look like Ed Mitill\nShe was with me before the deal she been trying to be mine\nShe a delta so she been throwing them Donahue signs\nI'm use to trying to reline\nI been trying to resign\nTrying to be a millionaire\nHow I use two lifelines\nIn the same hospital where BIG and Tupac died\nThe doctor said I had blood clots\nBut I ain't your nigga man\nStory on MTV and I ain't trying to make a band\nI swear this right here is history in the making man\nI really apologize how I sound right now man\nThis ain't fair at all man\nThey got my mouth wired shut for like I don't know the doctor said for like six weeks\nYou know we had reconstru....\nI had reconstructive surgery on my jaw\nLooked in the mirror half my jaw was missing and half my mouth\nI couldn't believe it\nBut im still here for yall right now yo\nThis is what I gotta say yo\nYeah, turn me up yeah\n[Verse 2]\nWhat if somebody from the shadow was ill got a deal on the hottest rap label around\nBut he wasn't talking bout coke and birds it was more like spoken word\nExcept he really putting it down\nAnd he explained the story about how blacks came from glory\nAnd what we need to do in the game\nGood dude, Bad night, Right place, Wrong time\nIn the blink of an eye his whole life changed\nIf you could feel how my face felt you would know how Mase felt\nThank God I ain't to cool for the safe belt\nI swear to God drive two on the sue\nI got lawyer for the case to keep my safe book safe\nMy dawgs couldn't tell if I\nI look Tom Cruise on Vanilla Sky\nAll they heard was in accident like GEICO\nThey thought I was burnt up like Pepsi did Michael\nI must gotta angel\nCause look how death missed his ass\nUnbreakable, would you thought they called me Mr. Glass\nLook back on my life like the ghost of Christmas past\nToys R Us where I used to spend that Christmas cash\nAnd I still wont grow up, I'm a grown ass kid\nSwear I should be locked up for stupid shit that I did\nBut I'm a champion, so I turned tragedy to triumph\nMake music that's fire, spit my soul through the wire\nKnow what im saying\nWhen the doctor told me I had a um.. I was goin to have a plate on my chin\nI said dawg don't you think didn't you realize I'll never make it on the plane now\nIts bad I got all this jewelry on\nCan't be serious man\n", "title": "Background) lyrics"}, {"lyrics": "(feat. Common)\n(Hook)\nMy raps is better than yours\nMy plaques is better than yours\nMy tracks is better than yours\nYou can have one but I have to charge\nWe can start with the hits on my arm I already got the bomb\nNow all I need is my first LP to go gold\nThen I will have the Kwam uh-uh uh-uh uh-uh\nI'm Kon the Louis Vuitton Don\nBought my Mom a purse now she Louis Vuitton Mom\nStill might throw on a little low arm they want me to stop go on gon\nThey don't want me to shop and me spending that hard\nOh my God is that a black car\nI turned around and replied why yes\nBut I prefer the term African American Express\n(Hook)\nLa La La La La Off MTV\nLa La La La La When you gonna go out with Me\nBrains Power and Muscle like Dame Puffy and Russell\nYour boy back on his hustle don't know you don't discuss you\nEvery rapper want to know when they can get to work\nEvery stylist want to know where they can get the shirts\nEverybody ripping my style like the shit that hurts\nBut they don't give me my credit that's the shit that hurts\nThere's something I might say There's something I might play\nA beat I might made might make they life change\nAnd save they whole deal They wrist is on chill\nThey house is on hill You could be Lauren Hill\nSee y'all write songs to keep the lights on\nI'ma go in Def Jam and turn the brights on\nMan I'm just sayin\nWhen I wanted to rap y'all thought I was just playin\nNow you just prayin\n(Hook)\n[Common]\nYou was a vic in high school now you a thug\nBetter step in the name of love\nBefore you giving pain a hug\nNeeding dope is like pain to drugs\nOr aiming slugs til the game unplugged\nLike a scoreboard with vice and warlords\nHot merchandise prices they want more for it\nYou was pink as ice single need to think it twice\nOver the bitch and you came out like freaks in the night\nFreed your mind at a cheaper price on the street trying to seek advice\nI'm on point like I speak to dice\nTook the underground at a steeper heights\nMay real niggaz see the light got fat girls eating right\nHa ha we in this bitch\nIt's Common and Kanye y'all niggaz know what time it is\nChi-Town motherfuckers DJ Ferris Heavy Hitters What Up?\nMike Love What Up? DJ Enuff\nForeal(Pharrell) That's my favorite producer by the way\nthat's why I had to rap on this Cuz\nHis tracks is Better Than Yours\nMy tracks is Better Than Yours\nJust Blaze tracks is Better Than Yours\nYou can have one but we all gonna\ncharrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrgeaaawwwww\nPlain Pat What Up? Big John What Up? John Mnop(Monopoly) What Up?\nDon. C What Up? J.B. What Up? GLC What Up? Bang What Up? Yeah\nReally Doe\nWhat Up?\nArrowstar What Up? Yeah!\nOh did I mention the new head of my management Benny Madina\nYo G, Hop we taxin these niggaz right now Plain Pat What Up?\nThat's all\n", "title": "Better Than Yours lyrics"}, {"album": "Album: I'm Good", "lyrics": "(Ad libs)\nYo Hip-Hop Is niggaz still talkin bout I can't rap Come On Now\nLook for me Young K\nTook Tupac beat and got paid\nMy favorite rapper is Makaveli, Nas and Jay-Z\nEminem, Mase, Biggie Smalls and me\nNow if you was my girlfriend you don't need no guyfriend\nHe could get his head bust nigga ain't my friend\nWhy the hell you lying who the hell you trying\nWho the hell you know that threw away his throwbacks\nWhen they suggested they was made by Majestic\nMy answers cost three-hundred-fifty ya naw mean\nDoesn't even have got her number we ain't on the same team\nYou got the hat the jacket shoelaces to match\nI got the gat ratching new cases to catch\nI got my business manager erasing my debt\nI mean my credit was so pathetic I couldn't get a debit\nI fill out for a car but shit they always debt it\nMy girl come over try to help me shine\nHow you gonna help me get a car your credit worser than mine\nBut everytime I get a check you be first up in line\nTold you bout gold-diggin bitch it's worser than lying\nYou better grow up before I blow up\nHave weed rolled up when I show up\nMatter fact we broke as fuck\nAin't nothing left to do except get tore up from the floor up\nShit that's how I knew you was my girlfriend\nSo I promise to never pick up smutts\nIn my Cadillac pick-up truck\nThey need to get they sit-ups up\nThey always be colder than you\nA little richer a little thicker a litter older than you\nProbably a little smarter so they can drop me some jewels\nThat I could drop back to you to get your ass back in college\nSo you can be where they at two years from now\nBut for now bartender two beers for now\nThe second one is for my girlfriend\n[Jay-Z] All I need in this life of sin is me and my girlfriend me and my girlfriend\n[B.K.] Down to ride til the very end is me and my boyfriend me and my boyfriend\nI'm talkin bout when we was in Nissan's no Benz or such\nWe wasn't from Switzerland but we'll still go Dutch\nGreater man could prob picture like there go us\nNo styles just good times like they're so nuts\nWe always thought if we had dough we could do so much\nLike you ain't got to save the roach we can finish the Dutch\nLike we ain't have to go coach told you i'll be paid soon\nWe ain't got to sit in this emergency aisle just to get leg room\nWe ain't got to go back to my room there's only one bedroom\nThat I call my lair\nWe was V.I.P. Very Imaginary Playaz\nBut you was my girlfriend yea yea yea you was my girlfriend\n[Jay-Z] Holla, All I need in this world of sin is me and my girlfriend me and my girlfriend\n[B.K.] Down to ride til the very end is me and my boyfriend me and my boyfriend\nThat's Right (Kanye)\n[Jay-Z] All I need in this world of sin is me and my girlfriend me and my girlfriend\nLook for me\n[B.K.] Down to ride til the very end is me and my boyfriend me and my boyfriend\n[Jay-Z] Yep!\n", "title": "Bonnie Clyde Freestyle lyrics"}, {"album": "Album: College Dropout", "lyrics": "This song lyrics are not displayed due to the claim of copyright holder", "title": "Breathe In Breathe Out lyrics"}, {"lyrics": "(feat. KRS-One, Nas, Rakim)\n[Hook: Samples]\n[Sample]\n\"And now for my next number..\"\n\"I'd like to return to the..\"\n[Nas]\n\"Classic\"\n[Kanye West]\n\"uh, uh, - timeless..\"\n[Kool G Rap]\n\"Nike's straight classic\"\n[Nas]\n\"Classic\"\n[Kool G Rap]\n\"Nike's..Nike's..Nike's.. straight classic\"\n[Kanye West]\n\"Timeless..\"\n[Sample]\n\"I'd like to return to the classic\"\n[Rakim]\n\"Kanye West\"\n[Verse One: Kanye West]\nCan't buy this, super fly in this\nLike shininess, you're highness\nIt's performin', look how long the line is\nIt's what happens when you make shit that's timeless\nIt's what happens, each rapper's the pioneers\nWhat would it take to be a legend like Nas is?\nThat's so novice, I'm so polished\nI got a right to be a 'lil snobbish\nI did a 'lil bit of College\nSemesters it took two like Rob Base\nTo let me figure out this was in my place\nThe beat's slow, 'til you listen to my pace\n'Cause I be killin' shit, but that's evident\nAnd y'all feelin' it, but I expected\nIf it's classic - it's gon' last forever than\nI'm everywhere you never been, and better than I ever been\n[Hook: Samples]\n[Nas]\n\"Classic\"\n[Kool G Rap]\n\"Nike's straight classic\"\n[Nas]\n\"I'm better than I've ever been\"\n[Kanye West]\n\"Timeless..\"\n[Kanye West]\n\"I'm everywhere you never been, and better than I ever been\"\n[Nas]\n\"Classic\"\n[Kool G Rap]\n\"Nike's straight..straight classic..\"\n[Nas]\n\"I'm better than I've ever been\"\n[Kanye West]\n\"Timeless..\"\n[Nas Samples - One Love & It Ain't Hard To Tell]\n\"Hold the fort down, represent to the fullest\"\n\"Nas'll rock well\"\n[Verse Two: Nas]\nPerseverance..\nSee the fake hustler rapper\nTo them, it hurts to hear this\nOh you went platinum? Yeah, that's nice\nNow let me see you do the same thing twice\nThree times, four times, then a couple of mo' times\nPlease, you're Amateur Night, it's Showtime\nIt's one life to live, so live it the best you can\nThe world could use one less man\nNot enough air, not enough car factories\nTo manufacture new vehicles, sedans and vans\nWhen they do make the whip you like\nYour chips ain't right\nBy the time you could afford it\nThe car ain't imported\nIn the streets I'm in, it's just iron\nCops keep firin', in my environment\nLeavin' you slumped, then they drive home\nFar from the hood, brothers they eager to jump on\nI like to be the wall that they toast up on\nI like to see them fall, guilty for doin' wrong\nI'm classic like the Air One's, the hustler shoe\nThat's what I'm accustomed to.. yea\n[Hook: Samples]\n[KRS-One Sample]\n\"Of course - we have Blastmaster KRS-One\"\n[Verse Three: KRS-One]\nHow many of y'all got - 'Criminal Minded'?\nYou, you, you, y'all don't be blinded\nMe - I got no jewels on my neck\nWhy? - I don't need 'em, I got your respect\nKRS-One, 20 years I rock\nI do it for JMJ and Scott La Rock\nThis hip-hop and we is a nation\nDon't you wanna hear more KRS-One on your radio station?\nInstead of broadcasting how we smoke them trees\nOn the radio we need to hear more local emcees\nWhere you at?, c'mon where you at?\nThis is the difference between emceein' and rap\nRappers spit rhymes that're mostly illegal\nEmcees spit rhymes to uplift their people\nPeace, Love, Unity, havin' fun\nThese are the lyrics of KRS-One..\n[Hook: Samples]\n[Rakim Sample]\n\"I'm Rakim, the fiend of a microphone..\"\n[Verse Four: Rakim]\nUh, yea, is y'all ready for 20-07?\nIt's now another drought\nEverybody's a killer, wow we buggin' out\nSince '86 showin' the crowd what I'm about\nAnd they still wanna know when the album comin' out\nAskin' teenagers, OG's and nasty kids\nWhat their definition of Classic is?\nTimeless, so age don't count in the booth\nWhen your flow stay submerge in the fountain of youth\nAin't no doubtin' the truth, I'm off the meters\nEverybody cosignin', even the non-believers\nSince I came in the door, and became one of y'all leaders\nIn a fresh pair Air Force sneakers\nUptowns, we call 'em uppies, when they're on divas\nProbably worn when KRS-One raw teachings\nNas - Made You Look, before the heaters\nI bet Kan' had 'em on when he walked with Jesus\n[Hook: Samples]\n[All]\n\"These are classics\"\n[Kool G Rap]\n\"Nikes straight classic, classic..\"\n[Nas]\n\"I'm better than I've ever been\"\n[Kanye West]\n\"Timeless..\"\n[Kanye West]\n\"I'm everywhere you never been, and better than I ever been\"\n[Nas]\n\"Classic\"\n[Kool G Rap]\n\"Nike's straight..straight classic..\"\n[Nas]\n\"I'm better than I've ever been\"\n[Kanye West]\n\"Timeless..\"\n[Kanye West]\n\"I'm everywhere you never been, and better than I ever been\"\n[Nas]\n\"Classic\"\n[Kool G Rap]\n\"Lives straight..straight classic..\"\n[Rakim]\n\"Air Force One's, keep it poppin', classic..\"\n", "title": "Classics (Nike Air Force Remix) lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Intro]\nDiamonds are forever\nThey won't leave in the night\nHave no fear that they might\nDesert me\n[Chorus]\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme.\nForever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever?......\nClose your eyes and imagine, feel the magic\nVegas on acid,\nSeen through Yves St. Laurent glasses\nAnd I've realized that I've arrived, cuz\nIt take more than a magazine to kill my Vibe does\nhe write his own rhymes, so sort of\nI think 'em\nThat mean I forgot better shit than u ever thought up\nDamn, is he really that caught up?\nI ask if you talkin' bout classics, do my name get brought up?\nI remember I couldn't afford a Ford Escort or even a four-track recorder\nso its only right that I let the top drop on a drop-top Porsche\n- its for yourself that's important\nIf a stripper named Porscha and u get tips from many men\nThen your fat friend her nickname is Minivan\nExcuse me,\nThat's just the Henny, man, I smoke, I drink, I'm supposed to stop I can't because\n[Chorus]\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme.\nForever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever?......\nI was sick about awards\nCouldn't nobody cure me\nOnly playa that got robbed but kept all his jewelry\nAlicia Keys tried to talk some sense to them\n30 minutes later seems there's no convincing them\nWhat more can you ask for?\nThe international awards? nah\nWho complains about when he is old?\nAnd throw a tantrum like he is 3 years old\nYou gotta love it though somebody still speaks from his soul\nAnd wouldn't change by the change, or the game, or the fame,\nWhen he came, in the game, he made his own name\nNow all I need is y'all to pronounce my name\nIts Kanye - But some of my plaques - they still say Kayne\nGot family in the D, Kin-folk from Motown\nBack in the Chi - them folks ain't from Motown\nLife movin' too fast I need to slow down\nGirl ain't give me no ass, ya need to go down\nDiamonds are forever (forever, forever)\nMy father Ben said I need Jesus\nSo he took me to church and let the water wash over my ceaser\nDiamonds are forever (forever, forever)\nThe preacher said we need leaders\nRight then my body got still like a paraplegic\nYou know who you can call you gotta best believe it\nThe Roc stand tall and you would never believe it\nTake your diamonds and throw 'em up like you bulimic\nYea the beat cold but the flow is anemic\nAfter debris settles and the dust get swept off\nBig K pick up where young Hov left off\nRight when magazines wrote Kanye West off\nI dropped my new shit sound like the best of\nA&R's lookin' like \"pssh we messed up\"\nGrammy night, damn right, we got dressed up\nBottle after bottle till we got messed up\nIn the studio, where really though, yea he next up\nPeople askin' me if I'm gon' give my chain back\nThat'll be the same day I give the game back\nYou know the next question dog \"Yo, where Dame at?\"\nThis track the Indian dance to bring our reign back\n\"What's up with you and Jay, man, are y'all ok man?\"\nThey pray for the death of our dynasty like Amen\nR-r-r-right here stands a-man\nWith the power to make a diamond with his bare hands...\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme.\nForever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever?......\nDiamonds are forever (forever, forever)\nDiamonds are forever (forever, forever, forever)\n", "title": "Diamonds lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Intro]\nDiamonds are forever\nthey're all I need to please me\nthey can't stimulate or tease me\nthey won't leave in the night\nhave no fear that they might\ndesert me\n[Hook]\n\"Diamonds are forever forever forever\"\nthrow ya diamonds in the sky\nif you feel the vibe\n\"Diamonds are forever forever forever\"\nthe ROC is still alive\neverytime I rhyme\n\"Forever and ever!\"\nfor ever ever? for ever ever? ever ever?\never ever? ever ever? ever ever? ever ever?\n[Verse 1]\nGood Morning, this ain't Vietnam still\npeople lose hands, legs, arms for real\nlittle was known of Sierra Leone\nand how it connect to the diamonds we own\nwhen I speak of Diamonds in this song\nI ain't talkin bout the ones that be glown\nI'm talkin bout Rocafella, my home, my chain\nthese ain't conflict diamonds,is they Jacob? don't lie to me mayne\nsee, a part of me sayin' keep shinin',\nhow? when I know of the blood diamonds\nthough it's thousands of miles away\nSierra Leone connect to what we go through today\nover here, its a drug trade, we die from drugs\nover there, they die from what we buy from drugs\nthe diamonds, the chains, the bracelets, the charmses\nI thought my Jesus Piece was so harmless\n'til I seen a picture of a shorty armless\nand here's the conflict\nit's in a black person's soul to rock that gold\nspend ya whole life tryna get that ice\non a polar rugby it look so nice\nhow could somethin' so wrong make me feel so right, right?\n'fore I beat myself up like Ike\nyou could still throw ya Rocafella diamond tonight, 'cause\n[Hook]\n[Verse 2]\n[Kanye From Original Song]\nPeople askin' me is I'm gon' give my chain back (uh)\nthat'll be the same day I give the game back (uh)\nyou know the next question dog 'yo, where Dame at?'(uh)\nthis track the Indian dance to bring our reign back (whoo!)\n'wassup wit you a Jay man, are ya'll okay man?'\n[Jay-Z]\nYep!\nI got it from her 'ye damn!\nthe chain remians, the gang is in tact\nthe name is mine, I'll take blame for that\nthe pressure's on, but guess who ain't gon' crack? [laughs]\npart of me I had to laugh at that\nhow could you falter when you're the rock of gibralter\nI had to get of the boat so I could walk on water\nthis ain't no tour order, this is nothin to me\ndifficult takes a day, impossible takes a week\nI do this in my sleep,\nI sell Kilos of coke, (so?) I'm guessin' I can sell CD's\nI'm not a buisness man I'm a buisness, man\nlet me handle my buisness, damn!\nKanyeez you got me, Freeway and Foxy\nYG', Teairra Mari, Petey watch me\nBleek could be one hit away his whole career\nas long as I'm alive, he's a millionaire\nand even if I die, he's in my will somewhere\nso he can just kick back and chill somewhere, oh yeah\nhe don't even have to write rhymes\nThe Dynasty like my money last three lifetimes\nShirley Bassey was in the rear sayin exactly\nwhat I was sayin practically me whole carreer\nthe diamond is forever, I been mindin' this forever\nNow the Louis Vuitton Don's timin' couldn't be better\npeople lined up to see the Titanic sinkin'\ninstead we rose from the ash like a phoenix\nif you watin for the end, the dynasty signed\nand what seemed like forever is a mighty long time\nI'm young bitches [laughs]\nGoodnight!\n", "title": "Diamonds (Feat. Jay Z) (Remix) (From Sierra Leone) lyrics"}, {"album": "Album: Late Registration", "lyrics": "\"Diamonds are forever\"\n\"They won't leave in the night, have no fear that they might\"\n[Chorus]\n\"Diamonds are forever, forever, forever\"\nThrow your diamonds in the sky if you feel the vibe\n\"Diamonds are forever, forever, forever\"\nThe Roc is still alive everytime I rhyme\n\"Forever...\"\nForever eva, forever eva, eva eva, eva eva, eva eva, eva eva, eva eva\n[Verse 1]\nClose your eyes and imagine, feel the magic\nVegas on acid, seen through East St. Laurent glasses\nAnd I realise that I've arrived\n'Cause it take more than a magazine to kill my vibe, does\nHe write his own rhymes, sort of, I think 'em\nThat mean I forgat better shit than you ever thought of\nDamn, is he really that caught up\nI ask, if you talk about clasics do my name get brought up?\nI remember I couldn't afford a Ford Escort\nOr even a four-track recorder\nSo its only right that I let the top drop on a drop top Porche\nIt's spoilin' yourself thats important\nIf you striper name Porcha and you get tips from many men\nThen your fat friend, her nickname is mini-van\nExcuse me, that's just the Henni, man\nI smoke, I drink, I'm supposed to stop, I can't, because\n[Chorus]\n[Verse 2]\nI was sick about awards, couldn't nobody cure me\nOnly player that got robbed and kept all his jewlery\nAlicia Keys tried talk some sense in him\nThrity minutes later saw his note convincin' him\nWhat mo' could you ask fo'\nThe international asshole\nWho complained about what he is owed\nAnd throw a tantrem like he is three years old\nYou gotta love it though\nSomebody still speak from his soul\nAnd wouldn't change by the change or the game or the fame\nWhen he came in the game he made his own lane\nNow all I need is ya'll to pronounce my name\nIs Kanye but some of my plaques still say Kayne\nGot family in the ?D-King?, folks from Mo Town\nBack in Chi, them folks ain't from ?Mo Town?\nLife movin' too fast, I need to slow down\nGirl ain't give me no ass, she need to go down\nMy father Ben said I need Jesus, so he took me to church\nAnd let the water let the water run over my ?sleezer?\nThe preacher said we need leaders\nRight then my body got steel, like a paraplegic\nYou know who you call, you got a message to leave it\nThe Roc stand tall, and you would never believe it\nTake your diamonds and throw 'em up like you bulimic\nYa, the beat cold but the flow is anemic\nAfter debris settles and the dust gets swept off\nBig K kick it where young Hov left off\nRight when magazines wrote Kanye West off\nI drop my new shit, it sound like the best of\nA&Rs lookin like phhttt we messed up\nGrammy night, damn right, we got dressed up\nBottle after bottle 'till we got messed up\nIn the studio, we really though, ya he next up\nPeople askin' me is I gon'give my chain back\nThat'll be the same day I give the game back\nYou know the next question all yo, where Dame at?\nHe's tracked the Indian dance to bring our rain back\nWhat's up with you and Jay, man? Are ya'll okay, man?\nThey pray for the death of our dynasty like Amen\nR-r-r-r-right here stand a man\nWith the power to make a diamond with his bare hands\n[Chorus]\n\"Diamonds are forever, forever, forever\"\n\"Diamonds are forever, forever, forever\"\n\"Forever...\"\n", "title": "Diamonds From Sierra Leone lyrics"}, {"lyrics": "[Chorus 1]\nThey gossipin, it runs the city, they don't know who watchin them\nWhen they comin to get me, so I hit the block and bend\nDo about 60, and I put my glocks to them, like blaow blaow blaow\n[Verse 1]\nIm fittin to get on this TV and put shit down\nI aint finna let these lights skinned niggaz come back in style\nIm finna turn to this class clown, should be crazy deep\nThey told my momma I was bipolar had A.D.D.\nI told em, w-what I wanna do, I wanna be a baller\nThe dream spoilers are for ya\nHatin on you to they mans on the corners\nOld folks said he'd never make it off the corner\nThey are the virus that corrupts the soul\nThey are the cubic zirconia inside the 10 karat gold\nThat get green on ya, when you get green on em\nYou gotta wash ya hands of em, get clean on em\nSomebody told success is the best revenge\nSo they gon be fucked up when you do ya thing on em\nNow hold ya plaques high, like who woulda thought\nAnd tell em, eh-hem, thank you for your no support\n[Chorus 2]\nThey are the dreamkillers, they the dreamkillers\nWho know a dream, they are the dream (killer Norman Bates)\nThey the dreamkillers, they the dreamkillers, dream\nThey are the dream (killer Norman Bates)\n[Verse 2]\nNow how you gonna talk about the way I spend my money\nEverybody say it with me now, it's my money\nAnd they know they hatin, but what they don't know is\nThey are my motivation, they are my inspiration\nCuz we the leaders, and they the followers\nAnd we the nut busters, and they the swallowers\nThey are the rumors, they are the lies\nWe are the shit dog, and they the flies\nHow you gon tell me how to live my life\nAnd you can't even get your own shit tight, right\nThey are the misery that loves company\nCuz that comfortable corporate job can't comfort me\nTold em I finished school, and I started my own business\nThey said ?Oh you graduated?? No I decided I was finished\nChasin yall dreams and what you got planned\nNow I spit it so hot you got tanned\nAnd they hate on your relationship, then break your marriage up\nCan't kill ya dreams so they assassinate your character\nDo anything to downplay ya or embarrass ya\nCome around wit ya but they aint down wit ya\nThey the dreamkillers\n[Verse 3]\nAnd I'm through spittin these rappers my most heartfelt flow\nThey be like ?That's cool, you got some beats for me tho?\nOh I get it, you wanna be Snoop and Dr. Dre\nBut don't nobody give a FUCK what you got to say\nAnyway what you finna rap about?\nYou never sold crack out ya house or put a gat to a mouth\nOr put ya fist to ya spouse, so how you gon move the crowd?\nI bet a thousand that you get booed out\nI even heard that they even takin wages in jail\nThey bet ten boxes of cigarettes that I'm finna fail\nSecond you talk about me, they be like ?Peace?\nThis nigga came from the Chi, moved to the east\nYou gotta kill at least one person at least\nOr we'll evict you from the rap game, cancel your lease\nHow you go to New York, what you aint never took a tour there?\nWhat you aint know you gotta be rich just to be poor there?\nThe dreamkillers\n[Chorus 1]\n[Chorus 1]\n[Chorus 1]\n", "title": "Dreamkillers lyrics"}, {"album": "Album: Late Registration", "lyrics": "(feat. GLC, Paul Wall, T.I.)\n[Kanye West]\nMy homie Mali used to stay, 79th and May\nOne of my best friends from back in the day\nDown the street from Calumet, a school full of stones\nHe nicknamed me K-Rock so they'll leave me alone\nBulls jacket with his hat broke way off\nAnd walked around the mall with his radio face off\nPlus he had the spinner from his Daytons in his hand, keys in his hand\nReason again to let you know he's the man\nBack when we rocked Alieses, he had dreams of Caprices\nDrove by the teachers, even more by polices\nHow he get the cash the day his father passed away\nLeft him with a lil somethin, 16 he was stuntin'\n\"Al B. Sure\" nigga with the hair all wavy\nHit Lakeshore, girls go all crazy\nHit the freeway, go at least bout 80\nBoned so much that summer, even had him a baby\nSee back back then then if you had a car\nYou was the Chi-Town version of Baby\nAnd I was just a virgin, a baby\nOne of the reasons I looked up to him crazy\nI used to love play my demo tape when the system yanked\nFelt like I was almost signed when the shit got cranked\nWe'll take a Saturday and just circle the mall\nThey had they Lincoln's and Aurora's, we was hurtin 'em all\nWith the girls alot of flirtin' involved but dog..\nFuck all that flirtin', I'm tryin' to get in some drawers, so\nPut me on with these hoes homie\nHe told me, \"Don't rush to get grown, drive slow homie\"\n[Chorus: Kanye West]\nDrive slow, homie\n(Drive slow)\nYou never know, homie\nAbout these hoes homie\nYou need to pump your brakes and drive slow, homie\n[Verse 2: Paul Wall]\nWhat it do?\nI'm posted up in the parking lot, my trunk wavin\nThe candy gloss is immaculate, its simply amazing\nThem elbows pokin wide on that candy 'Lac\nTrunk open, screens on, neon's lit with 5th relaxed\nI'm on a mission for dime pieces and sexy ladies\nAllow me to introduce you to my CL Mercedes\nIt's a star-studded event when I valet park\nOpen up my mouth and sunlight illuminates the dark\nYou see them 4's crawlin, you see them screens fallin\nThe disco ball in my mouth insinuates I'm ballin'\nI'm leanin on the switch, sittin crooked in my slab\nBut I could still catches boppers if I drove a cab\nA young Houston hard-hitter all about the scrilla\nRidin' somethin' candy-coated crawlin' like a caterpillar\nI'm tippin' on them 4's, I'm jammin' on that Screw\nI'm lookin' for them hoes baby, what it do\n[Chorus: Kanye West (GLC)]\nDrive slow, homie\n(Turn your hazard lights on when you see them hoes)\nDrive slow, homie\n(If you ridin' around the city with nowhere to go)\nDrive slow, homie\n(Live today, cause tomorrow man, you never know)\nYou never know, homie\nMight meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\n[Kanye West]\nMy car's like the movie, my car's like the crib\nI got mo TV's in here than where I live\n[GLC]\nAnd that don't make no sense, but baby I'm the shit\nAnd everything I flip, you know it's somethin serious\nI got the custom grill, I got the Bravis rims\nI got the baller genetics baby this evidence\nYou see a player flickin', and how you ain't convinced\nThat you should go on and kiss it, just a lil bit (just a lil bit)\nI wearin my custom kicks, I got my Jesus chain\nMy canary's is gleamin', through my angel wings\nThey see me, hoes actin' like they seen a king\nWith that mean lean, smokin on that finest Cali green\nMy woodgrain oak, I'm ridin on Vogues\nMy cylinder quiet, like tip-toes\nI sold O's, and this I know\nWhen you see them hoes, lil homie drive slow [echoes]\n[Tony Williams harmony ad-libs]\n[T.I.]\nLookin' at the life through my rearview, all the problems I had\nCould be seen alot clearer after time had passed\nKnown for livin' so fast, they wonder how he don't crash\nWith 220 on the dash, he constantly mashin'\n(Why don't he slow down?) They be constantly askin'\nBut me in the fast lane is like metal and magnets\nNow I ain't tryna say that it's the way of the masses\nBut it, so hard to change, I love this shit with a passion\nSince me and Sigel cuttin' classes, showin' our ass\nShootin' out in broad day in the middle of traffic\nI remember sellin' crack faster than I could bag it\nA shame I ain't playin' with you shorty, I ain't braggin'\nMe and Cap got life, some other folk got blasted\nHad a partner OD'd and after this all happened\nIt's like the only thing that kept a pimp from cryin' and laughin'\nAnd the Lord smiled on me at the end of the madness\nI never thought that I'd make it this far rappin'\nFor introducin' the youth to what we now call trappin'\nConsidered now a classic, who'da imagined?\nMe in Milano, gettin' models in next year's fashions\nSo nowadays, they can call me old fashioned\nBut it's way too much cash to see blue lights flashin'\nSo I guess the moral of this here class is\nLife about who make it now not about who make it the fastest\nDrive slow homie\nDri, uh dri slowly\n", "title": "Drive Slow (T.i. Remix) lyrics"}, {"lyrics": "(feat. Consequence)\nYou got to\n[Chorus]\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nAll day long man, we back in town\n[Consequence]\nHomie check it out I got her mesmerized\nSo won't you hook a chew scorns, she tellin you buy\nStreet poetry is how ya boy get paid\nAnd I wear no Escalade, metallic, black or beige\nYo when I walk up in the club you know I do not pay\nAiiyo my man Kanyeezy he got something to say\n[Kanye West]\nAiiyo my name is Kanyeezy from the Roc-A fam\nAnd where the glocks don't jam, so where we pop them scrams\nSee I showed you on the champions how we get down\nSo don't twist ya lips, I'm like Bobby Brown\nYou got B2K on all your bedroom wall\nBut if you be with Kan, gonna work ya walls\nStraight from the South side of dem Chi-town streets\nThe top three in the game, with these here beats\n[Consequence]\nAnd if you talk about him, aiiyo I take you out\nEither with the nine or the tech's in his mouth\nAnd let that dime gettin friendly than the orgie's at eight\nBut y'all niggaz don't shine so you couldn't relate\n[Chorus]\nRelax yourself or we'll whack ya down (You couldn't relate)\nRelax yourself or we'll whack ya down (Yo Quence, you couldn't relate)\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\n[Consequence]\nQuence without the game, now he's back to ball\nDrive you insane, drop a tat at the mall\nYou starin at my Rolls' cold way to long\nBut I ain't scared of robbers, why I wear tephlon\nI took her on the ave and she expect me to trip\nBut I made up with no style while I bought me some kicks\nSo if you want the drama holler at ya boy\n[Kanye West]\nOriginal rude boy like Pastor Troy\nThe G-500 is my favorite toy\n'Cause it don't look like a thug or a hood\nBut he keep dem gorilla's so we still be good\nBy the way my name is K, don't forget the A\nand the N-Y-E, out N.Y.C\nI'ma still rep the gold, no matter where I go\nEverybody say I'm hot, I'm sayin I'm cold\nHate when niggaz leave the city and switch up they reps\nOn the real homie, I don't get down like that\nI'ma milk the game, 'til we all can eat\n[Consequence]\nNow the Chocolate Factory is what I bump in my jeep\nSo roll me up a L, but don't lace it with leak\n'Cause that shit'll have me zonin for a couple of weeks\n[Kanye West]\nNow your momma told you let the Cleveland show\n'Cause that's the best way to get a nigga with dough\nThey're fakin pregnancies and Cartier tournier\nBut she ain't know I'm cheaper than IKEA furniture\n[Consequence]\nKanye, White, Malik, Little and D\nMenace, Skates to Lou and 'em Puffs from L.B\nThey know the Consequence be wearin gold and ice\n'Cause I got out the projects, where it's flooded with mice\nEy shorty let me tell you 'bout the rules of my Nikes\nIt seems they always keep on movin, I don't hear nuthin twice\n[Chorus]\nSo relax yourself or we'll whack ya down (Don't hear nuthin twice)\nRelax yourself or we'll whack ya down (Don't hear nuthin twice)\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down (Calm down)\nRelax yourself or we'll whack ya down (Yeah!)\nRelax yourself or we'll whack ya down (Yeah!)\nRelax yourself or we'll whack ya down (It's the R.O.C.!)\nRelax yourself or we'll whack ya down (Uhh)\nRelax yourself or we'll whack ya down (Yeah)\nRelax yourself or we'll whack ya down (Uh-huh, yeah)\nAll day long man, we back in town\n[Repeat 'til end]\nRelax yaself or we'll whack ya down\n", "title": "Electric Relaxation lyrics"}, {"album": "Album: Freshman Adjustment", "lyrics": "You got to\n[Chorus]\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nAll day long man, we back in town\n[Consequence]\nHomie check it out I got her mesmerized\nSo won't you hook a chew scorns, she tellin you buy\nStreet poetry is how ya boy get paid\nAnd I wear no Escalade, metallic, black or beige\nYo when I walk up in the club you know I do not pay\nAiiyo my man Kanyeezy he got something to say\n[Kanye West]\nAiiyo my name is Kanyeezy from the Roc-A fam\nAnd where the glocks don't jam, so where we pop them scrams\nSee I showed you on the champions how we get down\nSo don't twist ya lips, I'm like Bobby Brown\nYou got B2K on all your bedroom wall\nBut if you be with Kan, gonna work ya walls\nStraight from the South side of dem Chi-town streets\nThe top three in the game, with these here beats\n[Consequence]\nAnd if you talk about him, aiiyo I take you out\nEither with the nine or the tech's in his mouth\nAnd let that dime gettin friendly than the orgie's at eight\nBut y'all niggaz don't shine so you couldn't relate\n[Chorus]\nRelax yourself or we'll whack ya down (You couldn't relate)\nRelax yourself or we'll whack ya down (Yo Quence, you couldn't relate)\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\n[Consequence]\nQuence without the game, now he's back to ball\nDrive you insane, drop a tat at the mall\nYou starin at my Rolls' cold way to long\nBut I ain't scared of robbers, why I wear tephlon\nI took her on the ave and she expect me to trip\nBut I made up with no style while I bought me some kicks\nSo if you want the drama holler at ya boy\n[Kanye West]\nOriginal rude boy like Pastor Troy\nThe G-500 is my favorite toy\n'Cause it don't look like a thug or a hood\nBut he keep dem gorilla's so we still be good\nBy the way my name is K, don't forget the A\nand the N-Y-E, out N.Y.C\nI'ma still rep the gold, no matter where I go\nEverybody say I'm hot, I'm sayin I'm cold\nHate when niggaz leave the city and switch up they reps\nOn the real homie, I don't get down like that\nI'ma milk the game, 'til we all can eat\n[Consequence]\nNow the Chocolate Factory is what I bump in my jeep\nSo roll me up a L, but don't lace it with leak\n'Cause that shit'll have me zonin for a couple of weeks\n[Kanye West]\nNow your momma told you let the Cleveland show\n'Cause that's the best way to get a nigga with dough\nThey're fakin pregnancies and Cartier tournier\nBut she ain't know I'm cheaper than IKEA furniture\n[Consequence]\nKanye, White, Malik, Little and D\nMenace, Skates to Lou and 'em Puffs from L.B\nThey know the Consequence be wearin gold and ice\n'Cause I got out the projects, where it's flooded with mice\nEy shorty let me tell you 'bout the rules of my Nikes\nIt seems they always keep on movin, I don't hear nuthin twice\n[Chorus]\nSo relax yourself or we'll whack ya down (Don't hear nuthin twice)\nRelax yourself or we'll whack ya down (Don't hear nuthin twice)\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down\nRelax yourself or we'll whack ya down (Calm down)\nRelax yourself or we'll whack ya down (Yeah!)\nRelax yourself or we'll whack ya down (Yeah!)\nRelax yourself or we'll whack ya down (It's the R.O.C.!)\nRelax yourself or we'll whack ya down (Uhh)\nRelax yourself or we'll whack ya down (Yeah)\nRelax yourself or we'll whack ya down (Uh-huh, yeah)\nAll day long man, we back in town\n[Repeat 'til end]\nRelax yaself or we'll whack ya down\n", "title": "Electric Relaxation 2003 (Featuring Consequence) lyrics"}, {"lyrics": "(feat. Jay-Z)\nWHOO!\n[Hook]\nMemph' Bleek always smokin that la-la-la (HOO)\nBeanie Sigel always smokin that la-la-la (HOO)\nKanye track smoke like la-la-la (HOO)\nIt's the R.O.C. mami, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n[Jay-Z]\nI know my English ain't as modest as you like\nBut come, get some, you little bums\nI take the cake from under the baker's thumbs\nI bake the cake, get two of them for one\nThen I move the weight like I'm Oprah's son\nUh, I'll show you how to do this son\nYoung don't mess with chicks in Burberry paddings\nFake Manolo boots straight from Steve Madden (u-uh)\nHe padded hisself the rap J.F.K., you wanna pass for my Jaqueline Onassis\nThen, hop ya ass out that S-class\nLay back in that Maybach, roll the best grass, I ask\nHave you in your long-legged life\never seen a watch surrounded by this much pink ice?\nLook but don't touch, motherfucker think twice\n'Cause the gat that I clutch got a little red light\nNeed a light?\n[Hook]\nTo smoke that la-la-la\nBeanie Sigel always smoking that la-la-la\nMemph' Bleek always smoking that la-la-la\nIt's the R.O.C. mami, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n[Jay-Z]\nWe got brothers full of Arm'i, mami's in Manolo\nBags by Chanel, all Louis Vuitton logos\nAll attracted to Hov' because they know dough\nWhen they see him, whips be European\nIf you're a ten, chances you're with him\nIf you're a five, you know you ridin' with them\nSick with the pen nigga, no physician in the world could fix him\nNo prescription, you could prescribe to subside, his affliction\nHe's not a sane man, he's more like reign man - twitchin'\nYou can't rain dance on his picnic\nNo Haitian voodoo, no headless chickens can dead his sickness\nNo Ouija board, you can't see me dog, nigga you CB-4\nThis ain't Chris Rock bitch, it's the R.O.C. bitch\nAnd I'm the franchise like a Houston Rocket, Yao Ming!\n[Hook]\nStill smokin that la-la-la\nMemph' Bleek still smokin that la-la-la\nBeanie Sigel, Desert Eagle, the four-ty five\nIt's the R.O.C. baby, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n[Verse Three: Kanye West]\nShe playin she hate when I'm name droppin\nSo when I talk rap, she gon' change topics\nBut I got a plan B that's planned out, for when things don't pan out\nHov' tellin ya mind brother, I'ma play shy brother\nSo you take the Destiny Child girl in the Coupe?\nThen I'ma try bag the ones that got kicked out the group\nI figured that'll be simple, I'll just help 'em with their demo\nHelp 'em to the limo, play the upboard instrumentals\nAnd she - grabbed my tattoo, peeped my credentials\nAnd she - grabbed my pants, felt the potential\nAnd I - rubbed 'bout every essential\nThat have fun breakin her fundamentals\nExcuse me miss, the artist of the new millenium\nHas finally stopped drivin that blue Millenium\nAnd got a good of trenny and filled it with plenty of Henney\nand Remi and weed, 'til she higher than Hilliam\n[Hook]\nIf she pass me, smoke that la-la-la\nMemphis Bleek always smokin that la-la-la\nBeanie Sigel, Desert Eagle, the four-ty five\nIt's the R.O.C. bitch, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nWHOA, skip all the singin' let's get right tonight, mami\n", "title": "Excuse Me Miss Again (Remix) lyrics"}, {"lyrics": "WHOO!\n[Hook]\nMemph' Bleek always smokin that la-la-la (HOO)\nBeanie Sigel always smokin that la-la-la (HOO)\nKanye track smoke like la-la-la (HOO)\nIt's the R.O.C. mami, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n[Jay-Z]\nI know my English ain't as modest as you like\nBut come, get some, you little bums\nI take the cake from under the baker's thumbs\nI bake the cake, get two of them for one\nThen I move the weight like I'm Oprah's son\nUh, I'll show you how to do this son\nYoung don't mess with chicks in Burberry paddings\nFake Manolo boots straight from Steve Madden (u-uh)\nHe padded hisself the rap J.F.K., you wanna pass for my Jaqueline Onassis\nThen, hop ya ass out that S-class\nLay back in that Maybach, roll the best grass, I ask\nHave you in your long-legged life\never seen a watch surrounded by this much pink ice?\nLook but don't touch, motherfucker think twice\n'Cause the gat that I clutch got a little red light\nNeed a light?\n[Hook]\nTo smoke that la-la-la\nBeanie Sigel always smoking that la-la-la\nMemph' Bleek always smoking that la-la-la\nIt's the R.O.C. mami, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n[Jay-Z]\nWe got brothers full of Arm'i, mami's in Manolo\nBags by Chanel, all Louis Vuitton logos\nAll attracted to Hov' because they know dough\nWhen they see him, whips be European\nIf you're a ten, chances you're with him\nIf you're a five, you know you ridin' with them\nSick with the pen nigga, no physician in the world could fix him\nNo prescription, you could prescribe to subside, his affliction\nHe's not a sane man, he's more like reign man - twitchin'\nYou can't rain dance on his picnic\nNo Haitian voodoo, no headless chickens can dead his sickness\nNo Ouija board, you can't see me dog, nigga you CB-4\nThis ain't Chris Rock bitch, it's the R.O.C. bitch\nAnd I'm the franchise like a Houston Rocket, Yao Ming!\n[Hook]\nStill smokin that la-la-la\nMemph' Bleek still smokin that la-la-la\nBeanie Sigel, Desert Eagle, the four-ty five\nIt's the R.O.C. baby, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n[Verse Three: Kanye West]\nShe playin she hate when I'm name droppin\nSo when I talk rap, she gon' change topics\nBut I got a plan B that's planned out, for when things don't pan out\nHov' tellin ya mind brother, I'ma play shy brother\nSo you take the Destiny Child girl in the Coupe?\nThen I'ma try bag the ones that got kicked out the group\nI figured that'll be simple, I'll just help 'em with their demo\nHelp 'em to the limo, play the upboard instrumentals\nAnd she - grabbed my tattoo, peeped my credentials\nAnd she - grabbed my pants, felt the potential\nAnd I - rubbed 'bout every essential\nThat have fun breakin her fundamentals\nExcuse me miss, the artist of the new millenium\nHas finally stopped drivin that blue Millenium\nAnd got a good of trenny and filled it with plenty of Henney\nand Remi and weed, 'til she higher than Hilliam\n[Hook]\nIf she pass me, smoke that la-la-la\nMemphis Bleek always smokin that la-la-la\nBeanie Sigel, Desert Eagle, the four-ty five\nIt's the R.O.C. bitch, sing our lullaby\nC'mon!\n[Chorus]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nWHOA, skip all the singin' let's get right tonight, mami\n", "title": "Excuse Me Miss Again (Remix) (Featuring Jay-z) lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Intro: Kanye West]\nHow's your son? (all, all, all the things, things)\nHe make the team this year? (all, all, all the things things)\nAw th-, they said he wasn't tall enough?\n(all, all, all the glitter in that gold)\nYeah me we gon' cook this up (now gold is not a reality)\n(real is what you live to be)\n[Verse 1: Kanye West]\nThis is family business\nAnd this is for the family that can't be with us\nAnd this is for my cousin locked down, know the answer's in us\nThat's why I spit it in my songs so sweet\nLike a photo of your granny's picture\nNow that you're gone it hit us\nSuper hard on Thankgiving and Christmas, this can't be right\nYeah you heard the track I did man, this can't be light\nSomebody please say grace so I can save face\nAnd have a reason to cover my face\nI even made you a plate, soul food, know how Granny do it\nMonkey bread on the side, know how the family do it\nWhen I brought it why did God have to look all to it?\nAs kids we used to laugh\nWho knew that life would move this fast?\nWho knew I'd have to look at you through a glass?\nAnd look, tell me you ain't did it, you ain't did it\nAnd if you did, then that's family business\n[Hook: Choir]\nAnd I don't care 'bout (all the, all the diamond rings, diamond rings)\nThey don't mean a thing (all, all, all the things)\nAll these fancy things\nI tell you that all (all the glitter) I'm waiting for\nNow all I know I know all these things\n[Verse 2: Kanye West]\nThis is family business\nAnd this is for everybody standin' with us\nCome on, let's take a family Grammy picture\nAbby, remember when they ain't believe in me?\nNow she like \"See, that's my cousin on TV\"\nNow, we gettin' it and we gon' make it\nAnd y'all gon' hate it and I'm his favorite\nI can't deny it, I'm a straight rider\nBut when we get together be electric slidin'\nGrandma, get 'em shook up\nAw naw, don't open the photo book up\nI got an Aunt Ruth that can't remember your name\nBut I bet them Polaroids'll send her down memory lane\nYou know that one auntie, you don't wanna be rude\nBut every holiday nobody eatin' her food\nAnd you don't wanna stay there cuz them your worst cousins\nGot roaches at their crib like them your first cousins\nAct like you ain't took a bath with your cousins\nFit three in the bed while six of y'all\nI'm talkin' 'bout three by the head and three by the leg\nBut you ain't have to tell my girl I used to pee in the bed\n[Interlude: Choir]\nRain, rain, rain go away\nLet the sun come out and all the children say\nRain, rain, rain go away\nLet the sun come out and all the children say\n[Verse 3: Kanye West]\nI woke up early this mornin' with a new state of mind\nA creative way to rhyme without usin' nines and guns\nKeep your nose out the sky, keep your heart to God\nAnd keep your face to the risin' sun\nAll my niggas from the Chi, that's my family dog\nAnd my niggas ain't my guys, they my family dog\nI feel like one day you'll understand me dog\nYou can still love your man and be manly dog\nYou ain't got to get heated at every house warmin'\nSittin' here, grillin' people like George Foreman\nWhy Uncle Ray and Aunt Shiela always performin'?\nThe second she storms out then he storms in\nY'all gon' sit down, have a good time this reunion\nAnd drink some wine like Communion\nAnd act like everything fine and if it isn't\nWe ain't lettin' everybody in our family business\n[Interlude: Choir]\n(all the, all the diamond rings, diamond rings)\nThey don't mean a thing (all, all, all the things)\nThey don't mean a thing\n(all the, all the diamond rings, diamond rings)\nThey don't mean a thing, a thing\n[Hook: Choir]\nAnd I don't care 'bout (all the, all the diamond rings, diamond rings)\nThey don't mean a thing (all, all, all the things)\nAll these fancy things\nI tell you that all (all the glitter) I'm waiting for\nNow all I know I know all these things\n[Females:] (oooh) All these things (these things)\n[Males:] All these things (oooh) all these things (these things)\n[F:] All these things (oooh) all these things (these things)\n[M:] All these things (oooh) all these things (these things)\n[F:] All these things (oooh) all these things (these things)\n[M:] All these things (oooh) all these things (these things)\n[F:] All these things (oooh) all these things (these things)\n[M:] All these things (oooh) all these things (these things)\n", "title": "Family Business lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Kanye West]\nI'm tryin to catch the beat, uh\nI'm tryin to catch the beat\nI'm tryin to catch the beat, uh uh, uh\nI'm tryin to catch the beat\n[Chorus: Kanye West]\nN-now, th-th-through ya motherfuckin hands\nGET EM HIGH\nAll the girls pass the weed to ya motherfuckin man\nGET EM HIGH\nNow I ain't never tell you to put down ya hands\nKEEP EM HIGH\nAnd if ya losin yo high than smoke again\nKEEP EM HIGH\n[Verse 1: Kanye West]\nN-n-n-now, my flow\nIs in the pocket like Wallace, I got the bounce like hydrolics\nI can't call it, I got the swerve like alchoooool-ics\nMy freshman year I was goin through hell, a problem\nStill I, built up the nerve to drop my ass up outta collllllll-ege\nMy teacher said I'se a loser, I told her why don't you kill me\nI give a fuck if you fail me, I'm gonna folllllllllll-ow\nMy heart, and if you follow the charts, to the plaques or the stacks\nYou ain't gotta guess who's back, you see\nI'm so shy that you thought it was bashfull but this\nbastard's flow will bash a skull\nAnd I will, cut your girl like Pastor Tro\nAnd I don't, usually smoke but pass the 'dro\nAnd I won't, give you that money that you askin fo'\nWhy you think, me and Dame cool, we ask hoes\nThat's why we here your music in fast fo'\nCuz we don't wanna here that weak shit no mo'\n[Chorus: Kanye West]\nN-now, th-th-through ya motherfuckin hands\nGET EM HIGH\nAll the girls pass the weed to ya motherfuckin man\nGET EM HIGH\nNow I ain't never tell you to put down ya hands\nKEEP EM HIGH\nAnd if ya losin yo high than smoke again\nKEEP EM HIGH\n[Verse 2: Kanye West]\nN-n-n-n-n-now who the hell is this\nE-mailin me at 11:26, tellin me that she 36-26, plus double-d\nYou know how girls on black planet be when they get bubblee\nAt NYU but she headed from Kansas, right now she just lampin, chillin on\ncampus\nSent me a picture with a feelin on Candice\nWho said her favorite rapper was the late great Francis\nW-H-I-T, it's gettin late mami, your screen saver say tweet\nSo you got to call me, and bring a friend for my friend\nHis name Kweli\n(You mean Talib, lyric sticks to your rib)\nI mean\n(That's my favorite CD that I play at my crib)\nI mean\n(You don't really know him, why is you lyin)\nYo Kwe, she don't believe me, please pickup the line\nShe gon' think that I'm lyin, just spit a couple of lines\nThen maybe I'll be able to give her dick all the time, and get her high\n[Verse 3: Talib Kweli]\nYeah\nI can't believe this nigga use my name for pickin up dolls but\nGET EM HIGH, I need some tracks you tryin to pull tracks out\nAnd my rhymes as fittin to blow you tryin to blow back south\nWell ok, you twisted my arm, I'll asist with the charm, aiyyo\nI though you meet that chickit that got friends with yo moms\nAnd she's the bomb, boy she got the boujI behavior\nAlways got somethin to say like a bookee playa hater\nAnyway, I don't usualy fuck a interneter\nDraws stuck to they arm like Nicorette\nYou really fuckin that much, you tryin to get off cigarettes\nAnd she think it's fly, she ain't met a real nigga yet\nI appoligize if I come off a little inconsiderate\nI got the bubble cushion a sister could get ahead of it\n[Verse 4: Common]\nGet em high like noon, or the moon or room filled with smoke\nA high filled with dope\nY'all assumed I was doomed, out of tune, but I still feel the notes\nThe real nigga quotes\nReal rappers is hard to find, like a remonte, control rap is not a\nUsed soup it still got life, that's why I abuse you who are not thugs\nRock clubs, it's like Tiger, Woods in the hood, to have my own reality show\nCalled Soul Survivor, I stole all liver, niggaz in you\nYou'se a bitch I got ones that are thicker than you\nHow could I ever let your words affect me, they say Hip-Hop is dead\nI'm here to resurrect me, mosh is to sexy to even make songs like these\nThat's why the raw don't know your name, like Alicia Keys\nTo many featured emcees, and pro-ducers is populer\nTwelve thousand spins, nobody got to coppin her\nAlbum, how come, you the hot garbager\nThe years clear your image and snooped up\nLabel got you souped up, tellin you you sick\nMan you a dick with a loose nut\nVideo hard to watch like Medusa\nEven your club record need a booster\nChimped up, with a pimp cup, illeaterate nigga\nRead the infa, red across your head I'm bread king like Simba\nBolder then Denver, I ain't a Madd Rapper just a emcee with a temper\nYou dansin for money like honey, I did this my way\nSo when the industry crash, I survive like Kanye\nSpittin through wires and fires, emcees retirin\nGot yo hands up, get them motherfuckers higher then\n[Chorus: Kanye West]\nN-now, th-th-through ya motherfuckin hands\nGET EM HIGH\nAll the girls pass the weed to ya motherfuckin man\nGET EM HIGH\nNow I ain't never tell you to put down ya hands\nKEEP EM HIGH\nAnd if ya losin yo high than smoke again\nKEEP EM HIGH\n", "title": "Get Em High lyrics"}, {"lyrics": "[Kanye Talking]\nIts Kanye West straight outta\nChi-Town Super Producer brought you\njoints like H to the Izzo Take over\nand that new Scarface single and im chillin with da\nda leader of da new school absolute heavy hitters yall\n......................................................\nyo...(clears throat while theres vocals in the back)\nim kanye titta 1st of all comin str8 from da chi\nuh i dont lie\nits like da singer say\nive been known to do beats like that know wha im sayin\nbrought u hits such as uh uh\ni love girls girls girls girls\ngimme some brain before i hop up on this plane\ngotta head right back to da chi\n[verse 1]\nnow even though i went to college and dropped outta school quick\ni always had a p.h.d. a pretty huge d*ck\nladies tired of gettin ripped off by guys like this\ngivin head is like a whale thats usin a toothpick\nwell im in da club for a limited time only\ntwo way a phony if you tryna bone me\nya man got monie ya still feel lonely\nclaim he love you its no doubt its gwen stef-phony\nyou a light skinneded nia\ndark skinneded tamia\nblack jennifer lopez\na ghetto senorita\nyou remind me of my jeep but not nokia\nwe can talk on my cell but not nokia\nit be goin in and out thats why i barely here ya\nit be goin in and out like a robberia\nim tryna take dis money like rob and gia\nand imma take u to my house like trick and trina\nchi-town chi-town big city of dreams\nand my d*ck so big it cant fit in my jeans\nand a bitch so mad she cant get in my cream\nand it gets so bad she wanna tear up my things but still\n[Hook x2]\nK-A-N-Y-E chi-town play ya out in NYC\nshe said she wanna go on a shoppin spree\nbut her some cheap J.LO jeans cuz da ass is free\n[verse 2]\ni love girla girls i got a fetish for em\nbut not no lettuce for em\ndick and bad credit for em\nbills bills i know she tryna get paid\nshe know im tryna get laid\nshe figure thats an even trade off\nif she a stewardess i show her to my cockpit\nif she a lawyer than i give her johnny cochran\nif she wanna see me again she betta get 2 friends then maybe then\nwe'll have group sex toothex\nand a young girl off dat x\nand she just turned eight teen\nthats when she was against the law\nso for her bithday i put this d*ck against her jaw\nand like a picture in a frame put it against the wall\nsaid she had never been with a man before\nbut she not a virgin huh she a lady lover\ni didnt know yall take each other out\nand date each other uh but dats a lady lover\ni aint even know dat was ya baby mother\n[Hook x1]\n[Kanye Talking w/vocals in da back]\nexplain da outro man dont nobody never get to the outro\ni just take a whole record and just\nim not gonna talk about the producer sh*t right now\ni just want n*ggaz to realize my sh*t u know what im sayin\n2002 aight i sounded real mad on the last mixtape im not even gonna\ngo there this time ok\n", "title": "Girls (Remix) lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Jamie Foxx]\nshe takes my money when I'm in need\nYea she's a trifflin friend indeed\nOh she's a gold digga way over town\n[Chorus:]\n(She did me wrong)\nNow I aint sayin she a gold digger (When I'm Need)\nBut she aint messin wit no broke niggaz\n(She did me wrong)\nNow I aint sayin she a gold digger(When I'm need)\nbut she aint messin wit no broke niggaz\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head\n[Verse 1 - Kanye West]\nCutie the bomb\nMet her at a beauty salon\nWith a baby louis vuitton\nUnder her underarm\nshe said I can tell you ROC\nI can tell by ya charm\nFar as girls you got a flock\nI can tell by ya charm and ya arm\nbut I'm lookin for the one\nhave you seen her\nMy psychic told me she got have ass like Serena\nTrina, Jennifer Lopez, four kids\nAn i gotta take all they bad a** to show-biz\nOk get ya kids but then they got their friends\nIm caught up in the Benz do yall gotta pen\nDo yall went to den and then I had to pay\nIf you f**kin with this girl then you betta be payed\nYou know why\nIt take too much to touch her\n>From what I heard she got a baby by Busta\nMy best friend say she use to f**k wit Usher\nI dont care what none of yall say I still luv her\n[Chorus:]\n(She did me wrong)\nNow I aint sayin she a gold digger (When I'm Need)\nBut she aint messin wit no broke niggaz\n(She did me wrong)\nNow I aint sayin she a gold digger(When I'm need)\nbut she aint messin wit no broke niggaz\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head\n[Verse 2 - Kanye West]\n18 years, 18 years\nshe got one of yo kids got you for 18 years\nI know somebody payin child support for one of his kids\nHis baby momma's crib is bigger than his\nYou will see him on TV any given sunday\nWin the Superbowl and drive off in a Hyundai\nShe was spose to buy ya shorty TYCO wit ya money\nShe went to the doctor got lypo wit ya money\nShe walkin around lookin like Myco wit ya money\nShould of got insured got GEICO wit ya moneeey\nIf you aint no punk holla We Want Prenup\nWE WANT PRENUP!, Yeaah\nIt's something that you need to have\nCause when she leave yo a** she gone leave wit half\n18 years, 18 years\nAnd on her 18th birthday he found out it wasn't his\n[Chorus:]\n(She did me wrong)\nNow I aint sayin she a gold digger (When I'm Need)\nBut she aint messin wit no broke niggaz\n(She did me wrong)\nNow I aint sayin she a gold digger(When I'm need)\nbut she aint messin wit no broke niggaz\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head\n[Verse 3 - Kanye West]\nNow I aint sayin you a gold digger you got needs\nYou dont want ya dude to smoke but he can't buy weed\nYou got out to eat and cant pay so yall cant leave\nIf this is back he gotta roll up his sleeves\nBut why yall washin watch him\nHe gone make it into a Benz out of that Dotson\nhe got that invision baby look in his eyes\nThis week he moppin floorz next week it's the fries\nSo stick by his side\nI know his dude's ballin but yea thats nice\nAnd they gone keep callin and tryin\nBut you stay right girl\nBut when you get on he leave yo a** for a white girl\n[Chorus:]\n(She did me wrong)\nNow I aint sayin she a gold digger (When I'm Need)\nBut she aint messin wit no broke niggaz\n(She did me wrong)\nNow I aint sayin she a gold digger(When I'm need)\nbut she aint messin wit no broke niggaz\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head get down(I gotta leave)\nget down girl go head\n[Repeat to fade out]\n", "title": "Gold Digger lyrics"}, {"album": "Album: Late Registration", "lyrics": "But it's too late, it's too late\nHe, gone\n[Kanye West]\nYou sweat her, and I ain't talkin 'bout a Coogi\nYou a big L, and I ain't talkin 'bout Cool J\nSee me at the airport, at least 20 Louis\nTreat me like the Prince and this my sweet brother Numpsay\nBROTHER NUMPSAY! Groupies sound too choosy\nTake 'em to the show and talk all through the movies\nSays she want diamonds, I took her to Ruby Tuesdays\nIf we up in Friday's, I still have it my way\n[Chorus]\nToo late, we, gone - we strivin home\nGone - we ride on chrome\nIt's too late\n[Kanye West]\nY'all don't want no prob from me\nWhat you rappers could get is a job from me\nMaybe you could be my intern, and in turn\nI'll show you how I cook up summer, in the win-turr\nAaron love the raw dog, when will he learn\nCaught somethin on the Usher tour he had to \"Let it Burn\"\nPlus he already got three chil'run\nArguin over babysitters like, \"Bitch - it's yo' turn!\"\nDamn 'Ye, it'd be stupid to ditch you\nEven your superficial raps is super official\nR-R-R-Roc pastel with Gucci on\nWith TV's in the ride, throw a movie on\nSaid he couldn't rap now he at the top with doobie long\nCause the dookie's on any song that they threw me on, gone\n[Chorus]\nWe strivin home, gone\n[Cam] I ride on chrome...\nWe strivin home, gone\n[Cam] Killa, I ride on chrome\n[Cam'Ron]\nKnock knock, who's there? Killa Cam, Killa who?\nKilla Cam, hustler, grinder, gorilla true\nOh my chinchilla blue, blue you ever dealt with a dealer\nWell here's the deal ma we goin to the {?}\nNo concealin, no ceiling I don't need a roof\nAct up, get out, I don't need you poof\nPoof, be gone, damn tough luck dag\nDag, niggaz still doin puff puff pass\nPull the truck up fast and I tell 'em\nHey, back in a touched up Jag, shit\nY'all niggaz want Killa Cam, cerebellum\nAn old man just gon' tell 'em (too late, he, gone)\nThen I see how y'all gonna react when I'm (gone)\nMy last girl want me back then I'm on\nFine stay, you got the grind hey\nCame back, read what the sign say (too late, he, gone)\nYes I know you wanna see my demise\nYeah you church boy actin like a thief in disguise\nAin't leavin my side, see the greed in my eyes\nAsk Abby y'all hustle for a week to the Chi, shit\nAnd that ain't leavin alive, please believe me\nGave Weezy a piece of the pie, and\nYou can ask George or Regina\nThe whole Westside I explore with the Beemer now\n[Chorus]\nWe strivin home, I ride on chrome\nListen homeboy move on\nThat's your best bet, why's that?\nCause\n[Consequence]\nUhh, uhh, yo, yo\nI been pourin out some liquor for the fact that my pal's gone\nAnd tryin to help his momma with the fact that her child gone\nAnd since we used to bubble like a tub full of Calgon\nGuess it's only right that I should help her from now on\nBut since they got a foul on, what coulda gone wrong\nNow they askin Cons, how long has this gone on\nAnd maybe all this money mighta gone to my head\nCause they got me thinkin money mighta gone to the feds\nSo I ain't goin to the dread, but he'll go on up to bed\nAnd when I came the next mornin he was gone with my bread\nAnd with that bein said, I had gone on my instincts\nAnd gone to the spots where they go to get mixed drinks\nBut lookin back now shoulda gone to the crib\nAnd rented \"Gone With the Wind,\" cause I'da gone about 10\nBut I had gone with my friend, and we had gone to the bar\nAnd heard a nigga talkin shit so I had gone to the car\nAnd now the judge is tellin me that I had gone too far\nAnd now we gone for 20 years, doin time behind bars\nAnd since I gone to a cell for some cruddy crimes\nI guess I gone to the well one too many times, cause I'm gone\n[long instrumental pause]\n[Kanye West imitating \"The Show\" at first]\nUh-uh-uh\nUh-uh-uh uh uh onnn, uh uh-uh onnn\nUh-uh onnn, uh uh-uh I'mmmm\nAh-head of my time, sometimes years out\nSo the powers that be won't let me get my ideas out\nAnd that make me wanna get my advance out\nAnd move to Oklahoma and just live at my Aunt's house\nYeah, I romance the thought of leavin it all behind\nKanye step away from the lime-\n-light, like, when I was on the grind\nIn the \"One, Nine, Nine, Nine\"\nBefore, model chicks was bendin over or\nDealerships asked me Benz or Rover, man\nIf I could just get one beat on Hova\nWe could get up off this cheap-ass sofa\nWhat the summer of the Chi got to offer an 18-year-old\nSell drugs or get a job, you gotta play gyro\nMy dawg worked at Taco Bell, hooked us up plural-fied\nA week later the manager count the churros\nSometimes I can't believe it when I look up in the mirrow\nHow we out in Europe, spendin Euros\nThey claim you never know what you got 'til it's GONE\nI know I got it, I don't know what y'all on\nI'ma open up a store for aspiring MC's\nWon't sell 'em no dream, but the inspiration is free\nBut if they ever flip sides like Anakin\nYou'll sell everything includin the mannequin\nThey got a new bitch now you Jennifer Aniston\nHold on I'll handle it, don't start panickin, stay calm\nShorty's at the door cause they need more\nInspiration for they life, they souls, and they songs\nThey said sorry Mr. West is gone!\n", "title": "Gone(feat. Consequence, Cam'ron) lyrics"}, {"album": "Album: Freshman Adjustment", "lyrics": "Niggas gossiping, it runs the city, they don't know who watching them\nWhen they coming to get me, so I hit the block and bend\nDo about 60, and I put my glocks to them, like plow plow plow\nI'm gonna to get on this TV and put shit down\nI aint finna let these lights skinned niggaz come back in style\nI'm finna turn to this class clown, should be crazy deep\nThey told my momma I was bipolar had A.D.D.\nI told em, what-what I wanna do, I wanna be a baller\nThe dream spoilers are for ya\nHatin on you to they mans on the corners\nOld folks said he'd never make it off the corner\nThey are the virus that corrupts the soul\nThey are the cubic zirconia inside the 10 karat gold\nThat get green on ya, when you get green on em\nYou gotta wash ya hands of em, get clean on em\nSomebody told me success is the best revenge\nSo they gon be fucked up when you do ya thing on em\nNow hold ya plaques high, like who woulda thought\nAnd tell em, ahem, thank you for your no support\nThey are the dreamkillers, they the dreamkillers\nWho know a dream, they are the dream (killer Norman Bates)\nThey the dreamkillers, they the dreamkillers, dream\nThey are the dream (killer Norman Bates)\nNow how you gonna talk about the way I spend my money\nEverybody say it with me now, it's my money\nAnd they know they hatin, but what they don't know is\nThey are my motivation, they are my inspiration\nCos we the leaders, and they the followers\nAnd we the nut busters, and they the swallowers\nThey are the rumours, they are the lies\nWe are the shit dog, and they the flies\nHow you gon tell me how to live my life\nAnd you can't even get your own shit tight, right\nThey are the misery that loves company\nCuz that comfortable corporate job can't comfort me\nTold em I finished school, and I started my own business\nThey said ?Oh you graduated?? No I decided I was finished\nChasin yall dreams and what you got planned\nNow I spit it so hot you got tanned\nAnd they hate on your relationship, then break your marriage up\nCan't kill ya dreams so they assassinate your character\nDo anything to downplay ya or embarrass ya\nCome around wit ya but they ain't down wit ya\nThey the dreamkillers\nAnd I'm through spittin these rappers my most heartfelt flow\nThey be like ?That's cool, you got some beats for me though??\nOh I get it, you wanna be Snoop and Dr. Dre\nBut don't nobody give a fuck what you got to say\nAnyway what you finna rap about?\nYou never sold crack out ya house or put a gat to a mouth\nOr put ya fist to ya spouse, so how you gon move the crowd?\nI bet a thousand that you get booed out\nI even heard that they even takin wages in jail\nThey bet ten boxes of cigarettes that I'm finna fail\nSecond you talk about me, they be like ?Peace?\nThis nigga came from the Chi, moved to the east\nYou gotta kill at least one person at least\nOr we'll evict you from the rap game, cancel your lease\nHow you go to New York, what you ain't never took a tour there?\nWhat you ain't know you gotta be rich just to be poor there?\nThe dreamkillers\nNiggas gossiping, it runs the city\nThey don't know who watching them\nWhen they coming to get me\nSo I hit the block and bend and do about 60\nAnd I put my glocks to them, like plow plow plow\n", "title": "Gossip Files lyrics"}, {"album": "Album: College Dropout", "lyrics": "Bernie Mac:\nWhat in the fuck was that Kanye?\nI thought I told you to do some shit for the kids\nYou give me these motherfucking graduation tickets right now\nYou can give me this motherfucking robe, cap, and gown\nYou will not walk across that stage\nYou won't slide across that stage\nMotherfucker can't pull you across the stage\nKanye\nWho told you, I told you to do something uplifting\nI am trying to get you out here with these white people and\nThis is how you gone do me\nYou's a nigger\nAnd I don't mean that in no nice way\nGot the lil? kids singing about the shit now the jokes on you\nYou throw your motherfucking hands in the air\nAnd wave your body body\nYou can get the fuck off this campus\nWhat you gone do now?\nI'm no longer confused but don't tell anybody.\nI'm about to break the rules but don't tell anybody.\nI got something better than school but don't tell anybody.\nMy momma would kill me but don't anybody.\nShe wants me to get a good ass job just like everybody.\nShe ain't walked in my shoes I'm just not everybody.\n", "title": "Graduation Day lyrics"}, {"album": "Album: Freshman Adjustment", "lyrics": "Heavy Hitter for life\nHeavy hitters for life\nYou rappers think I give a f*ck about the way the day spent\nWant to be on my album but don't want me on they sh*t\nEverybody thought i was makin a compelation\nI was really makin myself they competation.\nFresh off the plane form the all star game.\nBone girls on t.v so it's all star trains\nJust picture man. No stichin man.\nsomethin for the phiends fresh out the kitchen man.\nLast 9/11 I was poor on a half till I floored up my math\nNow it's Porsche 9/11 and I'm floorin the gas\nProblems that i had no more.\nwell damn look at how everybody den changed\nall my niggas is bout to have it made\ntell j that i'm bout to change the game\nthis makes everything else sound played\ngoddamn Kanye! Kanye! Kanye!\nNow hold up. Ain't nobody makin with me dog now you say it.\nAin't nobody messin with you at all\nI told dude you can't even rap on my interlude\nnow does that make me as rude as Jude?\nWhen the album comin out man the people is askin\nYall got motive adidas ya sick with the fashion\nYa already got do so ya spit for the passion\nthe way ya rhymes give me Tribe Called Quest flash backs\nAnd let's not even bring up the tracks man\nnope nope let's not do that man\nya eatin up the game like Pac man\nand got the whole world shakin just like crack phiends.\nHeavy hitters for life\nRoca fella is for life throw them diamonds up throw them diamonds up trow ya diamonds\n", "title": "Heavy Hitters lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Chorus]\n(Hey Mama), I wanna scream so loud for you, cuz I'm so proud of you\nLet me tell you what I'm about to do, (Hey Mama)\nI know I act a fool but, I promise you I'm goin back to school\nI appreciate what you allowed for me\nI just want you to be proud of me (Hey Mama)\n[Verse 1]\nI wanna tell the whole world about a friend of mine\nThis little light of mine and I'm finna let it shine\nI'm finna take yall back to them better times\nI'm finna talk about my mama if yall don't mind\nI was three years old, when you and I moved to the Chi\nLate December, harsh winter gave me a cold\nYou fixed me up something that was good for my soul\nFamous homemade chicken soup, can I have another bowl?\nYou work late nights just to keep on the lights\nMommy got me training wheels so I could keep on my bike\nAnd you would give anything in this world\nMichael Jackson leather and a glove, but didn't give me a curl\nAnd you never put no man over me\nAnd I love you for that mommy cant you see?\nSeven years old, caught you with tears in your eyes\nCuz a nigga cheatin, telling you lies, then I started to cry\nAs we knelt on the kitchen floor\nI said mommy Imma love you till you don't hurt no more\nAnd when I'm older, you aint gotta work no more\nAnd Imma get you that mansion that we couldn't afford\nSee you're, unbreakable, unmistakable\nHighly capable, lady that's makin loot\nA livin legend too, just look at what heaven do\nSend us an angel, and I thank you (Hey Mama)\n[Chorus]\n[Verse 2]\nForrest Gump mama said, life is like a box of chocolates\nMy mama told me go to school, get your doctorate\nSomethin to fall back on, you could profit with\nBut still supported me when I did the opposite\nNow I feel like it's things I gotta get\nThings I gotta do, just to prove to you\nYou was getting through, can the choir please\nGive me a verse of ?You, Are So Beautiful To Me?\nCan't you see, you're like a book of poetry\nMaya Angelou, Nicky Giovanni, turn one page and there's my mommy\nCome on mommy just dance wit me, let the whole world see your dancing feet\nNow when I say Hey, yall say Mama, now everybody answer me (Hey Mama)\n[Chorus]\n[Bridge]\nI guess it also depends tho, if my ends low\nSecond they get up you gon get that Benzo\nTint the windows, ride around the city and let ya friends know (Hey Mama)\n[Verse 3]\nTell your job you gotta fake em out\nSince you brought me in this world, let me take you out\nTo a restaurant, upper echelon\nImma get you a jag, whatever else you want\nJust tell me what kind of S-Type Donda West like?\nTell me the perfect color so I make it just right\nIt don't gotta be Mother's Day, or your birthday\nFor me to just call and say (Hey Mama)\n[Chorus] (with variations)\n", "title": "Hey Mama lyrics"}, {"lyrics": "(ft. Do or Die)\n(Do or Die)\nYo Kanye Blow the Hook you a genius boy\n(Chorus)\nNow when you hear this song you know it's on (Babygirl)\nwhen you hear this song you know it's on\nwhen you hear this song you know it's on\nI swear your lovin got me so high I'm gone\nMe and you babygirl like best friends\nlet me hit you when I get the notion\non I-55 you and I\nLet's ride hit the motion\nsome say she freaky freaky\nlet me guess your lidro needa\nI'm hittin through the back and curves\nhell, they sell the herb\nNow open up your mind to this concept\nthen you take one step\nstraight from the feelin of a wordsmith\nthats the herb shit\nup on my 22 spins\nin my baby blue benz\ngirls say dat boys ben actin up\nbut thats the way he is\nYou lokkin good when you steppin out a centerfold\ntell me when I reach a pen to hold\nlet me hit u wit this dime in the street game\nlet a motherfucker go yeah u know it\nso now let me sugarcoat it\nIt's like im on that tight herb\nand when I pull t the curb it's like, it's like\nYour my latest, and my geatest\nmy latest, my greatest\n(Chorus)(x2)\nwhen I'm layin in the back of my 745\nwith my lips on you\nspittin good game\nwith the hustler grain\ngettin brained like a hustler should\nhustler would\nand you know when I hear the stuff\nI'm still tryin to hear this love what that do\nIt's like that baby when I mix it up baby gurl u jus got me sprung\nwhat that do\nOh yes she's one of the best\nas i touch this is past tense I'm hurtin\nlurkin searchin for the virgin\nbut when my babygurl it's workin\nlet me know whats that you smokin\nfrom the hands as I stick my tounge in\nthen from the back but she want an autograph\nbut still we sexin'\nOpen back up last time\nas I spit a little dough in my mind\nshe jus like one of a kind\nno c's no stand in her hind\nshes jus like me rappin a line\nperfect let me drop in a dime\nI'm on a roll again\nI'm bought to blow again\nYour my latest, and my geatest\nmy latest, my greatest\n(Chorus)\njust keep on liftin me up yeah\n(Choir)\nHigher\n(Do or Die and Kanye)\nNo need to take another puff\n(Choir)\nHigher\n(Do or Die and Kanye)\ncause your love has got me high enough\nNo, No, No,No, No, No\n(overlappig Choir and Do or die)\nJust keep on Lifting me up yeah\n(Choir)\nHigher\n(Do or Die and Kanye)\nNo need to take another puff\n(Choir)\nHigher\n(Do or Die and Kanye)\ncause your love has got me high enough\nNo, No, No,No, No, No\n(overlappig Choir and Do or die)\nJust keep on Lifting me up yeah\n(continue till end)\n", "title": "Higher lyrics"}, {"album": "Album: Higher", "lyrics": "(Do or Die)\nYo Kanye Blow the Hook you a genius boy\n(Chorus)\nNow when you hear this song you know it's on (Babygirl)\nwhen you hear this song you know it's on\nwhen you hear this song you know it's on\nI swear your lovin  got me so high I'm gone\nMe and you babygirl like best friends\nlet me hit you when I get the notion\non I-55 you and I\nLet's ride hit the motion\nsome say she freaky freaky\nlet me guess your lidro needa\nI'm hittin through the back and curves\nhell, they sell the herb\nNow open up your mind to this concept\nthen you take one step\nstraight from the feelin of a wordsmith\nthats the herb shit\nup on my 22 spins\nin my baby blue benz\ngirls say dat boys ben actin up\nbut thats the way he is\nYou lokkin good when you steppin out a centerfold\ntell me when I reach a pen to hold\nlet me hit u wit this dime in the street game\nlet a motherfucker go yeah u know it\nso now let me sugarcoat it\nIt's like im on that tight herb\nand when I pull t the curb it's like, it's like\nYour my latest, and my geatest\nmy latest, my greatest\n(Chorus)(x2)\nwhen I'm layin in the back of my 745\nwith my lips on you\nspittin good game\nwith the hustler grain\ngettin brained like a hustler should\nhustler would\nand you know when I hear the stuff\nI'm still tryin to hear this love what that do\nIt's like that baby when I mix it up baby gurl u jus got me sprung\nwhat that do\nOh yes she's one of the best\nas i touch this is past tense I'm hurtin\nlurkin searchin for the virgin\nbut when my babygurl it's workin\nlet me know whats that you smokin\nfrom the hands as I stick my tounge in\nthen from the back but she want an autograph\nbut still we sexin'\nOpen back up last time\nas I spit a little dough in my mind\nshe jus like one of a kind\nno c's no stand in her hind\nshes jus like me rappin a line\nperfect let me drop in a dime\nI'm on a roll again\nI'm bought to blow again\nYour my latest, and my geatest\nmy latest, my greatest\n(Chorus)\njust keep on liftin me up yeah\n(Choir)\nHigher\n(Do or Die and Kanye)\nNo need to take another puff\n(Choir)\nHigher\n(Do or Die and Kanye)\ncause your love has got me high enough\nNo, No, No,No, No, No\n(overlappig Choir and Do or die)\nJust keep on Lifting me up yeah\n(Choir)\nHigher\n(Do or Die and Kanye)\nNo need to take another puff\n(Choir)\nHigher\n(Do or Die and Kanye)\ncause your love has got me high enough\nNo, No, No,No, No, No\n(overlappig Choir and Do or die)\nJust keep on Lifting me up yeah\n(continue till end)\n", "title": "Higher Ft. Do Or Die lyrics"}, {"album": "Album: Kanye West The Essentials Collection", "lyrics": "(featuring Dwele & QMB)\n[Kanye]\nuh oh uh oh uh\nuh uh uh uh uh uh..\nuh-uh uh uh uh uh uh uh..\nKanye to the..\nYeah\nOk\nI'm getting spins all day in L.A\nLuv, we can go the D where Dwele dwell\nD.C, P.G or ATL\nBack in The CHI I made my life like the magazine\nHoney wanna know the details about my Ebony\nWell that's X-X-L\nFar as the penthouse, yeah that's upscale\nMademoiselle got a hell of a Black tail\nI'm feeling her vibe, her Body and Soul\nI heard you stay in a metropolitan home\nWell lets kill all the parlay'in and offer you a comsopolitan\nLets jet out the club, get some oxygen\nYour friends claim I'm a player, you be lucky to keep me\nBut you know people gon' be talking 'bout us weekly\nMy car be, in a robbery, P.O.R.T but what's more important to me\nis that you..\n(Dwele)\nOpen your ears\nDon't allow these words to be ignored by years\nFearing lullibies, containing the same old lies (same old lies)\nDealing just to deal is just a crime\nBesides I know you wouldn't mind\nTrying something new so..\n(CHORUS)\nLet's (Let's)Try (Try)\nWe can work it out\nIf you let love(love) guide (guide)\nThe way that you feel for me\nOh(Oh) Why(Why)\nLet this opportunity pass (pass) by (by)\nYou should hold on\nPlease don't resist (don't resist)\nBless those harmonies to me, escape your lips (escape your lips)\nThere's no need to go home\nJust to dance along (dance aloo-o-one)\nI know you can't enjoy it on your own\nReally I don't see nothing wrong\nWith you and I spending some time--\nAlso let me mention, (Oooh)\nMy only intention, (Oooh)\nIs to feed you every single thing you hunger for---\nIn my heart I have to (Oooh)\nAnd-- want to have you (Oooh)\nSo fulfilled that you will never need to ask for more--\n[QMB]\nNow someone told my girl that she's a trophy wife\nSorta like Grant Hill and Koby's wife\nSo when we at a club, and she be so polite\nBut when we back at home she be poltergeist\nI mean provoking fights\nTrying to poke me with knifes\nAnd last time I tried to poke her she just told me goodnight\nSee her clothing be tight\nShe was pervert approved\nSo she gave up on life, now she don't wanna move\nHypnotized by the tube\nSo she stay with the clicker\nIn a cup full of liquor\nThinkin its makin her thicker\nBut its makin her slimmer\nSo our future is dimmer\nI cant remember last time I took my baby to dinner\nSee I'm sayin' a sister who was freaky and ruthless\nIn a yorkshire terrier in the pocket with pooches\nIn a pocket with Gucc's\nWas taking my lunch money\nJust like the gooches\nI'll tell you the truth miss\n", "title": "Hold On (Remix) lyrics"}, {"album": "Album: Freshman Adjustment", "lyrics": "(Chorus)\nGo ahead roll it up and pass it round\nCause lately's been a whole lot of bullshit going down\nA lot of soldiers aint make it through this year\nSo lets just celebrate that we still here and\nWhoooooooaa\nNever leave me alooooooooone\nTell em holla at ya boyyy and cause I'll be comin home\nI'll be comin home\nOoh, never leave me alooooooooone\nTell em holla at ya boyyy and cause I'll be comin home\nI'll be coming home\nMy homie called me like what up man\nNot from Florida but what up fam\nIt's been a whole lot of hatin again\nAnd if they hatin on me damn what up then\nI met this girl when I was three years old\nand what I love most she had so much soul\nShe said excuse me lil homey, I know you don't know me but uh my name is wendy (windy) and yo, I like to blow trees\nand from that point I never blow her off\nniggas come from out of town I like to show her off\nThey like to act tough she like to tore em off\nand make them straighten up they hat cuz she know they soft\nand when I grew up she showed me how to go downtown\nand at nighttime her face lit up, so astounding\nI told her in my heart is where she'll always be\nShe never mess with entertainers 'cuz they always leave\nShe said it feel like you walked and drove on me\nknew I was gang affiliated got on t.v. and told on me\nI guess that's why last winter she got so cold on me\nShe said Ye, keep makin that platinum and gold for me\nbut if you really cared for her\nThen you would have never hit the airport and followed your dreams\nSometimes I still talk to her\nbut when I talk to her it always seem like she talkin bout me\nShe said you left ya kids and they just like you\nThey wanna rap and make soul beats just like you\nbut they just not you\nand I just got through\nTalkin bout what niggas tryin to do just not new\nNow everybody got the game figured out all wrong\nI guess you never know what you got till is gone\nI guess that's why I'm here and I can't come back home\nand guess when I heard that when I was back home\nIn the interviews I'm representin you makin you proud\nShoot for the stars so if you fall you land on the clouds\nJump in the crowds\nSpark ya lighters and wave 'em around\nIf you don't know by now I'm talkin about Chi-town\n(Chorus)\nGo ahead roll it up and pass it round\nCause lately's been a whole lot of bullshit going down\nA lot of soldiers aint make it through this year\nSo lets just celebrate that we still here and\nWhoooooooaa\nNever leave me alooooooooone\nTell em holla at ya boyyy and cause I'll be comin home\nI'll be comin home\nOoh, never leave me alooooooooone\nTell em holla at ya boyyy and cause I'll be comin home\nI'll be coming home\n", "title": "Home lyrics"}, {"album": "Album: Graduation", "lyrics": "This song lyrics are not displayed due to the claim of copyright holder", "title": "Homecoming lyrics"}, {"lyrics": "I need to know, you down\nto do whatever, down\nto get it poppin', down\nto get topless, ohh\nI need to know\nif you about cuttin'\nor you about frontin'\nbaby i need to know\nMan i spent my last eight checkses on a necklace\nso i better get some sex for this, shieeeet\nshe want to sip up on the krisy krys like it Christy-mas\nand i'm saint nicholas, i got her and her sister in\nthat white benz, dike twins\ni ain't gonna lie they only fives but together they're tens\nand would i do em again? hmmm (hmmm)\nit's like old folks pissin' cuz it all depends\nand it's no coke sniffin' just juice and jin\ngrey goose to get you loose\nthey hit the nigga producin'\nthe track that got you movin'\nthis track got you movin'\nso crazy you don't know what you doin'\nyou been tellin them jokes\nand it's not a rumor, I like a girl with a sense of humor\nto give me a head til it aching, it's not a tumor\nso let me know what's going down before i pay for this room cuz\n*CHORUS* (2x)\nI need to know, down\nto do whatever, down\nto get it poppin', down\nto get topless, ohh\nI need to know\nif you about cuttin'\nor if you about frontin'\nbaby i need to know\nMan if you got it you got it\nand if you don't then you probably won't\nsince your nigga callin' mighty gant\ni never hit a lady but my game might abuse em\nvamboosh just to tell em that our jimmy choosin\ntake em back to confuse em\nso she don't know if she coming or going\ncuz mami after i'm cumming i'm going\nback to the show just frontin' and blowin'\njury stuntin' and glowin'\nit's like something i'm knowin'\nand i been known to have a hoe or two\ncuz my diamond's yellow like a smoker tooth\ni tell them step into the vocal booth\nroll a joint, smoke a few\nafter that i'm poking you\nafter that it's over boo\nbaby grab your coat and pweeooom\n*CHORUS* (2x)\nI need to know, down\nto do whatever, down\nto get it poppin', down\nto get topless, ohh\nI need to know\nif you about cuttin'\nor if you about frontin'\nbaby i need to know\nNow there's three different levels to relationships\nballing it at the club with em\ntalking and getting affectionate\nleaving and having sex with em\nkicking em out tricking no models, dimes and rats\nnow i don't get into that, i kick that habbit\ni just keep em impressed, let em\nseat em in lex never\neat em unless that fucking cat looks fresh\ni gotta a line in my pocket\ni'm lying, i gotta nine in my pants\nand baby i'm just dying for a chance\nwho ready to fuck? you ready to fuck?\noh fo shizzers, said she ready to cut\nand then she grabbed my scissors\nshe prolly look good but what's scary to me\nhenney makes hoes look like halle berry to me\n*CHORUS* (2x)\nI need to know, down\nto do whatever, down\nto get it poppin', down\nto get topless, ohh\nI need to know\nif you about cuttin'\nor if you about frontin'\nbaby i need to know\n", "title": "I Need 2 Know lyrics"}, {"album": "Album: College Dropout", "lyrics": "Some glad morning when this life is over,\nI'll fly away.\nTo a home on God's celestial shore,\nI'll fly away.\nI'll fly away, O Glory,\nI'll fly away.\nWhen I die, Hallelujah, bye and bye,\nI'll fly away.\nWhen the shadows of this life have flown,\nI'll fly away.\nLike a bird thrown, driven by the storm,\nI'll fly away.\nI'll fly away, O Glory,\nI'll fly away.\nWhen I die, Hallelujah, bye and bye,\nI'll fly away.\nJust a few more weary days and then,\nI'll fly away.\nTo a land where joy shall never end,\nI'll fly away.\nI'll fly away, O Glory,\nI'll fly away.\nWhen I die, Hallelujah, bye and bye,\nI'll fly away.\n", "title": "I'll Fly Away lyrics"}, {"lyrics": "{*The song starts with Jay-Z - Izzo (H.O.V.A.)*}\nLadies and gentlemen let's put our hands together for the astonishing\nH to the izz-O, V to the izz-A\n[Jay-Z]\nWelcome ladies and gentlemen to the 8th wonder of the world\nThe flow of the century, oh it's timeless, HOV'!\nThanks for comin' out tonight\nYou could've been anywhere in the world, but you're here with me\nI appreciate that, uhh\n*The song changes to: The Jackson Five - I Want You back*\n*The song changes to: The Doors - Five to One*\n[Kanye West talking]\nYo this song right here, I remember I used to play\nThis sample for people before I hooked up\nAnd I used to tell people \"you know, this, this gon' be like The Truth\nBut it's gon' better than The Truth\", and to all my niggaz, my nigga ??? said:\n\"I mean ask these but it ain't no Truth, that ain't no Truth right there!\"\nAnd he was all like, the Takeover\n[Jim Morrison]\nFive to one, baby, one in five\nNo one here, gets, out alive, now\nYou'll get yours, baby, I'll get mine\nGonna make it, baby, if we try\nThe old get old, and the young get stronger\nMay take a week, and it may take longer\nThey got the guns, but we got the numbers\nGonna win, yeah we're, takin' over\nCome on!\n*The song changes to: Jay-Z - Takeover*\n[Jay-Z]\nR.O.C., we runnin' this rap shit\nMemphis Bleek, we runnin' this rap shit\nB. Mac, we runnin' this rap shit\nFreeway, we runnin' this rap shit\nO and Sparks, we runnin' this rap shit\nChris and Neef, we runnin' this rap shit\nThe takeover, the break's over nigga\nGod MC, me, Jay-Hova\nHey lil' soldier you ain't ready for war\nR.O.C.'s too strong for y'all\n[Kanye West]\nAcrite nigga!\n*The song changes to: Jay-Z - Heart of the City (Ain't no Love)*\n[Jay-Z]\nUh, uh, listen\nFirst the Fat Boys break up, now every day I wake up\nSomebody got a problem with Hov'\nWhat's up y'all niggaz all fed up cause I got a little cheddar\nand my records movin' out the store\n*The song changes to: Bobby \"Blue\" Bland - Ain't no Love in the Heart of the City*\n[Bobby \"Blue\" Bland]\nAin't no love, in the heart of the city\nAin't no love, in the heart of town\nAin't no love..\n*The song changes to: David Ruffin - Common Man*\n[David Ruffin]\nYeeehh\n*The song changes to: Jay-Z - Never Change*\n[Jay-Z (David Ruffin)]\n(Never, never, never, never change)\nI never change, this is Jay every day\n(I never change!)\nI never change, this is Jay every day\n(I never change!)\nI never change, this is Jay\n", "title": "I'm Good (Feat. Jay-z) lyrics"}, {"lyrics": "[CHORUS: (Keyshia Cole and Kanye West)]\n[Keyshia Cole]\nI've been waiting my life; and I stayed on my grind\nNow I made up my mind; it's been way too much time\nThat's why...It's just impossible - It's im-poss-ible\nAnd you know that...\n[Kanye]\nI don't wanna hear that bull sh..; I wanna hear that official sh..,\nKanye and that Twista sh..; that's so impossible to get it (it's just impossible)\nGet it, that's so impossible to get it, Get it, that's so impossible to get it (It's impossible)\n[Verse 1]\n[Twista]\nAint no way you could pull up to the party in a Bentley blowing B in a club like this; (oh no)\nAint no way you could cook up in the studio with Kanye and get it jukking in the club like this (oh no)\nAint no way that you could win; dust some haters off while I'm sippin on my 'hen,\nHolla at a chick while she sippin on her gin\nAnd I got the mobsters hollering at her friends, (its impossible)\nFor you to ever be the nicest; you aint get gangsta or get righteous,\nYou aint neva stood on a tip like this; you aint neva stood for no sh.. like this, (Its just impossible)\nFor you to get it if you don't wanna win; so get up off ya ass\nand go for yours\nand neva for mine\nnow you aint from the ride that I'm in\nKnow what I'm\nsayin...\n[CHORUS]\n[Verse 2]\n[Twista]\nIt's impossible for you to eva get wit me because of how I ride on the track;\nGot the bitch in the back of the billy yo? When my celeb\nused to have the bitch in the back of the Cadillac (it's just impossible)\nNiggas always hatin\nleaving me for wilin out for po kim\nyou be sittin back talking yo shit\nI cant help but I see you tho, I don't get it (Its impossible)\nLil mama, for you to fit all that up in a pants; movin kinda wilder\nturn a regular jeans in a low riders\ntell me can I be your man (its just impossible)\nFor you to eva deny, that I'm about chi-town\nrepresent the city with the deal for 12 years and sell a couple a mil and still hold it down...THAT'S POSSIBLE\n[CHORUS]\n[Verse 3]\n[Kanye]\nGet it; bundled up and - lit it; smoke a lil blunt don't - admit it\ndo it like I did too late - I did it\nThe controversy cant worse me man; I'm eating but I'm still thirsty and\nThirsty what is you saying\nI gotta a duel with a couple niggas that's Thursday man\nWhy the hell is i'm worrying; hopping out the Benz with the perfect 10\nMan your life must be perfect man; look at how they came up with the perfect plan\nIts impossible\ngot strip clubs playin gosspital\ngirl so sick in the hospital\nyou know I jumped out like pakadu\nI only break it down I when I rock wit you\nSince Michael Jackson made rock wit you\nI done did shit on logical\nmaybe cause we did the impossible\nmaybe we done did the impossible\n[CHORUS]\n[Outro]\nNo matter what i do, see i been waitin all my, waitin all my life, yeah,\nAnd i know i stayed on my grind, i know i stayed on my grind,\nIts impossible for me to fail baby, i gotta keep on movin,\nGotta keep on movin, its impossible\n(Its just impossible) (its impossible)\n", "title": "Impossible (Feat. Twista, Keyshia Cole) lyrics"}, {"album": "Album: Late Registration", "lyrics": "Something I did Something I don't\nI can't explain how to\nI cant' speak for everybody but\nIt must be more good women than men percentage wise\nSo her chance of having a husband is minimize\nThat's why a lot of girls claim they ain't into guys\nMess with other girls part time to improvise\nI knew she wouldn't ride though I seen it in her eyes\nAnd I'm like any other guy tryin' get in her thighs\nShe telling me 'bout how black people should enterprise\nAnd I'm like if you don't get yo' ass in this ride to Enterprise\nSaid I rent it yesterday and got to have in by 5\nWith the gass fully filled up like I didn't drive\nTold her had a girl dawg fuck it I didn't lie\nSaid this rap game is all right I'm just getting by\nShe had a little weed and we get a little hight\nAnd I'm looking in her eyes and I'm loving the five\nTold me back in 95 she fell in love with the tribe\nMove back to 92 I was just like you\nPlease don't get confused by the ice and jewels\nI'm like any other guy that buy ice to stay cool\nLike any other nigga that claim they hate school\nAnd think yeah Free's banging, but she no Racheal\n(chours)\nWe ball till we fall\nHit the mall\nAfter we hit don't call\nFill your lives\nWith nothing, but lies\nAnd I would like to apoligize\n(repeat twice)\nYou can't stand right here\nAnd tell me everything is going to be all right\nCuz until the day a man starts to stand up I'm going have to improvise\nverse2\nWas it something I did wrong yeah I know I'm wrong\nShe's at home alone and I'm always gone\nHate it when she's mad, but more when she's passive\nNow she on the internet looking for classes\nOut of state though man that hurt yo\nBut I got work though and I'm at work yo\nAnd she don't call alot, but when she do she pouring out her heart\nYou never listen to me then the call drop mmmmm\nAnd I promised her everything\nTold her when I get a deal I'll get her a wedding ring\nBut when I got my deal I was back in the ring\nFighting my urges\nStrip club flurges\nNever had money so I felt like a virgin\nAnd I'm trying to break the banks cherry\nTrying she can I afford a Carnary\nWith a Ferry and a dinner date with Halle Berry\nWent from 50gs to 50 hundred in a week\nNow I'm trying to call\nOne ring Two ring Seven ring Eight ring\nHer mother pick up the phone\nLike she at school and she don't stay here no more\nI guess it's more good women than men percentage wise\nSo her chance of having a husband in minimize\nI guess that's why she say she ain't into guys\nFocus on school full time to improvise\nchours\n", "title": "Improvise lyrics"}, {"lyrics": "this is it Rod.\nim n Diplomats now.\nbut im n Diplomats South.\nyo, ya.\nYayo.\ni sale that snow.\ni be the kidd.\ni aint no play.\ntryin to get paid.\nall girls want to lay.\nnext to my dick.\nn they mouf n shit.\nmy kidds they play.\nwhen i skeat, girl.\ni beat it good.\nyo-yo u know i swang that  good wood.\nthey see as King of the C-Town.\nall day this where i be now.\ni say fuck school.\nfuck school, fuck rules.\nfuck rules, fuck u.\nfuck u, fuck me.\ncutt u, u cutt me.\ndo me, do u.\nwe make a kidd.\nkidds r pie pie.\nteens get blowed high.\ngrown folks r feans.\nthey snort polk n beans.\ni got that push it, push it.\ncome head n got it.\ncause i push it, cook it.\ncook it, push it.\nniggas know that i look it.\nthe part of a dealer.\ncoke saler.\nyayo man.\nhey girl.\nur man.\nthis man has 90grand.\nim no cowered.\nyo nower.\nmy gun goes bang.\nu hit, got lit.\nur block put up 5000 dollas.\n", "title": "Jay-t's Intro ( Push It Beat ) lyrics"}, {"album": "Album: College Dropout", "lyrics": "Yo, We at war\nWe at war with terrorism, racism but most of all we at war with ourselves\n(Jesus Walks)\nGod show me the way because the Devil trying to break me down\n(Jesus Walks with me) with me with me with me [fades]\nYou know what the Midwest is?\nYoung & Restless\nWhere restless Niggaz might snatch your necklace\nAnd next these Niggaz might jack your Lexus\nSomebody tell these Niggaz who Kanye West is\nI walk through the valley of Chi where death is\nTop floor the view alone will leave you breathless Uhhhh!\nTry to catch it Uhhhh! It's kinda hard hard\nGetting choked by the detectives yeah yeah now check the method\nThey be asking us questions, harass and arrest us\nSaying \"we eat pieces of shit like you for breakfast\"\nHuh? Yall eat pieces of shit? What's the basis?\nWe ain't going nowhere but got suits and cases\nA trunk full of coke rental car from Avis\nMy momma used to say only Jesus can save us\nWell momma I know I act a fool\nBut I'll be gone til November I got packs to move I Hope\n[HOOK x2]\n(Jesus Walks)\nGod show me the way because the Devil trying to break me down\n(Jesus Walks with me)\nThe only thing that I pray is that me feet don't fail me now\n(Jesus Walks)\nAnd I don't think there is nothing I can do now to right my wrongs\n(Jesus Walks with me)\nI want to talk to God but I'm afraid because we ain't spoke in so long\nTo the hustlas, killers, murderers, drug dealers even the strippers\nTo the victims of Welfare for we living in hell here hell yeah\nNow hear ye hear ye want to see Thee more clearly\nI know he hear me when my feet get weary\nCuz we're the almost nearly extinct\nWe rappers are role models we rap we don't think\nI ain't here to argue about his facial features\nOr here to convert atheists into believers\nI'm just trying to say the way school need teachers\nThe way Kathie Lee needed Regis that's the way yall need Jesus\nSo here go my single dog radio needs this\nThey say you can rap about anything except for Jesus\nThat means guns, sex, lies, video tapes\nBut if I talk about God my record won't get played Huh?\nWell let this take away from my spins\nWhich will probably take away from my ends\nThen I hope this take away from my sins\nAnd bring the day that I'm dreaming about\nNext time I'm in the club everybody screaming out\n(Jesus Walks)\nGod show me the way because the devil trying to break me down\n(Jesus Walks)\nThe only thing that I pray is that me feet don't fail me now\n", "title": "Jesus Walks lyrics"}, {"album": "Album: Late Registration", "lyrics": "(feat. Ma$e)\nReady!, Huh.\nYeah! um\nJesus, Jesus talk to me\nJesus, Jesus talk with me\nJesus, Jesus,\nJesus, Jesus,\nCome on!\n(Jesus Walks)\nGod show me the way now the devil can't break me down\n(Jesus walk with me)\n[Kanye]\nBetween the girls and the jewelry\nThe devil trying to lure me\nAnd view of me\n(Jesus walks with me)\nMy pastor shaking his head\nhe ain't sure of me\nBut surely\n(Jesus walks with me)\nThen he ask\ndo you say your prayers at least 2 a week?\nI ain't talking to God I know what I've been doing G.\nDo you know how I be embarrassed?\nmy prez sound like Ben Stiller on Meet the Parents\nand I ain't good with that ?give us our day?,\nthis ladies just trying to give us our free\nI'm trying to give us, us pay,\nnow you know how them strippers was,\nWe was all ghetto-fabulous all at the rooms at the Cyberus,\nfrom this Jacuzzi wild can you cleanse us?\nCan you please unfog my Cardierre lenses?\nGod sends signs sometimes only in glimpses for me I almost died\nfalling asleep in them Benzes\nTheirs something about this beat that get me tranquilized\nand when I play it at my shows I feel sanctified\nand HE gives me direction when I can't decide\nHe is alive!, how can you tell me he ain't when I said\n(Jesus Walks)\nGod show me the way now the devil can't break me down\n(Jesus Walks)\nThe only thing I pray is that my feet don't fail me now\n(Jesus Walks)\nAnd Now I think there's something I can say now\nthat will right my wrongs\n(Jesus Walks)\nI finally talked to God and I ain't afraid cause his love is so strong\n[Ma$e]\nBefore you take me name, take my fame,\nWhy you had to take my shame, take my flaws, take my blame\nFeel my dirt, conceal my hurt, See my bruise,\nand this you walk in my shoes\nYou weren't there when I was in deep thought.\nWhen I had two choice, kill him or either leave New York\nBut I'm a truth teller and that's why I say what I'm sayin\nAnd the only thing the radio playin is cause you be payin\nIt ain't about who really hot no more\nBeats would knock no more\nso who cares who flock no more\nI realize that most labels pay you for lies\nAnd all that blood do is gain disguise\nThat you're favorite artist shhhh\nI know you hear that huh you wanna fear that what\nYour worst dream is that you was gonna hear that\nCon the rap this like John the Baptist\nprepare the way for what I came to say today\nThey deceived us, had us thinking Jesus really didn't need us\nWhen he loved up all you\nHe loved them boys in hallway up in Broadway\neven those who meet him for dope every 4 days\nTo the strippers in broad day up in Norway\nTo the Detroit player Gators in Moreys\nWith me its not just bars and music I walk with God\nI have the scares to prove it,ugh\n(Jesus Walks)\nGod show me the way now the devil can't break me down\n(Jesus Walks)\nThe only thing that I pray is that my feet don't fail me now\n(Jesus Walks)\nEverybody out there just lift your hands\nright now and say this with me:\n?Father I thank you, for forgiving me, for everything I ever done,\nfor Jesus walking with me, for dying for me, raising for me,\nand all my sins have been forgiven, I'm a changed man,\nI'm healed I'm delivered,I'm rich and It's all because of him?\nNow Walk with me, Walk with me, Walk Walk Walk with me\nWalk with me\n", "title": "Jesus Walks (Remix) lyrics"}, {"lyrics": "(feat. Ol' Dirty Bastard)\n[Intro: ODB (K. West)]\nOHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!! {*continues until chorus comes in*}\nYo this is Dirt McGirt, I'm chillin' wit Kanye West\nHe's killin' y'all niggaz on the beats\nHe's killin' y'all niggaz on the tracks\n(Where ya plaques at dog?)\nThe game is officially over!\nGo kill yaself!\n[Chorus: ODB (K. West)]\nNow take that equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore?\nGuess not mothafucka, it's The Roc mothafucka!\n[Kanye West]\nKeep the Receipt mothafuckas!\nNow y'all gon' stop talkin' that shit that you talkin'\nYour broke-ass mamma couldn't afford that abortion\nNow tell me how the Hell so gon' afford that coffin?\nNow I done sat back and seen it all too often\nThe backbone of this like Marino to the Dolphins\nMost hits out the shot since Sosa and Andre Dawson\nMy niggaz had Pro Tools, I had no tools\nKaraoke machine, fuck it I'm old school\nOnly difference is my tracks drove niggaz postal\nSo I drove costal while they stay local\nHow I can't rhyme when my freestyles'll roast you?\nSit down I'll coach you while we style in posters\nDog, niggaz had a chance to sign me, dropped the ball\nI'll see you at the awards.. HUMPH!\nNow after all that it took\nI made it to The Roc, I'm guess I ain't as dumb as you look\n[Chorus x2]\n[Kanye West]\nNow.. I showed you how to do this, dog\nPut a few beats on the tape, I saved this one for myself\nI heard you nigga's tapes, need a little bit of help\nBut I'm rappin' and I can't do nothin' for ya, man\nS.G'll hop this, 40 grand if you ain't fam\nI mean, if you ain't Hov', if you ain't Cam'\nDamn, I know you say he's killin' hisself\nHe got a little bitty deal now he feelin' hisself\nYup, just cuz I played beats and act hospitable\nDon't mean I can't get you changed to hospital you\nI'm from a raw family, dog, and I'll spit on you\nSo play like a kid in the garden and get little you\nWho ya hype man? I'm curious\nIt got you souped up like the cars on The Fast & Furious\nYou goin' through movin' critters, now who's laughin'?\nThe best producer that rap better than the rappers\n[Chorus x2 - last line by K. West the 2nd time]\n[Ol' Dirty Bastard (K. West)]\nAftermath still makin' them hits, nigga?\nLunatics still makin' them hits, nigga?\nSo So Def still makin' them hits, nigga?\nBad Boy still makin' them hits, nigga?\nWu-Tang still makin' them hits, nigga?\nRuff Ryders still makin' them hits, nigga?\n(Cash Money) still makin' them hits, nigga?\nDirt McGirt still makin' them hits, nigga\nYo yo the game is over, go kill yaself!\nGo kill yaself.. nigga!\nWe don't wanna hear that weak shit no more!\n", "title": "Keep The Receipt lyrics"}, {"lyrics": "[Intro: ODB (K. West)]\nOHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!! {*continues until chorus comes in*}\nYo this is Dirt McGirt, I'm chillin' wit Kanye West\nHe's killin' y'all niggaz on the beats\nHe's killin' y'all niggaz on the tracks\n(Where ya plaques at dog?)\nThe game is officially over!\nGo kill yaself!\n[Chorus: ODB (K. West)]\nNow take that equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore?\nGuess not mothafucka, it's The Roc mothafucka!\n[Kanye West]\nKeep the Receipt mothafuckas!\nNow y'all gon' stop talkin' that shit that you talkin'\nYour broke-ass mamma couldn't afford that abortion\nNow tell me how the Hell so gon' afford that coffin?\nNow I done sat back and seen it all too often\nThe backbone of this like Marino to the Dolphins\nMost hits out the shot since Sosa and Andre Dawson\nMy niggaz had Pro Tools, I had no tools\nKaraoke machine, fuck it I'm old school\nOnly difference is my tracks drove niggaz postal\nSo I drove costal while they stay local\nHow I can't rhyme when my freestyles'll roast you?\nSit down I'll coach you while we style in posters\nDog, niggaz had a chance to sign me, dropped the ball\nI'll see you at the awards.. HUMPH!\nNow after all that it took\nI made it to The Roc, I'm guess I ain't as dumb as you look\n[Chorus x2]\n[Kanye West]\nNow.. I showed you how to do this, dog\nPut a few beats on the tape, I saved this one for myself\nI heard you nigga's tapes, need a little bit of help\nBut I'm rappin' and I can't do nothin' for ya, man\nS.G'll hop this, 40 grand if you ain't fam\nI mean, if you ain't Hov', if you ain't Cam'\nDamn, I know you say he's killin' hisself\nHe got a little bitty deal now he feelin' hisself\nYup, just cuz I played beats and act hospitable\nDon't mean I can't get you changed to hospital you\nI'm from a raw family, dog, and I'll spit on you\nSo play like a kid in the garden and get little you\nWho ya hype man? I'm curious\nIt got you souped up like the cars on The Fast & Furious\nYou goin' through movin' critters, now who's laughin'?\nThe best producer that rap better than the rappers\n[Chorus x2 - last line by K. West the 2nd time]\n[Ol' Dirty Bastard (K. West)]\nAftermath still makin' them hits, nigga?\nLunatics still makin' them hits, nigga?\nSo So Def still makin' them hits, nigga?\nBad Boy still makin' them hits, nigga?\nWu-Tang still makin' them hits, nigga?\nRuff Ryders still makin' them hits, nigga?\n(Cash Money) still makin' them hits, nigga?\nDirt McGirt still makin' them hits, nigga\nYo yo the game is over, go kill yaself!\nGo kill yaself.. nigga!\nWe don't wanna hear that weak shit no more!\n", "title": "Keep The Receipt (Featuring Ol' Dirty Bastard) lyrics"}, {"lyrics": "(feat. Monica)\n{*dogs barking*}\n[Intro: Kanye West (Monica)]\nYo Monica, I know you shootin' that video in there\nAw, you just ain't gon' let me in the video, huh?\nNo no, i-it's me, Kanye West\n(It's funny how the tables turn)\nYou know, th-throw your diamonds up? Through the wire? (turn)\nYou ain't seen my video, heh? (turn, turn)\nYou know, I- like me and Missy we did this song\ntogether whatever\nUm, okay, well\n[Interlude: Kanye West]\nI can't keep knockin' and keep rockin' and keep poppin'\nI keep droppin' and keep poppin' and keep rockin'\nBut I can't keep knockin' and keep knockin'\nAnd keep poppin' and keep rockin'\nLet's get it poppin'\n[Missy Elliot {*overlaps Kanye West Interlude*]\nSo upset\nThis that hot shit\nUh huh, yeah\nNew Monica!\n[Verse 1: Kanye West]\nNow you ain't let me in the video (true)\nPlay me like Semi did Arsenio (true)\nI'm Kanye from the Chi city yo (who?)\nI'm the nigga that did the beat yo\nYou know we too old for this like Holyfield still boxin'\nYa will watch and I look back, ya still watchin'\nWhat he got that I ain't got? I got Benz\nI got rims, not 20s but I got 10s\nReal real clean, come and get your rear wheel cleaned\nShe did what with who? Man I hear things\nLike when I was doin' my dirt and she heard things\nUp worryin' while she wore her ring\nNow she got a fling and where's her ring?\nThat devious is in the purse now, feelin's in the dirt now\nSomebody buyin' the bar, quenchin' her thirst now\nSomebody bought her a dress, she in the church now\nAnd what's worse now, she ain' gotta work now\nShe cuffed an NBA player from the first round\nI grabbed her neck and made it hurt to breathe\nShe said \"Security, this jerk could leave\"\nAnd uh\n[Verse 2: Monica]\nSo do just what you want anytime that you really like\nI put a payment on my place, you be sleepin' alone tonight\nSo don't you come knockin'\n[Hook (Monica)]\nKnock knock knock, stop knocking\nDon't come knocking at my do'\n(Don't you come knockin' at, whoa)\nRing ring ring, let the phone stop\nI don't want you calling me no mo'\n[Kanye West {*overlaps chorus*}\nYo this the remix, and I'm Kon the Louis Vuitton Don\nOr you can call me Louis the XIV\nBy the way cause I dropped out of the fourteenth grade\n[Verse 3: Monica (Kanye West)]\nI used to be so gone\nYou were someone I could lean on\nMy life support system (uh huh)\nAnd I thought I couldn't breathe, ah ah\nWhen you used to leave, yep (ye) yep (ye)\nI see you put yo clean on\nBig chains, gold teeth, and yo gleam on (Roc-a-Fella chain)\nAll night wanna be gone\nWanna tell me stay home like I got a [fuckin'] ring on\nNow you say I'm not your wife, right right (you like wifey)\nSo why should I be chillin'? goodnight goodnight (oh)\nNow pack up my things for a flight (ok)\nI got a place and it's fixed up nice\nSo don't come knocking at my do' (aw man)\nI got company comin 'round fo'\nSo whoa whoa, haha, yeah\n[Hook (Kanye West)]\nI don't want you callin' me no mo'\nKnock, knock, knock, stop knocking (yeah)\nDon't come knocking at my door\n[Interlude: Kanye West]\nAnd I can't keep knockin' and keep rockin'\nLet's get it poppin' and that's stoppin'\n[Hook]\nRing ring ring, let the phone stop\nI don't want you calling me no mo'\n[Outro: Kanye West]\nWhat up really though, I see\nAnd the lot gon' be mad as hell when we go on tour\nYou see I already got GLC up outta there\nAw, we fit to blow man\nYou know we got the game on smash\nGiant monopoly, Don C\nYeah, you know I got that boogie\nAnd Jay boogie well\nYeah, what up Roc?\nYeah, it won't stop\nWell Tiffany, I'll see you\n[Outro: Monica {*overlaps Kanye West*]\nChanged my locks, took my things\nCan't come in\nChanged my locks, took my things\nCan't come in\nI don't want you calling me no mo'\n", "title": "Knock Knock (Remix) lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Intro: Jay-Z (Kanye)]\n[laughing]\nYo fuck you, Kanye, first and foremost\nFor making me do this shit. Muh'fucker\nHad to throw everybody out the motherfucking room\n'Cause they don't fucking..\n(I'd like to propose a toast)\n(I said toast motherfucker)\n[Chorus: Kanye]\nAnd I am\nAnd they ask me, they ask me, they ask me, I tell them\nRaise your glasses, your glasses, your glasses to the sky\nThis is the last call for alcohol, for the..\nSo get your ass up off the wall\n[Verse 1]\nThe all around the world Digital Underground, Pac\nThe Rudloph the red nosed reindeer of the Roc\nI take my chain, my 15 seconds of fame\nAnd come back next year with the whole fucking game\nAin't nobody expect Kanye to end up on top\nThey expected that College Dropout to drop and then flop\nThen maybe he stop savin' all the good beats for himself\nRocafella's only niggaz that help\nMy money was thinner than Sean Paul's goatee hair\nNow Jean Paul Gaultier cologne fill the air, here\nThey say he bourgie, he big-headed\nWon't you please stop talking about how my dick head is\nFlow infectious, give me 10 seconds\nI'll have a buzz bigger than insects in Texas\nIt's funny how wasn't nobody interested\n'Til the night I almost killed myself in Lexus\n[Chorus]\n[Verse 2]\nNow was Kanye the most overlooked? Yes sir\nNow is Kanye the most overbooked? Tes sir\nThough the\n", "title": "Last Call lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Chorus: Kanye West]\nI'll be late for that, baby I'll wait for that\nIf you had a taste of that, you'd probably pay for that\nI'm comin in when I feel like\nTo turn this muh'fucker up only if it feels right\nI'll be late for that, I can't wait for that\nI think I was made for that\nSo I'm comin in when I feel like\nTo turn this muh'fucker up only if it feels right\n[Kanye West]\nStop all your blood claat cryin, I was flyin\nMade it to school with barely 'nuff time to sign in\nYeah I hear the alarm, yeah I hear you mom\nYeah yeah I don't wan' be broke when I'm 31\nThey said the best classes go to the fastest\nSorry Mr. West there's no good classes, and that's what yo' ass get\nNot even electives? Not even prerequits?\nYou mean I missed my major by a couple of seconds?\nNow I'm in the shop class or the basket weavin\nWith all the rest of the muh'fuckers underachievin\nMan, this is a insult\nI went to junior high with all of them and they been slow\nIf I can catch the beat then slow down the tempo\nJust notice at the end if I'm too late for the intro\nWill I make it from the student loans to a Benz-o?\nLike old folks pissin, I guess it all (Depends), oh, oh\n... Stop you're cryin baby\n[Chorus]\n[Kanye West]\nYou know when you be late you miss all the lights\nThat's right (that's right) that's right (that's right)\nAnd when you get back she gon' start up a fight\nThat night (that night) that night\nBaby it's too late for that, lately I've been takin it slow\nTry and make it to the party 'fore the guest list close\nWith the freshest hoes, the professors know\nWe about to get real unprofessional\nLike them eskimos, what would you do for a Klondike?\nOr two dykes that look Christina Milian like\nHmmm, I'll be on time for that\nI ain't thought of no line that could rhyme with that\nYo, I'll be there in five minutes, five hours later\nI'll be there in five minutes, go 'head ride with it\nI'm so live with it, look how I did it\nBeen bullshittin but I finally arrived with it\nI know it's late and I took all year but\nYou can stop complainin cause I'm finally here, yeah\n\"I'll be late for that\" - [repeat 4X]\n", "title": "Late lyrics"}, {"album": "Album: College Dropout", "lyrics": "You keep it going man, you keep those books rolling,\nYou pick up those books your going to read\nAnd not remember and you roll man.\nYou get that a sociate degree, okay,\nThen you get your bachelors, then you get your masters\nThen you get your master's masters,\nThen you get your doctron,\nYou go man, then when everybody says quit\nYou show them those degree man, when\nEverybody says hey, your not working,\nYour not making in money,\nYou say look at my degrees and you look at my life,\nHey i'm 52, so what, hate all you want,\nBut i'm smart, i'm so smart, and i'm in school,\nAnd these guys are out here making all this\nMoney all these ways, and i'm spended mine to be smart.\nYou know why?\nBecause when i die, buddy, you know\nWhat going to keep me warm, that right, those degrees\n", "title": "Lil Jimmy Skit lyrics"}, {"album": "Album: Late Registration", "lyrics": "Yo, this sound like some movie shit right?\nGet ya popcorn, get ya condiments, you dont wanna miss nothin, ok listen\n[Verse 1]\nThey call me +Edward Scissorhands+ cuz i'm tryin to cut\nShe claim she got cramps, im gone get you to suck\nAnd you not gon use ya teeth ya hear?\nYou gon find out +What Lies Beneath+ right here\n+The Preachers Wife+ dont give head? Get a divorce man\nThe kids been callin you the headless horseman\nLike +Sleepy Hollow+ see she swallow\nSuck like ol girl got booed at +Apollo\n+13 Ghost+ use my +Hollow Mans+ for +Friday 13th+\nYou be +Ghost+, +Backdraft+ from the toast\nNiggaz who drop names is, oh so shameless\nGet a chain thats stainless, they +Almost Famous+\nMy bling got em callin me, +Lord Of The Rings+\n+The Shining+ make it hard for her to +Do The Right Thing+\nBut I dont say word, I'll never tell\nUntil you get a Kanye beat, you'll never sell\n[Chorus]\nI'm livin a movie, not livin by rules\nIt's just a movie, dont lose ya cool\n1,2 Ye comin for you, 3,4 better lock your door\n5,6, 7,8, 9,10 never sleep again\n[Verse 2]\nShits deeper, than +The Sleepers+\n+Jeeper Creep-up+ on your block and cops +Clock-us+\nTry to +Baller Block-us+, use +Absolute Power+\nYou gave him +9 1/2 Weeks+, why you tryin to +Rush Hours+ huh?\nAnd in +The Cell+ dont drop soap in the showers huh\nThey try to give me +Life+, I'm out in a hour huh\nBack on the block wit more +Juice+ than Pac\nMakin +Mo' Money+ cuz of +The, The, The, The Rock+\n[Chorus]\nI said some shit like, umm, you in my things like +Suicide Kings+\nThere's only +Three Kings+, +Me, Myself and Irene+, you know what im sayin\n", "title": "Livin\\' In A Movie lyrics"}, {"album": "Album: Freshman Adjustment", "lyrics": "I've lived\nYes I've lived a life that's full\nI've traveled each, and every highway\nWhat more, and what's more than this -\nIt go my way, Chi-Way\nThis way or the highway\nShots'll lay you off on your day off, like Friday\nThe ROC got \"-Ye\" but they ain't snortin' it\nThey just got him up the base line recordin' shit\nYeah I've been broke\nNow I'm good bitch\nI ain't no Kennedy\nBut I'm hood rich\nSo I say my way to thank you to the ghetto\nAnd everybody else, thank you very little\nI took the road less traveled, the unbeaten path\nI've been beatin', but never brokin' through the darkest past\nIt's sort of like when King spoke and said we free at last\nAin't nothin' free from that point, though\nWe needed cash\nAnd we need it fast\nWe broker than Ethiopians just tryin' to eat at last\nNow all the blacks cookin' up, they're almost white\n'Cause gettin' green makes 'em treat us treat us like we almost white\nAlmost\nI've lived\nYes I've lived a life that's full\nI've traveled each, and every highway\nWhat more, and what's more than this -\nIt go my way, Chi-Way\nThis way or the highway\nNiggaz wanna diss K\nOn they're local mix-tapes\nThere they go again, lyin' to consumers\nGet their hair cut in the little shop of rumors\nYour lil' sloppy with your cockyness ain't ya\nA little arrogant with all your compares\n'Cause as far as the Chi\nI got the most black sister beginnin' to rap\nAnd nah, I ain't mentionin' that\nY'all just talk about my dough\nHow I left Chicago\nHow I'm the only one eatin'\nShut your pie whole\nAnd wanna figure out why I'm gettin' it high though\nWhy? 'Cause you need fire, and I'm a pyro\nWhen you prepare, would you copy what I do and say?\nOnly difference between you and me, you were gay\nAhhhhh, did he get his feelin's hurt?\nNahhhh, he's got titties under his shirt\nI've lived\nYes I've lived a life that's full\nI've traveled each, and every highway\nWhat more, and what's more than this -\nIt go my way, Chi-Way\nThis way or the highway\nWhen you walk straight, niggaz tend to look at you sideways\nI say, Fuck that dog, I get my own way\nNiggaz ain't believe me 'till they see me on t.v\nAnd seen K freely, gettin' head on the freeway\nThen passin' up Freeway, just like it's a relay\nWe stay 4 stars, all better\n'Cause the couches in the rooms got, more leather\nAnd we gon' flip Carter, when we could afford better\nAnd back, before Benzes, when we could afford Jettas\nYou still dress (Ardjo), but only pay partial\nStay gettin' somethin' off lay-a-way at Marshall's\nPolo and (Carbesher's), we into them things dogg\nBack in '96 we was livin' like kings dogg\n40 cals or better, tottin' them things dogg\nSo up the turkish snake, and take them rings off\nI've lived\nYes I've lived a life that's full\nI've traveled each, and every highway\nWhat more, and what's more than this -\nI did it my way\n", "title": "My Way lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Intro:]\nYeah Grandmama\nTold you i won't let you down\nTold you i won't let this rap game change me, right?\n[Chorus:]\nWhen it comes to being truem, at least true to me\nOne thing i found,one thing i found\nOh no you'll neva let me down,\nGet up i get(down)\nGet up i get(down)\nGet up i get(down)\nGet up i get(down)\nGet up i get(down)\nGet up i get(down)\n[Jay-Z:]\nYo, yo first i snatched the street then i snatched the charts,\nFirst had they ear now i hav they're heart,\nRappers came and went,\nI've been hear from the start,\nSeen them put it together\nWatch them take it apart,\nSee the rollers roll up wit ribbons\nI see the we poe, we sold then we driven\nSo when i reload, he holds #1 position\nWhen u hot i'm hot\nAnd when your feet cold, mines is sizzelin\nIt's plain to see\nNigga's can't f*** wit me\nCuz ima be that nigga fo life\nThis is not an image\nThis is God given\nThis is hard liven\nMixed wit crystall sippin\nIt's the most consistent\nHov\nGive you the most hits you can fit inside a whole disc and\nNigga I'm home on these charts, y'all niggaz visitin\nIt's Hov tradition, Jeff Gordan of rap\nI'm back to claim pole position, holla at ya boy\n[Chorus]\n[Kanye West:]\nI get down for my grandfather who took my momma\nMade her sit that seat where white folks aint wanna us to eat\nAt the tender age of 6 she was arrested for the sit in\nWith that in my blood i was born to be different\nNow niggas can't make it to battles to chose leadership\nBut we can make it to jacobs to ****** the dealership\nThat's why i hear new music\nAnd i jus dun b feelin it\nRacism still alive they jus be consealin it\nBut i know they don't want me in the damn club\nThey even made me show I.D to get up in to sam's club\nI did dirk and went to church and get my hands scrubbed\nThat why i've baptised at least 3 or 4 times\nBut in the land where nigga's pray\nU con's are getting paid\nIt gon take a lot more than coupons to get us saved\nLike it take a lot more than do-rags to get your way\nNotin sadder than that day my girl father past away\nSo i promised to MR.rany i'm gonna marry your daughter\nAnd u know i gotta thank u for they way that she was brought up\nAnd i know that u were smiling when u see that car i bought her\nAnd u sent tears from heaven when u seen my car get balled up\nBut i can't complaint what the accident did to my left eye\nCuz look what a accident did to left eye\nFirst Aaliyah and now romeo must die\nI know a got angels watchin me from the other side\n[Chorus x2]\n[J.Ivy:]\nWe are all here for a reason on a particular path\nYou don't need a curriculum to know that you are part of the math\nCats think I'm delirious, but I'm so damn serious\nThat's why I expose my soul to the globe, the world\nI'm trying to make it better for these little boys and girls\nI'm not just another individual, my spirit is a part of this\nThat's why I get spiritual, but I get my hymns from Him\nSo it's not me, it's He that's lyrical\nI'm not a miracle, I'm a heaven-sent instrument\nMy rhythmatic regimen navigates melodic notes for your soul and your mental\nThat's why I'm instrumental\nVibrations is what I'm into\nYeah, I need my ???\nBut that is not what gives me the heart of Kunte Kinte\nI'm tryina give us ??? like ???\nI can't stop, that's why I'm hot\nDetermination, dedication, motivation\nI'm talking to you, my many inspirations\nWhen I say I can't, let yourself down\nIf I were of the highest cliff, on the highest riff\nAnd you slipped down the side and ??? your life in my grip\nI would never, ever let you down\nAnd when these words are found\nLet it been known that God's ??? has been signed with a language called love\nThat's why my breath is felt by the deaf\nAnd why my words are heard and confined to the ears of the blind\nI, too, dream in color and in rhyme\nSo I guess I'm one of a kind in a full house\nCuz whenever I open my heart, my soul, or my mouth\nA touch of God reigns out\n[Chorus]\n", "title": "Never Let Me Down lyrics"}, {"lyrics": "[John Legend]\nWe cant even sit and talk, without you arguing\nYou're the one who started it\n[Kanye West]\n[Verse 1]\nI got a girl at home but she don't cook\nI have my condoms in the stove cuz she wont look\nAnd she never ever go to the grocery store\nSo I figure its safe to pull a grocery hoe\nShe was buyin Alize out the liquor isle\nShe said ?I hope its not too ghetto?\nRocked all gold force back in style\nI kept her number on file for my girl be actin wild\nLike last week I told her take me to the mall\nBut she don't drive\nMy other girl picked me up at 3:05\nShe got a brand new car, 16\nNow the car only 1 years old, oh\nMan but the body look grown, whoa\nBefore I catch a case I better take my ass home\nWhere the problems is, arguments be +Daly+ like Carson is\nBut the problem is..\n[Chorus]\nWe can't even sit and talk no more, without you arguing\nGirl you must be out of your mind, no no no\nYou're the one who started it\n[Verse 2]\nHold up, wait a second man\nThat's that thrift store info, that's all second hand\nWhy don't you talk to the mouth of the horses ?bout my porches\nCondos in front of the golf courses\nInstead you stay up, countin every second like a fake rollie\nI'm real, so you know I move real slowly\nThe way the censorship'll go off, you know me\nI aint call you, you wanna know why?\nIm in Noha, Hon aloha, pushin jet skis so I\nCouldn't return the pages on my Motorola\nNextel, my cell, it don't work down there\nWhat happened in Cancun? Stays down there\nWhat's happenin here? Made me wish I stayed down there\nTake a seat, why you always makin a beef?\nYou know these walls too thin in this apart-a-ment\nNow everybody hearin our arguments\nBut the problem is..\n[Chorus]\n[Verse 3]\nMan, boo you know what I do\nSo don't trip when I come home after 2 or 3 or 4\nI aint messin with them girls no more\nIt's weak, the benz coupe is so sweet\nWhen I roll down the street, tears roll down her cheek\nShe said, ?You must love that car more than me\nAnd nigga I was with you before the cheese\nSo you need to work on your pri-or-ities\nIf she went with Fabolous I bet that she would be\nA-R-G-U-I-N-G and please\nI'm not actin like this cuz I'm getting spins on\nW-K-R-B in Cincinnati\nYou think I'd get my voice so deep like\nW-K-R-B in Cincinnati\nThat's how much of a fuck I give\nYou seen cribs? That's how the fuck I live\nAs far as this?\n[Chorus x2]\n", "title": "Out Of Your Mind lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Verse 1]\nSpit it till you say lil West's a little beast\nAnd make the middle west blow like the Middle East\nPEACE\nPeace, couldn't afford the S-Class\nSo I had to cop the baby mama benz JEEP\nWe'll put 50 I get this on the first take\nBut that 50'll break the bank\nBack when my ATM was crazy slim\nHad a girl nickname sprewell cuz when I tried to stop\nShe still made me spend\nBack when Avies was in, my dog crazy kid had eighty of them\nIt's time to hit the dance floor get crazy again\nAnd get that +CashMoney+ like Baby and Slim\nPull up in something tinted, so tinted she squinted\nShe said ?This car real old?; I told her it was vintage\nAnd I need to hit the health club\nAnd get a girl that's into the fitness\nTryin to get into the business, Imma make her my apprentice\nMake her open wide like she made me her dentist\nAnd let me get insiiiide\n[Chorus]\nNow I been hustling my whole life\nTryin to get this money up and I think I finally got it right\nAnd I been polly'n with this one girl that claim ?I gotta work tomorrow?\nBut tonight's the night, so poor another glass of that good stuff\nA couple more shots and I'll be doin fine\n[Verse 2]\nSpit it till you say lil West's a little beast\nAnd make the middle west blow like the Middle East\nPEACE\nPlease, what I gotta win 5 Grammy's before you finally let me play Alicia's Keys\nIf I cant bone, I get a clone, get her there, got her there, grab her hair\nShe vibin, don't stop her there, told me that she love the Roc so much\nShe drove all the way to far Rockaway, for a Rocawear\nMore populaire, cuz I abracadabra'd my Nissan\nTo a car throwin the peace sign, PEACE\nDamn that's like the same line I used in the first verse\nBut w-w-w-wait it gets worse\nI told her S-U-C-K, before we F-U-C-K\nI give a F-U-C-K if your nephew's CK\nIn a CL like U-C-K, that's how you know chickens C-L-U-C-K\nIm tryna find a crazy fe-male wit a cutee face\nI big pimp her on the the D.L. like UGK\nAnd then I told her\n[Chorus]\n", "title": "Peace lyrics"}, {"album": "Album: 808s & Heartbreak", "lyrics": "Wise men say\nWise men say\nWise men say\nThe baddest niggas out there bro\nNever figure out real love\nYou'll never figure out real love\nYou'll never figure out real love\nIts so crazy\nI got everything figured out\nBut for some reason I can never find what real love is about\nNo doubt\nEverything in the world figured out but I can never seem to find what real love is about\nDo you think I sacrificed real life\nFor all the fame of flashing lights?\nDo you think I sacrifice a real life\nFor all the fame of flashing lights?\nThere is no Gucci I can buy\nThere is no Louis Vuitton to put on\nThere is no YSL that they could sell\nTo get my heart out of this hell\nAnd my mind out of this jail\nThere is no clothes that I could buy\nThat could turn back the time\nThere is no vacation spot I could fly\nThat could bring back a piece of real life\nReal life, what does it feel like?\nI ask you tonight, I ask you tonight\nWhat does it feel like, I ask you tonight\nTo live a real life\nI just want to be a real boy\nThey always say Kanye, he keeps it real boy\nPinocchio story is, I just want to be a real boy\nPinocchio story is to be a real boy\nIts funny Pinocchio lied and that's what kept him from it\nI tell the truth and I keep running\nIts like I'm looking for something out there trying to find something\nI turn on the TV and see me and see nothing\nWhat does it feel like to live real life to be real?\nNot some facade on TV that no can really feel\nDo you really have the stamina...\nFor everybody that sees you and that say 'where's my camera?'\nFor everybody that sees you and says 'sign my autograph'\nFor everybody that sees you and says that 'you all that'\nYou all that\nI just want to be a real boy,\nPinocchio story goes, I just want to be a real boy\nPinocchio story goes...\nAnd there is no Gepetto to guide me, no one right beside me\nThe only one was behind me I cant find her no more,\nI cant find her no more I cant...\nthe only one that come out on the tour and stay, stay, stay...\nBack when I was living at home and this was all a big dream\nAnd the fame will be got caught\nAnd the day I moved to LA\nMaybe that was all my fault\nAll my fault to be a real boy\nChasing the American dream,\nChasing everything we seen\nUp on the TV screen\nAnd when I- the Benz was left\nAnd the clothes was left\nAnd the hoes was left\nYou talk the hoes to death thinkin the money that the-\nYou spent the doughs to death\nAnd tell me what-tf for a real boy\nThey say Kanye you keep it too real boy\nPerspective and Wise man say, one day you'll find your way\nThe wise man say, you'll find your way\nThe wise man say, you'll find your way\nThe wise man say\n", "title": "Pinocchio Story lyrics"}, {"lyrics": "(feat. Ludacris & Twista)\n[Chorus: Twista]\nAnd we gone stay hustling on the block until we caught\nAnd we gone stay showing off that jewelry that we bought\nAnd we gone stay heated in case it's in and out of court\n'Cause we some gangstas, I don't know what the fuck you thought\n[Verse One: Ludacris]\nSometimes I think that I gotta see a little bit of brighter days\n'Cause I confine myself to a city near you in a solid cage\nAnd you could look to the left and the right, but I'm trapped on center stage\nAnd I could rap to the beat, but I don't know how to change my wage\nI still hear a pull and I track 'em, and strack 'em, and whack 'em\nJack a nigga for the day to days and I yak 'em, attack 'em, and sack 'em\nGet a weapon and I crack his brain 'cause I'm hustler, baller, pro\nAnd it wouldn't be right for me to be around busters, and crawlers, and hoes\nBut I'm a pimp at night so talk shit and I'm gonna lift 'em up off of their toes\nWith a street sweeper regulating quarters, and ki's, and o's\nIn the two seater, Ludacris and Twista with bags of 'dro\nSmoking and choking, get 'em up and croaking\nIt's so potent, I'm hoping to keep on floating\nSoaking wet and you can bet, people I'm high\nI'm seeing lions, and tigers and bears - oh my!\nAnd I can't hide it and keep it hidden, good riddance of feeling good\nI'm weapon-concealing, stealing my neighborhood\nWould, could, and should break a nigga off\nThey'll see you later, go to the doctor, hold my balls and (cough)\nBecause the vapors and I caught the drawn, brain blown, honey I'm home\nGive me the microphone, and fools is like, \"leave me alone!\"\n[Chorus]\n[Verse Two: Twista]\nThrow it up if you get high, get blowed, get drunk\nIf you on what I'm on come on and kick it, let's ride, smoke 'dro, beat the trunk\nAll the bad ass bitches that want to party, just shake it, great players get pumped\nMe and my thugs and hustlers in the party, get money, fuck hoes, get crunk\n(Look out) Put a little bit of hash and some motherfucking purple haze\nI feel it all over my body, adrenaline with the Bacardi\ngot me up and then ripping shit in a rage\nIn the netti confetti with a belly, gucci\nTimberland stepping on the pedal up in the 'lac truck\nWant to get me for the wood\nBetter get the whole motherfucking 'hood to come and give you some back up\nWe can get into it and if you want to do it\nI'm leaking the fluids out of the bodies that want to come at this\nIf they ever got some blood for fucking with thugs that I bury\nMy adversaries better not want none of Twis'\nRepresent for the city, anybody that different with me\ngot into thinking its a game\nAnd whether you in my city and I talk shit\nI'm going to kill him, especially if he say my name\nI've been known to handle my business\nOr I'm gonna stick him up for the scrilla, from K-Tilla, smoking on a fat pilla\nMurder haters that I'm full of\nNiggaz claiming they wanna bring a baretta they'll be killas\nBalling out so hard the size of my rims grows to a hellafied sight-scene\nWhen the dough become no bigger, I'm gonna still drop that 2003\n(Throw it up if you...)\n[Chorus] - 2X\n", "title": "Poppin' Tags (Remix) lyrics"}, {"lyrics": "[Chorus: Twista]\nAnd we gone stay hustling on the block until we caught\nAnd we gone stay showing off that jewelry that we bought\nAnd we gone stay heated in case it's in and out of court\n'Cause we some gangstas, I don't know what the fuck you thought\n[Verse One: Ludacris]\nSometimes I think that I gotta see a little bit of brighter days\n'Cause I confine myself to a city near you in a solid cage\nAnd you could look to the left and the right, but I'm trapped on center stage\nAnd I could rap to the beat, but I don't know how to change my wage\nI still hear a pull and I track 'em, and strack 'em, and whack 'em\nJack a nigga for the day to days and I yak 'em, attack 'em, and sack 'em\nGet a weapon and I crack his brain 'cause I'm hustler, baller, pro\nAnd it wouldn't be right for me to be around busters, and crawlers, and hoes\nBut I'm a pimp at night so talk shit and I'm gonna lift 'em up off of their toes\nWith a street sweeper regulating quarters, and ki's, and o's\nIn the two seater, Ludacris and Twista with bags of 'dro\nSmoking and choking, get 'em up and croaking\nIt's so potent, I'm hoping to keep on floating\nSoaking wet and you can bet, people I'm high\nI'm seeing lions, and tigers and bears - oh my!\nAnd I can't hide it and keep it hidden, good riddance of feeling good\nI'm weapon-concealing, stealing my neighborhood\nWould, could, and should break a nigga off\nThey'll see you later, go to the doctor, hold my balls and (cough)\nBecause the vapors and I caught the drawn, brain blown, honey I'm home\nGive me the microphone, and fools is like, \"leave me alone!\"\n[Chorus]\n[Verse Two: Twista]\nThrow it up if you get high, get blowed, get drunk\nIf you on what I'm on come on and kick it, let's ride, smoke 'dro, beat the trunk\nAll the bad ass bitches that want to party, just shake it, great players get pumped\nMe and my thugs and hustlers in the party, get money, fuck hoes, get crunk\n(Look out) Put a little bit of hash and some motherfucking purple haze\nI feel it all over my body, adrenaline with the Bacardi\ngot me up and then ripping shit in a rage\nIn the netti confetti with a belly, gucci\nTimberland stepping on the pedal up in the 'lac truck\nWant to get me for the wood\nBetter get the whole motherfucking 'hood to come and give you some back up\nWe can get into it and if you want to do it\nI'm leaking the fluids out of the bodies that want to come at this\nIf they ever got some blood for fucking with thugs that I bury\nMy adversaries better not want none of Twis'\nRepresent for the city, anybody that different with me\ngot into thinking its a game\nAnd whether you in my city and I talk shit\nI'm going to kill him, especially if he say my name\nI've been known to handle my business\nOr I'm gonna stick him up for the scrilla, from K-Tilla, smoking on a fat pilla\nMurder haters that I'm full of\nNiggaz claiming they wanna bring a baretta they'll be killas\nBalling out so hard the size of my rims grows to a hellafied sight-scene\nWhen the dough become no bigger, I'm gonna still drop that 2003\n(Throw it up if you...)\n[Chorus] - 2X\n", "title": "Poppin' Tags (Remix) (Featuring Ludacris & Twista) lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Verse 1]\n[Kanye West]\nI know it's past visiting hours\nBut can I please give her these flowers\nThe doctor dont wanna take procedures\nHe claimed my heart can't take the anastesia\nIt'll send her body into a seizure\nThe little thing by the hospital bed, it'll stop beeping,\nHey chick, im at a lost for words\nWhat do you say at this time?\nRemember when I was nine?\nTell her everything gone be fine?\nBut i'd be lying, the family crying\nThey want her to live, and she trying\nI'm argueing like what kind of doctor can we fly in\nYou know the best medicine go to people thats paid,\nIf Magic Johnson got a cure for A.I.D.'s\nAnd all the broke muthafuckers past away\nYou tellin me if my grandma was in the N.B.A.\nRight now she'd be ok?\nBut since she was just a secretary\nWorking for the church\nFor thirty five years\nThings sposed to stop right here\nMy grandfather tryin to pull it together, he strong,\nThats where I get my confidence from\nI asked the nurse \"did you do the research?\"\nShe ask me, \"can you sign some t-shirts?\"\nBitch is you smokin reefer?\nYou dont see that we hurt\nBut still...\n[Chorus]\n...I smile\nThe roses come to see me\nAnd I can't wait for a sunny day\n(Im seeing it through your eyes)\nCan't wait for the clouds to break\n[Verse 2]\n[Kanye West]\nThey outside of the emergancy room, room\nYou can feel my heart beat, beat, beat\nIf she gone pull through\nWe gone find out soon\nBut right now she sleep, sleep, sleep\nMy mama say, they say she could pass away any day\nHey chick what these doctors know anyway\nLet me see the X-rays\nI ain't no expert, I'm just hurt\nCousin Kim took off for work\nPlus my Aunt Shirley, Aunt Beverly, Aunt Claire and Aunt Jean\nSo many Aunties, we could have an Auntie team\nFeel like Amerie \"Its this one thing\"\nWhen they said that she made it\nYou see the eyes gleam\nI think we at an all time high\nTo get there we run, we fly, we drive\nCoz with my family we know where home is\nSo instead of sending flowers\nWe the roses...\n[Chorus]\nI smile\nThe roses come to see me\nAnd I can't wait for a sunny day\n(Im seeing it through your eyes)\nCan't wait for the clouds to break\nWho brings the sunshine?\nOhhhhh I smile\nThe roses come to see me\nAnd I can't wait for a sunny day\n(Im seeing it through your eyes)\nCan't wait for the clouds to breaK\n", "title": "Roses lyrics"}, {"album": "Album: College Dropout", "lyrics": "You keep it going man, you keep those books rolling,\nYou pick up those books your going to read\nAnd not remember and you roll man.\nYou get that a sociate degree, okay,\nThen you get your bachelors, then you get your masters\nThen you get your master's masters,\nThen you get your doctron,\nYou go man, then when everybody says quit\nYou show them those degree man, when\nEverybody says hey, your not working,\nYour not making in money,\nYou say look at my degrees and you look at my life,\nYeah i'm 52, so what, hate all you want,\nBut i'm smart, i'm so smart, and i'm in school,\nAnd these guys are out here making\nMoney all these ways, and i'm spended mine to be smart.\nYou know why?\nBecause when i die, buddy, you know\nWhat going to keep me warm, that right, those degrees\n", "title": "School Spirit lyrics"}, {"lyrics": "chorus (Syleena Johnson):\na way that all, all falls down\ni tell you oh, it all falls down\na way that all, all falls down\ni tell you oh, it all falls down\nKanye West:\nman i promise shes so self conscious she has no idea what shes doing in college that major that she majored in dont make no money but she wont drop out her parents will look at her funny. Now tell me that aint insecurrr. The concept of school seems so securrr. Sophmore three yurrs aint picked a carurr. She like fuck it ill just stay down hurr and do hair cause thats enough money to buy her a few pairs of airs cause her baby daddy dont really care. Shes so precious with the peer pressure,couldnt afford a car so she named her daughter alexus. She had hair so long that it looked like weave then she cut it all off now she look like eve. And she be dealing with some issues that you cant believe single black female addicted to retail.and well\nchorus:\nkanye west:\nman i promise im so self conscious thats why you always see me with at least one of my watches rollies and poshers done drove me crazy i cant even pronounce nothing pass that ver-say-see. Then i spent 400 bucks on this just to be like nigga you aint up on this. And i cant even go to the grocery store without some ones thats clean and a shirt with a team it seems we living the american dream. But people highest up got the lowest self esteem. The prettiest people do the ugliest things for the road to riches and diamond rings. We shine because they hate us,floss cause they degrade us,we trying to buy back our 40 acres. And for that paper look how low we'll stoop even if you in a benz you still a nigga in a coupe.\nchorus:\nKanye West:\ni say fuck the police thats how i treat em. We buy our way out of jail but we cant buy freedom. We'll buy alot of clothes when we dont really need em things we buy to cover up whats inside. Cause they make us hate ourself and love they wealth thats why shortys hollering \"where the ballas at\". Drug dealer buy jordans crackhead buy crack and a white man get paid off of all of that. But i aint even gonna act holyer than thou just fuck it, i went to jacob with 25 thou before i had a house and i'd do it again cause i wanna be on 106th and park pushing a benz. I wanna act ballerific like its all terrific i got a couple past due bills wont get specific. Got a problem with spendin before i get it. We all self conscious im just the first to admit it.\nchorus:\ntill fades out\n", "title": "Self-conscious lyrics"}, {"album": "Album: Late Registration", "lyrics": "I brought you brothers here to start our own fraternity\nBroke Phi Broke, we ain't got it.\nBroke Phi Broke (we ain't got it)\nNo, we have no money\nWe are sharin' jeans.\nIf I go outside, I got the only clothing on.\nHow many cars do we own? (None!)\nHow many cars do we own? (None, sir!)\nShould we let our woman go and be with the cat in the car?\nYes, we will.\nWhy? Because we can't afford gas. Say it with me!\n(We can't afford no gas!)\nSay it!\n(We can't afford no gas!)\nSo we ain't drivin'!\n", "title": "Skit #4 lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Luther Vandross]\nAre you gonna be\nSay that you're gonna be\n[Jamie Foxx]\nOh Oh Oh Oh Oh...\n[Jamie Foxx - Chorus]\nShe said she wants some Marvin Gaye, some Luther Vandross, a little Anita, will definitely set this party off right\n(Are u gonna be, are u gonna be, are u gonna be, are you gonna be are you gonna be, well well well well well)\nShe said she want some Ready for the World, some New Edition, some Minnie Ripperton, and definitely set this party off right\n(Are u gonna be, are u gonna be, are u gonna be, are you gonna be are you gonna be, well well well well well)\n[Kanye West]\nI told her to drive over in your new whip\nBring some friends you cool with\nImma bring da cool whip\nThen I want you to strip\nSee you is my new chick\nSo we get our grind on\nShe be grabbin, callin me Biggie like Shine home\nMan I swear she fine homes\nWhy she always lying though\nTellin me them diamonds when she know they rhinestones\nShe got a light skinned friend look like Michael Jackson\nGot a dark skinned friend look like Michael Jackson\nI play 'Ready for the World' - she was ready for some action\nMy dawg said you aint no freak, so you got to prove my man wrong\nImma play this Vandross\nYou gon' take your pants off\nImma play this Gladys Knight\nMe and you gon' get right\n[Chorus X2]\n[Twista]\nGot you lookin at the gliss at my hands and wrists\nWhile i'm layin back smokin on my canibus\nWhen it come to rockin the rythm like Marvin and Luther\nI can tell you aint no messin with Kan-man and Twist\nFrom the Chi and I be\nSippin Hennessy\nPlay some R&B\nTryina smoke a B\nLookin properly\nFeelin on a G?\nAnd always (Well Well Well Well Well)\nCome with me and sip on some Evelyn Champagne\nYou aint know Twista can work it like the Whispers\nHit the stop light, get into some Isaac\nThe rims still moving so I'm bumping a little spinners\nWhile I'm\nSmokin on a B\nDippin through the streets\nBumpin R&B\nAnd I got to leave\nsomething to the 23's?\nAnd I do it (well well well well well)\nWhen my earth and the wind smoke a fire\nLet me when get your sheets wet listening to Keith Sweat\nPut you in a daze for maze\nFullfilling our every temptation slow jamming having deep sex\nYou ready for the world girl\nCome on over make me touch you all over your body baby don't say no to me\nAn every moment you controllin' me I'm lovin the way you be holding me when I be listening to Jodeci\nAnd when I come over and bend your ass\nYou be bumpin Teddy Pendergrass\nI'da hit it from the back to the melody to roll it slow\nNow I gotta go up in it fast, but imma finish last\nNo matter how much of a thug you see\nI still spit it like it's R&B, so to the club with me\nAnd with some Luther come on and hope you finna and stilla be in love with me\n[chorus X2]\n[Twista]\nBaby drop another slow jam\nAnd all us lovers need hold hands\nAnd if you aint got no man hop up on my brohem\nI keep it pimpin like an old man\nYou gots to roll with the plan\nCuz after that then I\nTake it to the dome\nThen I got to bone\nStay up in the zone\nGot to get you home\nGotta run up on\nAnd I do it (well well well well well)\nBaby drop another slow jam\nAnd all us lovers need hold hands\nAnd if you aint got no man hop up on my brohem\nI keep it pimpin like an old man\nYou gots to roll with the plan\nCuz after that then I\nTake you to my home\nAnd we could get it on\nDisconnect the phone\nJust to get you goin'\nTryina make you moan\nAnd I do it (well well well well well)\n", "title": "Slow Jamz lyrics"}, {"lyrics": "f/ Jamie Foxx, Twista, Aisha Taylor, Luther Vandross\n* send corrections to the typist\n[Intro: Luther (Jamie Foxx)]\nAre you gonna be? Say that you're gonna be\nOooo, oooo, oooo, oooo, oooooo\n[Chorus: Jamie Foxx (Luther)]\nShe said she want some Marvin Gaye, some Luther Vandross\nA little Anita will definitely set this party off right\n(are you gonna be, are you gonna be, are you gonna be\nare you gonna be, are you gonna be, well well well well)\nShe said she want some Ready For The World, some New Edition\nSome Minnie Ripperton will definitely set this party off right\n(are you gonna be, are you gonna be, are you gonna be\nare you gonna be, are you gonna be, well well well well)\n[Verse 1: Kanye West]\n(*talking*)\nIt definitely will\nYou know what I told her\n(*rapping)\nI told her to drive over in yo new whip, bring some friends you cool wit\nI'mma bring the cool whip, then I want you to strip\nSee you is my new chick, so we get our grind on\nShe be grabbin me, callin me +Biggie+ like +Shyne+ home\nMan I swear she fine homes, why she always lyin though?\nTellin me them diamonds, when she know they rhinestones\nShe got a light-skinned friend look like Michael Jackson\nGot a dark-skinned friend look like Michael Jackson\nI played 'ready for the world', she was ready for some action\nMy dawg said you ain't no freak , so you bout to prove my man wrong\nI'mma lay this Vandross, you gon take yo pants off\nI'mma play this Gladys Knight, me and you gon get right\nRepeat Chorus\n[Bridge: Jamie Foxx]\nSmokey Robinson\nSmokey Robinson\nFreddie Jackson\nEverything, everything (Well well well well)\nSmokey Robinson\nAshford & Simpson (Are you gonna be)\nSet the party, really set the party off right\n(are you gonna be, are you gonna be, are you gonna be\nare you gonna be, are you gonna be)\nYes it will, yes it will (Well well well well)\nAl Green, OH!\nAl Green, OHHHHH YEAH!!!\nOOOOOOOOOOOOOO!!!\nWhatcha know about the Isley Brothers?\n[*Aisha Taylor talking over ad-libs*]\nNow Kanye, I know I told you to slow it down\nIt's good, it's all good, it's beautiful\nBut now I need you to do it faster baby\ncan you please - do it faster, do it faster\n[*Kanye talking*]\nDamn baby, I can't do it that fast but I know somebody who can, Twista!\n[Verse 2: Twista]\nWhen I catch you looking at the glist on my hands and wrist\nWhile I'm layin' back smoking on my cannabis\nWhen it come to rockin the rhythm like Marvin and Luther\nI can tell you when I'm messin wit Kan man and Twist\nIn the Chi and I be sippin hennessey - play some R&B\nWhile I smoke a b - you can preferably find that I'm a G\nAnd all this (well well well well)\nCome wit me and sip on some Evelyn Champagne\nYou ain't know Twista could work it like the Whispers?\nHit the stop light, move it to some Isaac\nHis rims still movin so I bump a lil' Spinners\nWhile I'm smoking on a b - dippin through the streets\nBumpin R&B - and I got the leaf - on the 23's\nAnd I do it (well well well well)\nWit my Earth in the Wind smoking Fire\nLet me get ya sheets wet listenin to Keith Sweat\nPut you in a daze wit Maze\nFulfilling her wit every temptation, slow jam, and havin deep sex\nYou ready for the world girl, baby come on go wit me\nI touch you all over your body baby don't say no to me\nAnd every moment controlling me\nI love the way you be holdin me when I be listenin to Jodeci\nAnd when I come over and bend ya ass, you be bumpin Teddy Pendergrass\nI done hit it from the back, to the melody and rode it slow\nNow I got to go up in it fast, but I'mma finish last\nNo matter how much of a thug you see\nI still spit it like it's R&B, come to the club wit me\nAnd when some Luther come on I hope you feelin me\nand still will be in love wit me\nRepeat Chorus\nBridge 2: Jamie Foxx ad-libs (w/ female singer)\nRepeat Chorus\n", "title": "Slow Jamz (New Version) lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Hook: GLC]\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\n[Verse 1: Kanye West]\nMan, man, man\nIf my manager insults me again I will be assaulting him\nAfter I fuck the manager up then I'm gonna shorten the register up\nLet's go back, back to the Gap\nLook at my check, wasn't no scratch\nSo if I stole, wasn't my fault\nYeah I stole, never got caught\nThey take me to the back and pat me\nAskin' me about some khakis\nBut let some black people walk in\nI bet they show off their token blackie\nOh now they love Kanye, let's put him all in the front of the store\nSaw him on break next to the 'No Smoking' sign with a blunt and a Marl'\nTakin' my hits, writin' my hits\nWritin' my rhymes, playin' my mind\nThis fuckin' job can't help him\nSo I quit, y'all welcome\nY'all don't know my struggle\nY'all can't match my hustle\nYou can't catch my hustle\nYou can't fathom my love dude\nLock yourself in a room doin' five beats a day for three summers\nThat's a different world like three summers\nI deserve to do these numbers\nThe kid that made that deserves that Mayback\nSo many records in my basement\nI'm just waitin' on my spaceship, blaow\n[Hook: GLC]\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\n[Verse 2: Consequence]\nMan, I'm talkin' way past the sky\nLet's go, yeah\nAnd I didn't even try to work a job\nRepresent the mob\nAt the same time thirsty on the grind\nChi state of mind\nLost my momma, lost my mind\n+My life, my love+ that's not mine\nWhy you ain't signed?\nWasn't my time\nLeave me alone, work for y'all\nHalf of it's yours, half of it's mine\nOnly one to ball\nNever one to fall\nGotta get mine\nGotta take mine\nGot a tech nine\nReach my prime\nGotta make these haters respect mine\nIn the mall 'til 12 when my schedule wore headset nine\nPuttin' known ass on shelves\nWaitin' paitently I ask myself\nQhere I wanna go, where I wanna be\nLife is much more than runnin' in the streets\nHolla at 'ye, hit me with the beat\nPut me on my feet\nSound so sweet\nYes I'm the same ol' G, same goatee\nStayin' low key, nope\nHoller at God \"Man why'd you had to take my folks?\"\nHope to see Freddy G., Yusef G\nLove my G, Rolly G\nPolice watch me smoke my weed, count my G's\nGot a lot of people countin' on me\nAnd I'm just tryin' to find my peace\nShould of finished school like my niece\nThen I wouldn't finally wouldn't use my piece, blaow\nAw man, all this pressure\n[Hook: GLC]\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\n[Verse 3: Consequence]\nI remember havin' to take the dollar cab\nComin' home real late at night\nStandin' on my feet all damn day\nTryin' to make this thing right\nAnd havin' one of my co-workers say \"Yo you look just like\nThis kid I seen in the old Busta Rhymes video the other night\"\nWell easy come, easy go\nHow that sayin' goes\nNo more broad service, cars, and them TV shows\nI all had that snatched from me\nAnd all the faculties all turn their back on me\nAnd didn't wanna hear a rap from me\nSo naturally actually had to face things factually\nHad to be a catastrophe with the fridgest starin' back at me\nCuz nothing's there, nothing's fair\nI don't wanna ever go back there\nSo I won't be takin' no days off 'til my spaceship takes off\n[Hook: GLC]\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\nI've been workin' this graveshift and I ain't made shit\nI wish I could buy me a spaceship and fly past the sky\n[Outro: GLC]\nI wanna fly, I wanna fly\nI said I want my chariot to pick me up\nAnd take me brother for a ride\n", "title": "Spaceship lyrics"}, {"album": "Album: I'm Good", "lyrics": "f/ Consequence\n[Consequence]\nGood morning America, good morning to Erica\nWho gave me good head while watching good morning America\nAnd good day New York, have a good day in court\nMy niggaz drive around the hood looking for good ye' to snort\nI never liked the goodbyes, always caught a good vibe\nAlways had a good time, could always spot a good guy\nFrom a good guy, look alive, look alive, look or try\nYou know that old saying what they say about good guys\nI bet that's why I went bad, needed all my chips bad\nFiends needed it bad, started hittin liq' bad\nHad to get that work off before that shit went bad\nIf not, it gets bad, and things will only get bad\nSo now I'm getting bad skin, and I got that badge and\nTellin me them bastards, don't catch a bad break\nCaught a bad rate on whip with bad brakes\nI'm caught up in these bad ways havin a bad day\nSo now the game's ugly, and my pain's ugly\nAnd my chain's ugly, things became ugly, cuz I'm ugly ducklin\nGot a stain and its musty, wakin up looking crusty\nAnd miss thang who's ugly is sayin to me ?don't touch me?\nI went from pretty willie to pretty silly\nBut I'm still pretty gully so you thins will still get pretty ugly\nAnd this is for the hoods, the crabs, the junkies\nWe showin you the good, the bad, the ugly\nChorus 1: [Kanye West]\nWe showin you the good, the bad, the ugly\nB.I.G. said get ya money ain't no telling they gon love me\nWe showin you the good, the bad, the ugly\nWhen your money get funny and them days ain't sunny\nWe showin you the good, the bad, the ugly\nNiggaz give pounds and hug me, tho they really wanna slug me\nWe showin you the good, the bad, the ugly\nAnd this for the hood, you got to love me\n[Kanye West]\nGood morning to ummm, I don't remember your name\nBut I remember the brain, here go a fare for the train and\nGood morning to Chi-Town, where my niggaz ride down\nAnd bust clowns, and look for some bustdowns to bust down\nAnd she ain't got a car she on the bus now\nBut her gear is bangin, she one of us now\nI wanted badly to bone cuz she was bad to the bone\nShe from a batter home, she mad when she at home\nSo I gave her my number to beep off, she wanted to take a week off\nBustin scary movie nuts, I had to get the freak off\nThe new Tom Cruise, took the Moulan Rouge on a too long cruise\nShe said ?I ain't bonin you with them two long shoes?\nAnd I get bougie in a grape poupon mood\nSo I'm gon act cheap in a coupon mood\nShe said ?Ye' you don't love me??\nI told her that's the good, the bad, the ugly\nChorus 2:\nWe showin you the good, the bad, the ugly\nB.I.G. said get ya money ain't no telling they gon love me\nWe showin you the good, the bad, the ugly\nAnd this for the hood, you got to love me\n[Consequence]\nGood morning to Queens, the north side of my scene\nAnd when it comes down to it, I'm a ride for my team\nSee it's a beautiful life, but the bills will make it ugly\nAnd the beauty of life, is when you're forced to make it ugly\nHad a beautiful night, until a storm done made it ugly\nAnd a beautiful wife, now we divorcing and its ugly\nNow my mind state is ugly, my blind dates are ugly\nI'm ready to turn it up in the streets and make it ugly\nUsed to sit in Mr. Uglies with these chickens that were ugly\nAnd these bitches used to bug me to the point it made me ugly\nSay things that were ugly in regards to their tummies\nBut I took it all back, cuz God don't like ugly\nNow I'm curbin my bad words, they say that the bad burn\nI left it on bad terms, with a chic with a bad perm\nWhose case took a bad turn, and face caught a bad burn\nAnd took the news bad when they said she had bad germs\nThe bad thing about it, the bitch was bad and bout it\nBut the pussy smelled bad, so I had to get up out it\nSo now we got bad blood, her son is a bad blood\nBut it happens in the hood when you inherit that bad blood\nAnd once it get bad, it be bad for good\nTHAT'S BAD MEANING BAD NOT BAD MEANING GOOD\nBut I greet it as good, when you leave with the good\nIts all good in the hood, got called good cuz I'm good\nNow I'm havin some good nights, livin this good life\nGot me a good girl that I'm gon make me a good wife\nSo I'm, good to go, and I'm good where I go\nLook my man got good aim and that's a good thing to know\nAnd he came home for good, off of good behavior\nSpittin that good game, so what's good with this paper\nAnd this is for the hoods, the crabs, the junkies\nWe showin you the good, the bad, the ugly\nChorus 1\n", "title": "The Good, The Bad & The Ugly lyrics"}, {"lyrics": "[ Consequence ]\nGood morning America, good morning to Erica\nWho gave me good head while watching good morning America\nAnd good day New York, have a good day in court\nMy niggaz drive around the hood looking for good yay' to snort\nI never liked the goodbyes, always caught a good vibe\nAlways had a good time, could always spot a good guy\nFrom a good guy, look alive, look alive, look or try\nYou know that old saying what they say about good guys\nI bet that's why I went bad, needed all my chips bad\nFiends needed it bad, started hittin liq' bad\nHad to get that work off before that shit went bad\nIf not, it gets bad, and things will only get bad\nSo now I'm getting bad skin, and I got that badge and\nTellin me them bastards, don't catch a bad break\nCaught a bad rate on whip with bad brakes\nI'm caught up in these bad ways havin a bad day\nSo now the game's ugly, and my pain's ugly\nAnd my chain's ugly, things became ugly, cuz I'm ugly ducklin\nGot a stain and its musty, wakin up looking crusty\nAnd miss thang who's ugly is sayin to me ?don't touch me?\nI went from pretty willie to pretty silly\nBut I'm still pretty gully so you thins will still get pretty ugly\nAnd this is for the hoods, the crabs, the junkies\nWe showin you the good, the bad, the ugly\nChorus 1: [Kanye West]\nWe showin you the good, the bad, the ugly\nB.I.G. said get ya money ain't no telling they gon love me\nWe showin you the good, the bad, the ugly\nWhen your money get funny and them days ain't sunny\nWe showin you the good, the bad, the ugly\nNiggaz give pounds and hug me, tho they really wanna slug me\nWe showin you the good, the bad, the ugly\nAnd this for the hood, you got to love me\n[Kanye West]\nGood morning to ummm, I don't remember your name\nBut I remember the brain, here go a fare for the train and\nGood morning to Chi-Town, where my niggaz ride down\nAnd bust clowns, and look for some bustdowns to bust down\nAnd she ain't got a car she on the bus now\nBut her gear is bangin, she one of us now\nI wanted badly to bone cuz she was bad to the bone\nShe from a batter home, she mad when she at home\nSo I gave her my number to beep off, she wanted to take a week off\nBustin scary movie nuts, I had to get the freak off\nThe new Tom Cruise, took the Moulan Rouge on a too long cruise\nShe said ?I ain't bonin you with them two long shoes?\nAnd I get bougie in a grape poupon mood\nSo I'm gon act cheap in a coupon mood\nShe said ?Ye' you don't love me??\nI told her that's the good, the bad, the ugly\nChorus 2:\nWe showin you the good, the bad, the ugly\nB.I.G. said get ya money ain't no telling they gon love me\nWe showin you the good, the bad, the ugly\nAnd this for the hood, you got to love me\n[Consequence]\nGood morning to Queens, the north side of my scene\nAnd when it comes down to it, I'm a ride for my team\nSee it's a beautiful life, but the bills will make it ugly\nAnd the beauty of life, is when you're forced to make it ugly\nHad a beautiful night, until a storm done made it ugly\nAnd a beautiful wife, now we divorcing and its ugly\nNow my mind state is ugly, my blind dates are ugly\nI'm ready to turn it up in the streets and make it ugly\nUsed to sit in Mr. Uglies with these chickens that were ugly\nAnd these bitches used to bug me to the point it made me ugly\nSay things that were ugly in regards to their tummies\nBut I took it all back, cuz God don't like ugly\nNow I'm curbin my bad words, they say that the bad burn\nI left it on bad terms, with a chic with a bad perm\nWhose case took a bad turn, and face caught a bad burn\nAnd took the news bad when they said she had bad germs\nThe bad thing about it, the bitch was bad and bout it\nBut the pussy smelled bad, so I had to get up out it\nSo now we got bad blood, her son is a bad blood\nBut it happens in the hood when you inherit that bad blood\nAnd once it get bad, it be bad for good\nTHAT'S BAD MEANING BAD NOT BAD MEANING GOOD\nBut I greet it as good, when you leave with the good\nIts all good in the hood, got called good cuz I'm good\nNow I'm havin some good nights, livin this good life\nGot me a good girl that I'm gon make me a good wife\nSo I'm, good to go, and I'm good where I go\nLook my man got good aim and that's a good thing to know\nAnd he came home for good, off of good behavior\nSpittin that good game, so what's good with this paper\nAnd this is for the hoods, the crabs, the junkies\nWe showin you the good, the bad, the ugly\nChorus 1\n", "title": "The Good, The Bad And The Ugly (Featuring Consequence) lyrics"}, {"album": "Album: College Dropout", "lyrics": "Yo G they can't stop me from rapping can they?\nCan that huh?\n[Chorus:]\nThrough the fire, to the limit, to the wall\nFor a chance to be with you, I'd gladly risk it all\nThrough the fire, through whatever come what may\nFor a chance at loving you, I'd take it all away\nRight down through the wire, even through the fire\nI spit it through the wire man\nTo much stuff on my heart right now man\nI'll probably risk it all right now\nIt's a life or death situation man\nY'all don't really understand how I feel right now man\nIt's your boy Kanye to the....\nChi-Town what's going on man\n[Verse 1:]\nI drink a boost for breakfast, and ensure for dizzert\nSomebody ordered pancakes I just sip the sizzurp\nThat right there could drive a sane man bizzerk\nNot to worry the Mr. H to the izzles back to wizzerk\nHow do you console my mom or give her light support\nWhen you telling her your sons' on life support\nAnd just imagine how my girl feel\nOn the plane scared as hell that her guy look like Emitt Till\nShe was with me before the deal she been trying to be mine\nShe a delta so she been throwing them Dynasty signs\nI'm use to trying to reline\nI been trying to signed\nTrying to be a millionaire\nHow I use two lifelines\nIn the same hospital where Biggie Smalls died\nThe doctor said I had blood clots\nBut I ain't Jamaican man\nStory on MTV and I ain't trying to make the band\nI swear this right here is history in the making man\n[Chorus]\nI really apologize how I sound right now man\nIf it's unclear at all, man\nThey got my mouth wired shut for like I don't know the doctor said for like six weeks\nYou know we had reconstru....\nI had reconstructive surgery on my jaw\nLooked in the mirror half my jaw was missing and half my mouth\nI couldn't believe it\nBut im still here for yall right now yo\nThis is what I gotta say yo\nYeah, turn me up yeah\n[Verse 2:]\nWhat if somebody from the Chi was ill got a deal on the hottest rap label around\nBut he wasn't talking bout coke and birds it was more like spoken word\nExcept he really putting it down\nAnd he explained the story about how blacks came from glory\nAnd what we need to do in the game\nGood dude, Bad night, Right place, Wrong time\nIn the blink of an eye his whole life changed\nIf you could feel how my face felt you would know how Mase felt\nThank God I ain't to cool for the safe belt\nI swear to God drive two on the sue\nI got lawyer for the case to keep whats in my safe; safe\nMy dawgs couldn't tell if I\nI look Tom Cruise on Vanilla Sky, it was televised\nAll they heard was that I was in an accident like GEICO\nThey thought I was burnt up like Pepsi did Michael\nI must gotta angel\nCause look how death missed his ass\nUnbreakable, would you thought they called me Mr. Glass\nLook back on my life like the ghost of Christmas past\nToys R Us where I used to spend that Christmas cash\nAnd I still wont grow up, I'm a grown ass kid\nSwear I should be locked up for stupid shit that I did\nBut I'm a champion, so I turned tragedy to triumph\nMake music that's fire, spit my soul through the wire\n[Chorus]\nKnow what im saying\nWhen the doctor told me I had a um..  I was goin to have a plate on my chin\nI said dawg don't you think didn't you realize I'll never make it on the plane now\nIts bad enough I got all this jewelry on\nCan't be serious man\n[Chorus repeats till fade]\n", "title": "Through The Wire lyrics"}, {"album": "Album: Late Registration", "lyrics": "Yo Ferris, they can't stop me from rappin', can they?\nI spit it through the wire, man\nIf this ain't dedication I don't know what is, man\nListen, first of all I want to thank you for your support\nChi-Town, what's goin' on?\nUh, yeah, feels like, uh, every sunshine is brighter\nSunsets feel righter\nPlease light ya lighter for the producer and the writer\nFeel like I wrote this\nI'm just here to quote this\nI don't know if you notice but I'm actually pitchin' bogus\nDoctor, doctor, would you please say somethin'?\nI know I almost was the final destination\nI musta had a blessin' from Pastor Mason\nCuz that trip to L.A. coulda been my last vacation\nAnd, man, I know I can drop a down payment on that Porsche Cayenne\nBut, what, I went along with the plan\nPaid for my own video, directed by my man\nMan, I know God was holdin' my hand\nWouldn't let me go before I go on Def Poetry Jam\nWouldn't let me throw in the towel 'fore I got to throw in some vowels\n'Bout what we goin' through now\nGirls got a crush on me like I did beats for Mr. Cheeks\nAnd since the accident they tellin' me it's the cheeks\nAnd if you look at history\nThat last rapper that almost died sold 6.5\n'Cept I'm comin' from the Chi\nThrough the wire to the wall\nAll my rhymes is raw\nAll these beats beats beats beats beats\nAll of them could of been lost\nI always got to floss\nI almost paid the cost\nSo before I go to sleep sleep sleep\nAlways thank the Lord\nFor this mic and my keyboard\nHeck naw, that boy is raw\nYou hear that? That's all that jewelry I got on man\nSometimes I take it off at the airport but I still get stopped\nThey be like \"There go Kayne, there go Kayne!\nCan I see some I.D. please? So thank you very much\"\nFirst of all, my momma named me Kanye so y'all gon' call me Kanye\nI'm like the girl on the 'Sixth Sense'\n\"I'm feelin' much better now\"\nI feel a whole hell of a lot better man\n", "title": "Through The Wire (Remix) lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Kanye West]\nWe in the streets playa, getcha mail\nIt's only two places you'll end up - either dead or in jail\nStill nowhere to go...still nowhere to go\nNow throw ya hands up bustless, bustas, boostas, hoes\nEverybody, fuck that\nStill nowhere to go...sill nowhere to go..\n[Mos Def]\nTwo words, United States, no love, no brakes\nLow brow, high stakes, crack smoke, black folks\nBig Macs, fat folks, ecstasy capsules\nPresidential scandals, everybody MOVE\nTwo words, Mos Def, K West, hot shit\nCalm down, get back, ghetto people, got this\nGame ball, lock shit, dump off, cock shit\nWe won't stop shit, everybody MOVE\nTwo words, BK , NY, bedstuy\nTwo hawks, too hungry, too many, that's why\nThese streets know game, can't ball, don't play\nEvery traffic, one lane, everybody MOVE\nTwo words, Mos Def, black check, hot shit\nCalm down, get back, ghetto people, got this\nGame point lock, long pump cocked\nWe won't stop, everybody MOVE\n[Chorus: Kanye West (Harlem Boys Choir)]\n[1] - Now throw ya hands up bustless, bustas (Throw your hands up high)\nBoostas, hoes, everybody, fuck that (ohhhhhh)\nStill nowhere to go...still nowhere to go... (ohhhhhh)\n[2] - and keep ya hands up bustless, bustas (Till they reach the sky)\nBoostas, hoes, everybody, fuck that (ohhhhhh)\nStill nowhere to go...still nowhere to go... (ohhhhhh)\n[Kanye West (Harlem Boys Choir)]\nAiyyo, two words, Chi town, South side, world wide\nCuz I, rep that, till I, fuckin die\nOne neck, two chains, one waist, two gats\nOne wall, twenty plaques, dudes say, \"Gimme that\"\nI am limelight, Blueprint, 5 Mics\nGo get his rhyme like, shoulda been signed twice\nMost imitated, Grammy nominated\nHotel accommodated, cheerleader, prom dated\nBarbershop, playa hated, mom and pop, bootlegged it\nFelt like it rained till the roof caved in\nTwo words, Chi town, raised me, crazy\nSo I live by two words, \"Fuck you, pay me\"\nScreamin, Jesus save me\nYou know how the game be\nI can't let em change me\nCuz on Judgment Day, you gon blame me\nLook God, it's the same me\nI (Throw) basically know now (Your) we could (Up) racially profile (High)\nCuffed up and hosed down, pimped up and hoe down (ohhhhhh)\nPlus I got a whole city to hold down (ohhhhhh)\nFrom the bottom to the top\nSo only place to go down\n[Chorus 2nd verse]\n[Freeway]\nTwo words, Freeway, two letters, A-R\nTurn y'all rap niggaz into two words, fast runners\nLike Jackie Jurner, you better sleep with your burner\nThe heat skeet, blow a reef through ya car\nMy God, two words, no guns, break arms\nBreak necks, break backs, Steven Segul\nFree...young bars, fresh men of the Roc\nLeft the beef in the pot Jay sent for his dogs\nand broads, forget ya squad, let em find for yourself\nHave you screamin out four words \"Send for the Lord\"\nTwo words, Freeway's slightly retarded\nFuck around, throw a clip in ya artist, leave with his broad..\n[Harlem Boys Choir (Mos Def)]\nThrow... (red) Your... (white)\nHands... (blue) Up... (black)\nThrow... (calm) Your... (down)\nHands... (move) Up... (back)\nThrow... (motherfuckers) Your... (askin)\nHands... (who is) Up... (that)\nThrow... (you know) Your... (it's the)\nHands... (almighty) Up... (Mighty Johnny Jack)\nThrow... (Mos) Your... (Def)\nHands... (K) Up... (West)\nThrow... (there go) Your... (people)\nHands... (get this) Up... (shit off ya chest)\nThrow... (north) Your... (to the south)\nHands... (to the east) Up... (to the west)\nThrow... (we got) Your... (that concert)\nHands... (it was no) Up... (contest)\nHIGH! (an show it to em like)\n", "title": "Two Words lyrics"}, {"album": "Album: Late Registration", "lyrics": "[Bernie Mac]\n[laughs]\nI knew I was gonna see ya, I knew I was gonna see you again!\nI was gonna see you again\nWhere your god damn book bag at?\nAlways carryin' that lil book bag\nNobody wanna see that\nGod damn fourth grader\nSit yo' ass down\n?? wanna play it again like he got somethin else to do\nYou ain't got nothin' else to do\nYou ain't doin nothin wit yo life\n[piano starts]\nNothing with your life\nWhat do you think this is?\nYou betta look at me when i'm talkin' to you!\nYou think this is easy don't you?\nYou think this is promised\nOh ain't nothin promised with you\nLook at my face, do I got a promise face?\nDoes it look like promise you anything?\nKanye!\nNi**a! Is you snorin' in my class?\nWake up Mr. West! Mr. West\n[echoes into next song]\n", "title": "Wake Up Mr. West(feat. Bernie Mac) lyrics"}, {"album": "Album: College Dropout", "lyrics": "Oh, yah i got the perfect song for the kids to sing\nAnd all my people thats drug dealing just to get by stack your money till it gets sky high we\nWeren't Suppose to make it past 25 jokes on you we still alive throw your hands up in the sky\nAnd say we don't care what people say\n[Verse 1]\nIf this is your first time hearin this you are about to experience somethin so cold man we\nNever had nothing handed took nothing for granted took nothin from no man, man im my own man\nBut as a shorty i loked up to the dopeman only adult man i knew that wasn't broke man flickin\nStarter coats man, man you don't know man we dont care what people say this is for my niggas\nOutside all winter cuz this summer they ain't finna say next summer im finna, sittin' in the\nHood like community colleges this dope money here is lil Tre's scholarship cuz aint no tuition\nFor having no ambition and ain't no loans for sittin your ass at home so we forced to sell\nCrack rap and get a job you gotta do somethin man your ass is grown\n[Chorus]\nDrug dealing just to get by stack your money till it gets sky high (kids sing kids sing) we\nWeren't Suppose to make it past 25 jokes on you we still alive throw your hands up in the sky\nAnd say we don't care what people say\n[Verse 2]\nThe second verse is for my dawgs working 9 to 5 that still hustle cuz a nigga can't shine off\n6.55 and everybody selling make up, jacob's and bootleg tapes just to get they cake up we put\nShit on layaway then come back we claim other people kids on our income tax we take that money\nCop work then push packs to get paid and we don't care what people say momma say she wanna\nMove south scratching lottery tickets eyes on a new house around the same time doe ran up in\nDude's house couldn't get a job so since he couldn't get work he figured he take work the drug\nGame bolemic it's hard to get weight so niggas money is homo its hard to get straight but we\nGonna keep baking to the day we get cake and we dont care what people say my niggas\n[Chorus]\nDrug dealing just to get by stack your money till it gets sky high (kids sing kids sing) we\nWeren't Suppose to make it past 25 jokes on you we still alive throw your hands up in the sky\nAnd say we don't care what people say\n[Verse 3]\nYou know the kids gonna act a fool when you stop the programs for after school and they DCFS\nSome of them dislexic they favorite 50 cent song is 12 Questions we scream rocks blow weed\nPark see now we smart we ain't retards the way teachers thought hold up hold fast we make mo\nCash now twll my momma i belong in that slow class it's bad enough we on welfare you trying to\nPut me on the school bus with the space for the wheel chair i'm trying to get the car with the\nChromy wheels here you trying to cut our lights out like we don't live here look at whats\nHanded us fathers abandon us when we get the hammers go and call the ambulance sometimes i\nFeel no one in this world understands us but we dont care what people say my niggas\n[Chorus]\nDrug dealing just to get by stack your money till it gets sky high (kids sing kids sing) we\nWeren't Suppose to make it past 25 jokes on you we still alive throw your hands up in the sky\nAnd say we don't care what people say\n", "title": "We Don't Care lyrics"}, {"album": "Album: Boost Mobile", "lyrics": "[Verse 1: Kanye West]\nYeah, yeah - I used to front when I write songs\nTalk about havin ice on, and I could barely keep my lights on\nAnd my beats was so sick, I shoulda got a medic\nBut my credit was so pathetic I couldn't afford a debit\nWhen the dropout dropped, I had to cop me a money tree\nTo front on anybody who ever tried to front on me\nWith so much personality, what do you want from me?\nI could be by myself and enjoy the company\nMy life, this year, my career, is the Lord\nBad chick, this award, is for Melissa Ford\nNinety-four I could only afford this Accord\nFrom the home of gangbangin and we all outdoors\nSouthside, outside, Westside, let's ride\nEastside, right B-Side, Lakeshore Drive\nAnd I'm (and I'm) Chi-Town's finest\nWhere you at? The whole city behind us\n[Chorus: Kanye West]\nWhere you at? The whole city behind us\nWhere you at? The whole city behind us\nSouthside, outside, Westside, let's ride\nWhere you at? The whole city behind us\n[Verse 2: Ludacris]\nIt ain't nuttin to it but to do it! I came here\nto shut the place down 'til my body stops pumpin red fluid\nA-Town I've been through it! And we steady gettin tested\nBut ready to fill your bubble when we put the lead to it\nOut West they still bangin, up top it's really gully\nDown South we get buck and turn hearts to Silly Putty\nLudacris I got silly money - you got jokes?\nI'll be laughin all the way to the bank - now that's really funny!\nBig city bright lights - and many pity cause we like fights\nMay be long days but it's fright nights\nLiving out the night life - and people asking 'Where You At?'\nNot the club; I stay in the get right!\nHotlanta home of the booties and the really tight skirts\nWhere if somebody moves then somebody gets hurt!\nFrom Decatur down to CP, and EP\nAdamsville to the battlefield it's D.T.P.\n[Chorus]\n[Verse 3: The Game]\nIt's Compton's prodigy\nObviously I'm from the home of hydraulics\nWhere they tie bandanas around the steerin collar\n'Nuff Impalas in to get holla\nWe fightin pitbulls and Rottweilers\nIn the projects the objective is make dollars\n'Where You At?' It ain't a problem to get it there by tomorrow\nCause I got a female friend, with frequent flier mileage\nI ain't never been to college got the IQ of a Rhodes Scholar\nIf you follow G-Unit throw up your dubs and yell holla\nTo all the Y.G.'s in khakis and white tees\nWith And 1's in every colour like Ice-T\nI might be the city of Compton's right knee\nThe way I paint pictures with these hip-hop scriptures\nPay attention while The Game shine like a prism\nGlisten, show you how canaries can alter one's vision\nNot to mention I am Dr. Dre christened on behalf\nof Luda and Kan-Yeezie, I'm gon' breathe easy\n[Chorus] - repeat 2X\n", "title": "Where You At? lyrics"}, {"lyrics": "[Intro]\nYou just popped in the Kanye West\nGet right for the summer workout tape\nAnd ladies if you follow these instructions exactly\nyou might bear to pull you a rapper, a NBA player\nMan, at least a dude wit' a car\nSo first of all we gon' work on the stomach\nNobody wants a little tight ass!\n[Verse 1]\n1 and 2 and 3 and 4 and get them sit ups right and\nTuck your tummy tight and do your crunches like this\nGive head, stop breathe, get up, check your weave\nDon't drop the blunt and disrespect the weed\nPick up your son and don't disrespect your seed\nIt's a party tonight and ooh she's so excited\nTell me who's invited: you, your friends and my dick\nWhat's scary to me is Henny makes girls look like Halle Berry to me\nSo excuse me miss, I forgot your name\nThank you, God bless you, good night I came..\nI came...\nI came..\n[Chorus]\nIt's been a week without me\nand she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nthen maybe we can work it out\nWork it out (Come on) [4x]\nWork it out now\nMaybe we can work it out (Come on, come on)\n[Verse 2]\nOh girl your silhouette make me wanna light a cigarette\nMy name Kanye from the Jigga set Twista said get it wet\nOoh girl your breath is HARSH\nCover your mouth up like you got SARS\nOff them tracks yea I bought them cars\nStill killa a nigga on 16 bars\nWe ain't sweatin' to the oldies we jukin to a cold beat\nMaybe one day girl we can bone\nso you can brag to all your homies now\nBut I still mess with a big girl if you ain't fit girl I'll hit girl\n1 and you brought 2 friends OK 3 more now hop in the Benz\nFour door do you know the difference between a 5, 6, 7, 8\nAll the mocha lattes you gotta do Pilates\nYou gotta pop this tape in before you start back dating\nHustlers, gangstas, all us, ballas\n[Chorus]\nIt's been a week without me\nand she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nthen maybe we can work it out\nWork it out (Come on) [4x]\nWork it out now\nMaybe we can work it out (Come on, come on)\n[Interlude: Ladies speaking w/ Kanye in the background]\n[Jill] Hi may name is Jill, I just want to say thanks to\nKanye's workout plan. I was able to pull a NBA player\nand like now I shop every day on Rodeo drive\nI just want to say, thank you Kanye! woooo! woooo! woooo!\n[Asandra] My name is Asandra, and I just want to say\nthat ever since listenin' to Kanye's workout tape\nI was able to get my phone bill paid, I got sounds and 13's\nput up in my Cavalier and I was able to get a free trip to Cancun\nAnd what's most importantly is that I ain't gotta fuck Ray Ray's\nbroke ass no mo'\n(Work it mo' juge it mo' pump it mo, Chi-town mo' let's go mo')\n[Alamae] My name is Alamae from Mobille, Alabama\nand I just want to say since listenin' to Kanye's workout tape\nI been able to date outside the family, I got a double wide\nAnd I rode the plane, rode the plane, rode the plane\n[Girl] Thanks to Kanye's workout plan\nI'm the envy of all my friends\nSee I pulled me a baller man (yeah)\nAnd I don't gotta work at the mall again\n[Beat changes]\n(Lemme break ya wit' a piece of)\nMy favorite work out plan (oh! oh! oh!)\nI wanna see you work out (yeah yeah yeah yeah, yeah yeah yeah yeah)\n(It's that old Michael Jackson shit)\nThat's right put in work, move your ass, go wizzerk\nGet your salad, no dessert\nGet that man you deserve\nIt's Kanye's workout plan\nI said it's Kanye's workout plan (Ladies and gentlemen)\nIt's Kanye's workout plan (Allow myself to introduce myself)\nHis woooorrrrkkoouut plan (This time around I want y'all to clap like this)\nThat's right put in work\nMove your ass, go wizzerk\nEat your salad, no dessert\nGet that man you deserve (Stop!)\nIt's Kanye's workout plan (Ok bring)\nI said it's Kanye's workout plan (I know y'all ain't tired)\nIt's Kanye's workout plan (But I hope not, 'cuz on this one I need ya)\nHis woooorrrrkkoouut plan (to give me a soul clap ok? double time)\nThat's right put in work (Woo!)\nMove your ass, go wizzerk (Ow!\nEat your salad, no dessert (Ugh!)\nGet that man you deserve\nThat's right put in work (Put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (No dessert)\nGet that man you deserve (You hear, ugh)\nThat's right put in work (That's right put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (Eat your salad, no dessert)\nGet that man you deserve (Woo!)\n(Okay, okay, okay, that's, that'd be good) [Applause and cheering]\n(I appreciate your time)\nI want to see you work out for me\nWoah yeah\n", "title": "Work It Out lyrics"}, {"album": "Album: College Dropout", "lyrics": "[Intro]\nYou just popped in the Kanye West\nGet right for the summer workout tape\nAnd ladies if you follow these instructions exactly\nyou might bear to pull you a rapper, a NBA player\nMan, at least a dude wit' a car\nSo first of all we gon' work on the stomach\nNobody wants a little tight ass!\n[Verse 1]\n1 and 2 and 3 and 4 and get them sit ups right and\nTuck your tummy tight and do your crunches like this\nGive head, stop breathe, get up, check your weave\nDon't drop the blunt and disrespect the week\nPick up your son and don't disrespect your seed\nIt's a party tonight and ooh she's so excited\nTell me who's invited: you, your friends and my dick\nWhat's scary to me is Henny makes girls look like Halle Berry to me\nSo excuse me miss, I forgot your name\nThank you, God bless you, good night I came..\nI came...\nI came..\n[Chorus]\nIt's been a week without me\nand she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nthen maybe we can work it out\nWork it out (Come on) [4x]\nWork it out now\nMaybe we can work it out (Come on, come on)\n[Verse 2]\nOh girl your silhouette make me wanna light a cigarette\nMy name Kanye from the Jigga set Twista set get it wet\nOoh girl your breath is HARSH\nCover your mouth up like you got SARS\nOff them tracks yea I bought them cars\nStill killa a nigga on 16 bars\nWe ain't sweatin' to the oldies we jukin to a cold beat\nMaybe one day girl we can bone\nso you can brag to all your homies now\nBut I still mess with a big firl if you ain't fit girl I'll hit girl\n1 and you brought 2 friends OK 3 more now hop in the Benz\nFour door do you know the difference between a 5, 6, 7, 8\nAll the mocha lattes you gotta do Pilates\nYou gotta pop this tape in before you start back dating\nHustlers, gangstas, all us, ballas\n[Chorus]\nIt's been a week without me\nand she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nthen maybe we can work it out\nWork it out (Come on) [4x]\nWork it out now\nMaybe we can work it out (Come on, come on)\n[Interlude: Ladies speaking w/ Kanye in the background]\n[Jill] Hi may name is Jill, I just want to say thanks to\nKanye's workout plan. I was able to pull a NBA player\nand like now I shop every day on Rodeo drive\nI just want to say, thank you Kanye! woooo! woooo! woooo!\n[Asandra] My name is Asandra, and I just want to say\nthat ever since listenin' to Kanye's workout tape\nI was able to get my phone bill paid, I got sounds and 13's\nput up in my Cavalier and I was able to get a free trip to Cancun\nAnd what's most importantly is that I ain't gotta fuck Ray Ray's\nbroke ass no mo'\n(Work it mo' juge it mo' pump it mo, Chi-town mo' let's go mo')\n[Alamae] My name is Alamae from Moville, Alabama\nand I just want to say since listenin' to Kanye's workout tape\nI been able to date outside the family, I got a double wide\nAnd I row the plain, row the plain, row the plain\n[Girl] Thanks to Kanye's workout plan\nI'm the envy of all my friends\nSee I pulled me a baller man (yeah)\nAnd I don't gotta work at the mall again\n[Beat changes]\n(Lemme break ya wit' a piece of)\nMy favorite work out plan (oh! oh! oh!)\nI wanna see you work out (yeah yeah yeah yeah, yeah yeah yeah yeah)\n(It's that old Michael Jackson shit)\nThat's right put in work, move your ass, go wizzerk\nGet your salad, no dessert\nGet that man you deserve\nIt's Kanye's workout plan\nI said it's Kanye's workout plan (Ladies and gentlemen)\nIt's Kanye's workout plan (Allow myself to introduce myself)\nHis woooorrrrkkoouut plan (This time around I want y'all to clap like this)\nThat's right put in work\nMove your ass, go wizzerk\nEat your salad, no dessert\nGet that man you deserve (Stop!)\nIt's Kanye's workout plan (Ok bring)\nI said it's Kanye's workout plan (I know y'all ain't tired)\nIt's Kanye's workout plan (But I hope not, 'cuz on this one I need ya)\nHis woooorrrrkkoouut plan (to give me a soul clap ok? double time)\nThat's right put in work (Woo!)\nMove your ass, go wizzerk (Ow!\nEat your salad, no dessert (Ugh!)\nGet that man you deserve\nThat's right put in work (Put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (No dessert)\nGet that man you deserve (You hear, ugh)\nThat's right put in work (That's right put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (Eat your salad, no dessert)\nGet that man you deserve (Woo!)\n(Okay, okay, okay, that's, that'd be good) [Applause and cheering]\n(I appreciate your time)\nI want to see you work out for me\nWoah yeah\n", "title": "Workout Plan lyrics"}, {"album": "Album: College Dropout Unreleased", "lyrics": "[Chorus]\nI go to Jacob wit 25 thou, you go wit 25 hundred, WoW\nI got eleven plaques on my wall right now\nYou got your first gold single damn nigga, WoW\n[Verse 1]\nH to the Izzo did 3 thou spins in a week\nYou get a thou in a month, WoW\nYall niggas want credit but yall need to slow down\nKanye to the killin yall from Chi-town, how your wife gon say\nShe never sold drugs a day in her life, but she still wanna pump the Ye\nAnd yall mad cuz yall not knowin, cuz these canaries so yellow\nWhen yall pull up whether to stop or keep goin\nI got G's, rock Rock n Roll tees wit no sleeves\nTats showin, tucked in strap showin\nHow he get seven tv's in that ?lac ?lac\n3 in the front, 2 in the back, 2 in that back, back\nWhile you in that hatchback\nAnd tryin to sell work and don't get shit from them packs back\nAnd try to rap, the studios wont give you ya daps back\nAnd try to get publishin, all you get in your ass capped\nAnd that's that\n[Chorus]\n[Verse 2]\nMagazines call me a rock star, bitches call me cock star\nBillboard pop star, neighborhood block star\nChi-town go-getting pimps, we mob-stars\nGingerbread man even says ?You're a monster?\nRemember that, uh-huh, that's that trek shit\nRemember back in ?92 niggas used to catch reck shit\nRemember that track I tracked for you bout 3 months ago\nUh-huh that's the one, now cut my check bitch\nAnd I aint feelin that Lexus or that CLK\nSee me like damn ?A C L K??\nYeah that's how we eatin and, keep us looking peace and then\nI aint kno we rap as good as he do beats and then\n[Chorus]\nH to the Izzo did 3 thou spins in a week\nYou get a thou in a month, WoW\nYall niggas want credit but yall need to slow down\nKanye to the killin yall from Chi-town\n", "title": "Wow lyrics"}]